const rawQnas = `
На основе поквартальных данных построена мультипликативная модель временного ряда. Скорректированные
+0,9

Имя Адольфа Кетле связано с
созданием теории среднего человека

Имя Э. Энгеля связано с
попыткой выявить на статистической основе закономерности формирования потребления

Чему равно число степеней свободы для остаточной суммы квадратов в линейной модели множественной регрессии
n-m-1

Имеются данные уравнения множественной регрессии:
0,610

Аддитивная модель временного ряда строится, если:
различных циклов

Чему равно число степеней свободы для факторной суммы квадратов в линейной модели множественной регрессии
m

Кто из ученых ввел в научный оборот термин «эконометрика»
Р.Фриш

Последовательность коэффициентов автокорреляции уровней первого
автокорреляционной функцией временного ряда

Любая последовательность работ в сетевом графике (в частном случае это одна работа), в которой конечное событие одной работы совпадает с начальным событием следующей за ней работы
путь

С увеличением числа объясняющих переменных скорректированный коэффициент детерминации
уменьшается

Уравнение линерализации (через натуральный логарифм) имеет параметры:
а равно (+1,35); b равно (+25)

Число степеней свободы при расчете общей дисперсии равно
числу наблюдений минус единица

К какой группе относятся эконометрические модели, которые отражают связи между макроэкономическими показателями на всех стадиях процесса воспроизводства
группа комплексных моделей

Число периодов, по которым рассчитывается коэффициент
лагом

Дано
2,737+0,053*х

Чему равно табличное значение F критерия Фишера для уравнения парной линейной регрессии, при уровне значимости равном 0,05; количество наблюдений в уравнении 15
4,67

Как связаны скорректированный и обычный коэффициенты детерминации
оптимизационные модели

Характеристика случайной величины, определяемая как
дисперсия

Какой категории в сетевой модели относится процесс пролеживания детали в очереди к станку
ожидание

Время наступления события i, превышение которого вызовет аналогичную задержку наступления завершающего события сети – это
поздний срок наступления события i

Если экономико-математическая модель задачи линейна, оптимальный план
в крайней точке области изменения переменных величин системы

Множественный коэффициент корреляции равен 0,8. Определите, какой процент дисперсии зависимой переменной У объясняется влиянием факторов Х1 и Х2
64%

Коэффициент, характеризующий долю дисперсии результативного признака y , объясняемую регрессией, в общей дисперсии результативного признака
коэффициент детерминации

Время наступления события i, превышение которого вызовет аналогичную задержку наступления завершающего события сети
поздний срок наступления события i

Сумма произведений значений случайной величины на соответствующие вероятности
математическое ожидание 

Аддитивная модель временного ряда строится, если
значения сезонной компоненты предполагаются постоянными для

О чем свидетельствует приближение определителя матрицы межфакторной корреляции к нулю
об усилении мультиколлинеарности факторов и ненадежности результатов множественной регрессии 

Наиболее наглядным видом выбора уравнения парной регрессии
графический

Линейные коэффициенты корреляции между уровнем результативного признака и тремя его факторами составляли: 0,72; 0,77; и 0,37, а β – коэффициенты соответственно: 0,35; 0,25; и 0,48. Число наблюдений равно 25
11,52 

Какой экономический барометр использовался с 1917 до 1929 г.
эндогенные переменные 

Множественный коэффициент корреляции равен 0,8. Определите, какой процент дисперсии зависимой переменной У объясняется влиянием факторов Х1 и Х2
64% 

Как называют функцию в экономико-математической модели, связывающую различные величины модели
целевой 

Экономический показатель, выражающийся при помощи целевой функции через другие экономические показатели
критерий оптимальности 

На основе поквартальных данных построена аддитивная модель
минус 5 

Время, которое необходимо для выполнения всех работ, предшествующих данному событию i, которое равно наибольшей из продолжительности путей, предшествующих данному событию – это
ранний срок наступления события i. 

Коэффициент автокорреляции
статические модели 

Исключите из списка ошибочное правило построения сетевого графика
длина стрелки зависит от времени выполнения работы 

Что должно происходить с коэффициентом детерминации при дополнительном включении во множественную регрессию «m+1» фактора 
коэффициент детерминации должен возрастать 

О чем свидетельствует приближение определителя матрицы межфакторной корреляции к единице
о снижении мультиколлинеарности факторов и надежности результатов множественной регрессии 

Показателем тесноты связи в уравнении линейной регрессии выступает 
линейный коэффициент корреляции 

Набор значений неизвестных переменных в экономико-математической модели (ЭММ), который удовлетворяет ее системе ограничений – это
решение экономико-математической модели 

Уравнение линерализации (через десятичный логарифм) имеет параметры
а равно (+1,479); b равно (-1,2) 

Имеются данные обследования в 12 семьях. Рост отца, см: 184; 188; 175; 175; 184; 178; 189; 192; 182; 184; 178; 195 Рост сына-подростка, см (возраст подростков одинаков): 165; 169; 163; 167; 164; 165; 171; 173; 175; 168; 167; 172 Оцените связь между признаками и сделайте вывод, влияет ли рост отца на рост сына-подростка, используя коэффициент Спирмена
0,607 прямая тесная связь

В каком году в научный оборот был введен термин «эконометрика»
1926 

График зависимости значений автокорреляционной функции временного ряда от величины лага (порядка коэффициента автокорреляции) называется
эндогенные переменные

Числовая характеристика совместного распределения
ковариация

Уравнение линерализации (через натуральный логарифм) имеет параметры
а равно (+0,301); b равно (-25)

На основе поквартальных данных построена аддитивная модель временного ряда. Скорректированные значения сезонной компоненты за первые три квартала равны: минус 3,5 – I
+4

Множественный коэффициент корреляции равен 0,8. Определите, какой процент дисперсии зависимой переменной У объясняется влиянием факторов Х1 и Х2
64%

Кто из перечисленных ниже авторов включал в число эконометрических методов и метод «затраты - выпуск» (статическую и динамическую модели)
n-1

Исключите элемен т, не включаемый в последовательность этапов при принятии оптимального решения любой экономической задачи
построение временного ряда переменных величин, включаемых в экономическую задачу

Какой категории в сетевой модели относится процесс пролеживания детали в очереди к станку
ожидание

Дано
10,4

Характеристика случайной величины, определяемая как
дисперсия 

Стандартизированные коэффициенты регрессии β
позволяют ранжировать факторы по силе их влияния на результат

Что должно происходить с коэффициентом детерминации при дополнительном включении во множественную регрессию «m+1» фактора
коэффициент детерминации должен возрастать

Согласно основной идее дисперсионного анализа, общая сумма
регрессионную и остаточную

По результатам социологического обследования получены данные
0,512

При оценке влияния выпуска продукции на себестоимость единицы продукции построено уравнение обратной функциональной зависимости. Значение коэффициента «а» равно 30; значение коэффициента «b» равно –1,5. Среднее значение фактора равно 9. Определите с помощью коэффициента эластичности силу влияния фактора на результат.
0,818%

К какому классификационному типу экономико-математических моделей относятся модели, в которых описываются корреляционно-регрессионные зависимости результата производства от одного или нескольких независимых факторов
статистические модели

Число периодов, по которым рассчитывается коэффициент
лагом

Число степеней свободы при расчете общей дисперсии равно
числу наблюдений минус единица

Число степеней свободы при расчете остаточной дисперсии
автокорреляционной функцией временного ряда

Уравнение линерализации (через десятичный логарифм) имеет параметры
а равно (+0,562); b равно (-0,2)

Аддитивная модель временного ряда строится, если
значения сезонной компоненты предполагаются постоянными для

Дано
17,27–0,73*х

Исключите из списка ошибочное правило построения сетевого графика
длина стрелки зависит от времени выполнения работы

С увеличением числа объясняющих переменных скорректированный коэффициент детерминации
уменьшается

Линейные парные коэффициенты корреляции между уровнем результативного признака (У) и двумя его факторами (x,z) составили
21,36

Модели, построенные на основе состояния одного объекта за ряд последовательных моментов времени
моделями временных рядов

Чему равно число степеней свободы для факторной суммы квадратов в линейной модели множественной регрессии
m

Чему равно число степеней свободы для остаточной суммы квадратов в линейной модели множественной регрессии
n-m-1

К какой группе относятся эконометрические модели, которые отражают связи между макроэкономическими показателями на всех стадиях процесса воспроизводства
группа комплексных моделей

На основе поквартальных данных построена аддитивная модель
минус 5

Число степеней свободы при расчете остаточной дисперсии равно
числу наблюдений минус число факторов минус единица 

Кто из перечисленных ниже авторов использовал в 1910 г. термин «эконометрия», вкладывая в это понятие математическое описание рядов экономических данных и отображение их в геометрической или графической форме
Павел Цьомпа 

Труды какого российского ученого привели к выделению в эконометрике направлений: экономико-математические методы и экономическая кибернетика связано с
В.С. Немчинова 

Чему равно табличное значение F критерия Фишера для уравнения парной линейной регрессии, при уровне значимости равном 0,05; количество наблюдений в уравнении 22
4,35 

Модели, связанные с показателями, сгруппированными различными способами –это 
экономико-статистические модели 

Согласно основной идее дисперсионного анализа, общая сумма
регрессионную и остаточную 

Корреляционную зависимость между последовательными уровнями
автокорреляцией уровней ряда 

Характеристика случайной величины, определяемая как
дисперсия 

Чему равно табличное значение F критерия Фишера для уравнения парной линейной регрессии, при уровне значимости равном 0,05; количество наблюдений в уравнении 15
4,67

Имя Э. Энгеля связано с
попыткой выявить на статистической основе закономерности формирования потребления 

Если экономико-математическая модель задачи линейна, оптимальный план
в крайней точке области изменения переменных величин системы

К чему приводит насыщение модели множественной регрессии лишними факторами
к статистической незначимости параметров регрессии по критерию Стьюдента 

Как связаны скорректированный и обычный коэффициенты детерминации
скорректированный коэффициент детерминации меньше обычного коэффициента детерминации 

Как называется коэффициент, показывающий, на сколько единиц изменится в среднем результат, если соответствующий фактор Хi изменится на одну единицу при неизменном среднем уровне других факторов
чистый коэффициент регрессии 

Чему равно число степеней свободы для остаточной суммы квадратов в линейной модели множественной регрессии
n-m-1

Имя Адольфа Кетле связано с 
созданием теории среднего человека 

Общая дисперсия результативного признака «У» равна 25. Объясняемая дисперсия равна 21. Число наблюдений равно 20. Тип уравнения – парная нелинейная регрессия. Определите фактическое значение F-критерия Фишера
94,500 

Частный F-критерий (множественная регрессия)
служат мерой для оценки включения фактора в модель 

На каком этапе сетевого планирования определяют временные характеристики всех работ с целью проведения в дальнейшем оптимизации сетевой модели, которая позволит улучшить эффективность использования какого-либо ресурса
этап календарного планирования 

К какому классификационному типу экономико-математических моделей относятся модели, в которых описываются корреляционно-регрессионные зависимости результата производства от одного или нескольких независимых факторов
статистические модели 

Кто из ученых ввел в научный оборот термин «эконометрика»
Р.Фриш 

Имеются данные уравнения множественной регрессии
0,60 

Дано
0,775; связь между признаками тесная

Полный путь, ближайший по длительности к критическому пути – это 
подкритический путь

Время наступления события i, превышение которого вызовет аналогичную задержку наступления завершающего события сети – это 
поздний срок наступления события i.

Что должно происходить с коэффициентом детерминации при дополнительном включении во множественную регрессию «m+1» фактора ? 
коэффициент детерминации должен возрастать

Коэффициент, показывающий среднее изменение результата с изменением фактора на одну единицу – это
коэффициент регрессии

Уравнение линерализации (через натуральный логарифм) имеет параметры:
а равно +1,162; b равно +0,25

Труды какого российского ученого привели к выделению в эконометрике направлений: экономико-математические методы и экономическая кибернетика связано с
остаточная дисперсия должна снижаться

Корреляционную зависимость между последовательными уровнями
автокорреляцией уровней ряда

Коэффициент, характеризующий долю дисперсии результативного признака y , объясняемую регрессией, в общей дисперсии результативного признака – это…
коэффициент детерминации

При оценке влияния выпуска продукции на себестоимость единицы продукции построено уравнение парной линейной регрессии. Значение коэффициента «а» равно 10; значение коэффициента «b» равно 12. Среднее значение фактора равно 5. Определите с помощью коэффициента эластичности силу влияния фактора на результат.
0,857%

Суть метода наименьших квадратов состоит в
M

Чему равно табличное значение F критерия Фишера для уравнения парной линейной регрессии, при уровне значимости равном 0,05; количество наблюдений в уравнении 10
5,32

На основе поквартальных данных построена аддитивная модель временного ряда. Скорректированные значения сезонной компоненты за первые три квартала равны: минус 3,5 – I
+4

Определите вид сформулированной ниже экономико-математической задачи.
задача об использовании ресурсов

К какому виду работ в сетевой модели относится передача измененных чертежей от конструкторов к технологам?
фиктивная работа

Множественный коэффициент корреляции равен 0,8. Определите, какой процент дисперсии зависимой переменной У объясняется влиянием факторов Х1 и Х2
созданием теории среднего человека

Кто из ученых ввел в научный оборот термин «эконометрика»?
Р.Фриш

Чему равно табличное значение F критерия Фишера для уравнения парной линейной регрессии, при уровне значимости равном 0,05; количество наблюдений в уравнении 22
4,35

Согласно основной идее дисперсионного анализа, общая сумма
регрессионную и остаточную

Дано
17,27–0,73*х

Любая последовательность работ в сетевом графике (в частном случае это одна работа), в которой конечное событие одной работы совпадает с начальным событием следующей за ней работы – это…
Путь

Суть метода наименьших квадратов состоит в:
минимизации суммы квадратов остаточных величин

Чему равно табличное значение F критерия Фишера для уравнения парной линейной регрессии, при уровне значимости равном 0,05; количество наблюдений в уравнении 15
4,67

Какой категории в сетевой модели относится процесс пролеживания детали в очереди к станку
Ожидание

Исключите элемен т, не включаемый в последовательность этапов при принятии оптимального решения любой экономической задачи
построение временного ряда переменных величин, включаемых в экономическую задачу

Мультипликативная модель временного ряда имеет вид:
T*S*E

Уравнение линерализации (через натуральный логарифм) имеет параметры:
а равно (+1,35); b равно (+25)

Какой экономический барометр использовался с 1917 до 1929 г.
Гарвардский барометр

Какие эконометрические модели основаны на одновременных данных по совокупности объектов?
статические модели

На основе поквартальных данных построена аддитивная модель временного ряда.
+4

Корреляционную зависимость между последовательными уровнями
автокорреляцией уровней ряда

Имеются данные уравнения множественной регрессии
0,60

При оценке влияния выпуска продукции на себестоимость единицы продукции построено уравнение обратной функциональной зависимости. Значение коэффициента «а» равно 20; значение коэффициента «b» равно 1,5. Среднее значение фактора равно 15. Определите с помощью коэффициента эластичности силу влияния фактора на результат.
-0,529%

Дано
10,4

К какому классификационному типу экономико-математических моделей относятся модели, которые представляют систему математических уравнений, линейных или нелинейных, подчиненных определенной целевой функции и служащих для
оптимизационные модели

Коэффициент линейного парного уравнения регрессии
одну единицу

На основе поквартальных данных построена аддитивная модель
минус 5

В трудах кого из перечисленных ниже авторов – представителей школы политических арифметиков, была провозглашена особенность количественного подхода к экономике: говорить об экономике на языке мер, весов и чисел?
Д. Граунт

Система математических уравнений, неравенств,
математическая модель

График зависимости значений автокорреляционной функции временного ряда от величины лага (порядка коэффициента автокорреляции) называется
Коррелограммой

Множественный коэффициент корреляции равен 0,8. Определите, какой процент дисперсии зависимой переменной У объясняется влиянием факторов Х1 и Х2
64%

К какому этапу сетевого планирования относится: Разбиения проекта на четко определенные операции, для которых определяется продолжительность. Затем строится сетевой график, который представляет взаимосвязи работ проекта
этап структурного планирования

Известные переменные, которые мы принимаем как заданные (извне по отношению к модели) – это…
экзогенные переменные

Неизвестные переменные, чью динамику (поведение) необходимо изучить и получить данные об их поведении в ходе решения (анализа) модели – это…
эндогенные переменные

Некоторый процесс в сетевой модели, приводящий к достижению определенного результата, требующий затрат каких-либо ресурсов и имеющий протяженность во времени – это
работа

Кто из перечисленных ниже авторов включал в число эконометрических методов и метод «затраты — выпуск» (статическую и динамическую модели)
Оскар Ланге

Чему равно табличное значение t критерия Стьюдента для уравнения парной линейной регрессии, при уровне значимости равном 0,05 (двусторонний); количество наблюдений в уравнении 14
2,179

Определите вид сформулированной ниже экономико-математической задачи.
задача об использовании ресурсов

К чему приводит насыщение модели множественной регрессии лишними факторами?
к статистической незначимости параметров регрессии по критерию Стьюдента

На основе поквартальных данных построена мультипликативная модель временного ряда. Скорректированные значения сезонной компоненты за первые три квартала равны: минус 3,5 – I
+8

Число периодов, по которым рассчитывается коэффициент
лагом

Число степеней свободы при расчете общей дисперсии равно…
числу наблюдений минус единица

Кем из ученых в 1955 г. была построена одна из первых комплексных эконометрических моделей?
Л. Клейном и А. Голдбергером

Исключите из списка ошибочное правило построения сетевого графика
длина стрелки зависит от времени выполнения работы

Число степеней свободы при расчете остаточной дисперсии равно
числу наблюдений минус число факторов минус единица

График зависимости значений автокорреляционной функции временного ряда от величины лага (порядка коэффициента автокорреляции) называется
коррелограммой

На основе поквартальных данных построена аддитивная модель
минус 5

Наиболее наглядным видом выбора уравнения парной регрессии
графический

Модели, построенные на основе состояния одного объекта за ряд последовательных моментов времени, называются
моделями временных рядов

Что должно происходить с остаточной дисперсией при дополнительном включении во множественную регрессию «m+1» фактора 
остаточная дисперсия должна снижаться

Дано
53,33+6,67*х

Как связаны скорректированный и обычный коэффициенты детерминации
скорректированный коэффициент детерминации меньше обычного коэффициента детерминации

Чему равно число степеней свободы для остаточной суммы квадратов в линейной модели множественной регрессии
n-m-1

Исключите элемен т, не включаемый в последовательность этапов при принятии оптимального решения любой экономической задачи
построение временного ряда переменных величин, включаемых в экономическую задачу

Коэффициент, показывающий среднее изменение результата с изменением фактора на одну единицу – это
коэффициент регрессии

Кто из перечисленных ниже авторов включал в число эконометрических методов и метод «затраты — выпуск» (статическую и динамическую модели)
Оскар Ланге

К чему приводит насыщение модели множественной регрессии лишними факторами
к статистической незначимости параметров регрессии по критерию Стьюдента

Определите вид сформулированной ниже экономико-математической задачи.
задача об использовании ресурсов

Кто из ученых ввел в научный оборот термин «эконометрика»
Р.Фриш

Множественный коэффициент корреляции равен 0,8. Определите, какой процент дисперсии зависимой переменной У объясняется влиянием факторов Х1 и Х2
64%

Чему равно табличное значение t критерия Стьюдента для уравнения парной линейной регрессии, при уровне значимости равном 0,05 (двусторонний); количество наблюдений в уравнении 14
2,179

Имя Э. Энгеля связано с
попыткой выявить на статистической основе закономерности формирования 

Неизвестные переменные, чью динамику (поведение) необходимо изучить и получить данные об их поведении в ходе решения (анализа) модели – это
эндогенные переменные

На основе поквартальных данных построена мультипликативная модель временного ряда. Скорректированные
 +0,7

Число степеней свободы при расчете остаточной дисперсии равно
числу наблюдений минус число факторов минус единица

Время, которое необходимо для выполнения всех работ, предшествующих данному событию i, которое равно наибольшей из продолжительности путей, предшествующих данному событию – это
ранний срок наступления события i

К какой группе относятся эконометрические модели, которые отражают связи между макроэкономическими показателями на всех стадиях процесса воспроизводства
группа комплексных моделей

Коэффициент линейного парного уравнения регрессии
показывает среднее изменение результата с изменением фактора на

Любая последовательность работ в сетевом графике (в частном случае это одна работа), в которой конечное событие одной работы совпадает с начальным событием следующей за ней работы – это
путь

Чему равно табличное значение t критерия Стьюдента для уравнения парной линейной регрессии, при уровне значимости равном 0,05 (двусторонний); количество наблюдений в уравнении 20
2,101

Время наступления события i, превышение которого вызовет аналогичную задержку наступления завершающего события сети – это
поздний срок наступления события i.

При оценке влияния выпуска продукции на себестоимость единицы продукции построено уравнение показательной зависимости. Значение коэффициента «а» равно 100; значение коэффициента «b» равно 0,5. Среднее значение фактора равно 0,3. Определите с помощью коэффициента эластичности силу влияния фактора на результат
-0,208%

Известные переменные, которые мы принимаем как заданные (извне по отношению к модели) – это
экзогенные переменные

Экономический показатель, выражающийся при помощи целевой функции через другие экономические показатели
критерий оптимальности

Показателем тесноты связи в уравнении линейной регрессии выступает
линейный коэффициент корреляции

Какой экономический барометр использовался с 1917 до 1929 г
Гарвардский барометр

К какому виду работ в сетевой модели относится сдача отчета о технико-экономических показателях работы цеха вышестоящему подразделению
фиктивная работа

На основе поквартальных данных построена аддитивная модель временного ряда. Скорректированные значения сезонной компоненты за первые три квартала равны +2,5 – I
-2

Корреляционную зависимость между последовательными уровнями
автокорреляцией уровней ряда

Линейные парные коэффициенты корреляции между уровнем результативного признака (У) и двумя его факторами (x,z) составили
0,544

К какому классификационному типу экономико-математических моделей относятся модели, в которых описываются корреляционно-регрессионные зависимости результата производства от одного или нескольких независимых факторов
статистические модели

Чему равно число степеней свободы для общей суммы квадратов в линейной модели множественной регрессии
n-1

Число степеней свободы при расчете остаточной дисперсии равно
числу наблюдений минус число факторов минус единица 

Кто из перечисленных ниже авторов использовал в 1910 г. термин «эконометрия», вкладывая в это понятие математическое описание рядов экономических данных и отображение их в геометрической или графической форме
Павел Цьомпа 

Труды какого российского ученого привели к выделению в эконометрике направлений: экономико-математические методы и экономическая кибернетика связано с
В.С. Немчинова 

Чему равно табличное значение F критерия Фишера для уравнения парной линейной регрессии, при уровне значимости равном 0,05; количество наблюдений в уравнении 22
4,35 

Модели, связанные с показателями, сгруппированными различными способами –это 
экономико-статистические модели 

Согласно основной идее дисперсионного анализа, общая сумма
регрессионную и остаточную 

Корреляционную зависимость между последовательными уровнями
автокорреляцией уровней ряда 

Характеристика случайной величины, определяемая как
дисперсия 

Чему равно табличное значение F критерия Фишера для уравнения парной линейной регрессии, при уровне значимости равном 0,05; количество наблюдений в уравнении 15
4,67

Имя Э. Энгеля связано с
попыткой выявить на статистической основе закономерности формирования потребления 

Если экономико-математическая модель задачи линейна, оптимальный план
в крайней точке области изменения переменных величин системы

К чему приводит насыщение модели множественной регрессии лишними факторами
к статистической незначимости параметров регрессии по критерию Стьюдента 

Как связаны скорректированный и обычный коэффициенты детерминации
скорректированный коэффициент детерминации меньше обычного коэффициента детерминации 

Как называется коэффициент, показывающий, на сколько единиц изменится в среднем результат, если соответствующий фактор Хi изменится на одну единицу при неизменном среднем уровне других факторов
чистый коэффициент регрессии 

Чему равно число степеней свободы для остаточной суммы квадратов в линейной модели множественной регрессии
n-m-1

Имя Адольфа Кетле связано с 
созданием теории среднего человека 

Общая дисперсия результативного признака «У» равна 25. Объясняемая дисперсия равна 21. Число наблюдений равно 20. Тип уравнения – парная нелинейная регрессия. Определите фактическое значение F-критерия Фишера
94,500 

Частный F-критерий (множественная регрессия)
служат мерой для оценки включения фактора в модель 

На каком этапе сетевого планирования определяют временные характеристики всех работ с целью проведения в дальнейшем оптимизации сетевой модели, которая позволит улучшить эффективность использования какого-либо ресурса
этап календарного планирования 

К какому классификационному типу экономико-математических моделей относятся модели, в которых описываются корреляционно-регрессионные зависимости результата производства от одного или нескольких независимых факторов
статистические модели 

Кто из ученых ввел в научный оборот термин «эконометрика»
Р.Фриш 

Имеются данные уравнения множественной регрессии
0,60 

Дано
0,775; связь между признаками тесная

График зависимости значений автокорреляционной функции временного ряда от величины лага (порядка коэффициента автокорреляции) называется
коррелограммой

Неизвестные переменные, чью динамику (поведение) необходимо изучить и получить данные об их поведении в ходе решения (анализа) модели
эндогенные переменные

Числовая характеристика совместного распределения
ковариация

Уравнение линерализации (через натуральный логарифм) имеет параметры
а равно (+0,301); b равно (-25)

На основе поквартальных данных построена аддитивная модель временного ряда. Скорректированные значения сезонной компоненты за первые три квартала равны: минус 3,5 – I
+4

Множественный коэффициент корреляции равен 0,8. Определите, какой процент дисперсии зависимой переменной У объясняется влиянием факторов Х1 и Х2
64%

Кто из перечисленных ниже авторов включал в число эконометрических методов и метод «затраты — выпуск» (статическую и динамическую модели)?
Оскар Ланге

Чему равно число степеней свободы для общей суммы квадратов в линейной модели множественной регрессии
n-1

Исключите элемен т, не включаемый в последовательность этапов при принятии оптимального решения любой экономической задачи
построение временного ряда переменных величин, включаемых в экономическую задачу

Какой категории в сетевой модели относится процесс пролеживания детали в очереди к станку
ожидание

Дано
10,4

Характеристика случайной величины, определяемая как
дисперсия 

Стандартизированные коэффициенты регрессии β
позволяют ранжировать факторы по силе их влияния на результат

Что должно происходить с коэффициентом детерминации при дополнительном включении во множественную регрессию «m+1» фактора
коэффициент детерминации должен возрастать

Согласно основной идее дисперсионного анализа, общая сумма
регрессионную и остаточную

По результатам социологического обследования получены данные
0,595 связь существенная

Линейные парные коэффициенты корреляции между уровнем результативного признака (У) и двумя его факторами (x,z) составили
0,512

При оценке влияния выпуска продукции на себестоимость единицы продукции построено уравнение обратной функциональной зависимости. Значение коэффициента «а» равно 30; значение коэффициента «b» равно –1,5. Среднее значение фактора равно 9. Определите с помощью коэффициента эластичности силу влияния фактора на результат.
0,818%

К какому классификационному типу экономико-математических моделей относятся модели, в которых описываются корреляционно-регрессионные зависимости результата производства от одного или нескольких независимых факторов
статистические модели

Число периодов, по которым рассчитывается коэффициент
лагом

Число степеней свободы при расчете общей дисперсии равно
числу наблюдений минус единица

Число степеней свободы при расчете остаточной дисперсии
числу наблюдений минус число факторов минус единица

Последовательность коэффициентов автокорреляции уровней первого
автокорреляционной функцией временного ряда

Уравнение линерализации (через десятичный логарифм) имеет параметры
а равно (+0,562); b равно (-0,2)

Аддитивная модель временного ряда строится, если
значения сезонной компоненты предполагаются постоянными для

Дано
17,27–0,73*х

Исключите из списка ошибочное правило построения сетевого графика
длина стрелки зависит от времени выполнения работы

С увеличением числа объясняющих переменных скорректированный коэффициент детерминации
уменьшается

Линейные парные коэффициенты корреляции между уровнем результативного признака (У) и двумя его факторами (x,z) составили
21,36

Модели, построенные на основе состояния одного объекта за ряд последовательных моментов времени
моделями временных рядов

Чему равно число степеней свободы для факторной суммы квадратов в линейной модели множественной регрессии
m

Определите вид сформулированной ниже экономико-математической задачи
задача об использовании ресурсов

Чему равно число степеней свободы для остаточной суммы квадратов в линейной модели множественной регрессии
n-m-1

К какой группе относятся эконометрические модели, которые отражают связи между макроэкономическими показателями на всех стадиях процесса воспроизводства
группа комплексных моделей

На основе поквартальных данных построена аддитивная модель
минус 5
`;

const qnas = rawQnas
    .split('\n\n')
    .slice(1)
    .map(rawQna => {
        const question = rawQna.split('\n')[0].trim().toLowerCase();
        const answer = rawQna.split('\n')[1].trim().toLowerCase();
        return { question, answer }; 
    });

console.log(qnas);

const questionElements = Array.from(document.querySelector('#region-main > [role="main"] > form > div').childNodes).filter(testElement => testElement.id.includes('question-'));
for (const questionElement of questionElements)
{
    const questionText = questionElement.querySelector('.qtext').innerText.trim().toLowerCase();

    const answerText = qnas.find(qna => questionText.includes(qna.question))?.answer;
    if (answerText === undefined)
    {
        console.log(`Неизвестный вопрос "${questionText}".`);
        continue;
    }

    const answerOptions = Array.from(questionElement.querySelectorAll('.answer > div'));

    const exactMatchAnswerOption = answerOptions.find(answerOption => {
        const answerLabel = answerOption.querySelector('label').innerText.trim().toLowerCase();
        return answerLabel === answerText;
    });
    if (exactMatchAnswerOption !== undefined) {
        exactMatchAnswerOption.querySelector('label').innerText += '.';
        continue;
    }

    const partialMatchAnswerOptions = answerOptions.filter(answerOption => {
        const answerLabel = answerOption.querySelector('label').innerText.trim().toLowerCase();
        return answerLabel.includes(answerText);
    });

    if (partialMatchAnswerOptions.length === 1) {
        const singlePartialMatchAnswerOption = partialMatchAnswerOptions[0];
        singlePartialMatchAnswerOption.querySelector('label').innerText += '.';
        continue;
    }

    console.log(`Нет подходящего варианта ответа для вопроса "${questionText}".`);
    questionElement.querySelector('.qtext').style.marginBottom = 0;
    questionElement.querySelector('.ablock').style.marginTop = 0;
    const answerElement = document.createElement('div');
    answerElement.style.opacity = 0;
    answerElement.innerText = answerText;
    answerElement.addEventListener('click', function() {
        answerElement.style.opacity = 1 - answerElement.style.opacity;
    });
    questionElement.querySelector('.qtext').insertAdjacentElement('afterend', answerElement);
}
