// Поддерживаются только вопросы с одним вариантом ответа.
// Вопрос и ответ должны быть на разных строках. Между вопросами должны быть пустые строки. Перед первым вопросом должна быть пустая строка.

// const rawQnas = `
// `;

const rawQnas = `

Как соотносятся диаграммы кооперации и диаграммы объектов
диаграмма объектов показывает статику, а диаграмма взаимодействия описывает динамические аспекты информационной системы

Разновидностью какой диаграммы UML являются диаграммы активностей?
диаграммы состояний

Что такое кодогенерация
генерация кода из существующей UML-модели

Что такое диаграмма с математической точки зрения
граф

Выберите истинные утверждения, касающиеся формальных спецификаций
формализация некоторых задач может оказаться сложнее, чем сама разработка

Эта задача, решаемая с помощью экспертных информационных систем, содержит обнаружение неисправности в некоторой системе
диагностика

Конкретной реализацией этого типа задач, решаемых с помощью экспертных систем, является контроль аварийных датчиков на химическом заводе
мониторинг

Каким образом отображается на диаграмме последовательностей порядок отправки и приема сообщений?
место сообщения в последовательности определяется его положением на шкале времени, роль которой играют линии жизни

Начало какого этапа жизненного цикла ПО знаменует собой создание диаграммы классов?
проектирования

Конкретной реализацией этого типа задач, решаемых с помощью экспертных систем, является обнаружение и идентификация различных типов океанских судов
интерпретация данных

Выберите из списка истинные утверждения
UML может быть использован для реверс-инжиниринга

Какая характеристика текста является значимой в UML-диаграммах
начертание

Как соотносятся понятия Modeling и Simulation
modeling означает создание описательной модели объекта, а simulation предполагает получение с помощью созданной модели дополнительной информации

Почему некоторые сообщения на диаграммах последовательностей иногда обозначают пунктирной линией?
таким образом обозначаются ответные сообщения

Что такое синхронное сообщение (в диаграммах)
сообщение, которое приостанавливает поток выполнения до тех пор, пока не будет получен ответ

Единая система данных, организованная по определенным правилам, которые предусматривают общие принципы описания, хранения и обработки данных:
база данных

Какие виды линий используются в UML-диаграммах
сплошная

Сколько конечных состояний может содержать диаграмма активностей
больше одного

Программное обеспечение, автоматически собирающее и классифицирующее информацию о сайтах в Internet, и выдающее ее по запросу пользователей
поисковая система

В чем отличие диаграмм деятельности от диаграмм взаимодействия
диаграммы деятельности описывают переход от одной деятельности к другой, а диаграммы взаимодействия – переход потока управления от объекта к объекту

Символ синхронизации используется на диаграмме активностей в случаях, когда
нужно изобразить два или более одновременных потока

Что такое реверс-инжиниринг применительно к UML
создание UML-модели из существующего кода

Конкретной реализацией этого типа задач, решаемых с помощью экспертных систем, является синтез электрических цепей:
планирование

Аналогом какой диаграммы является диаграмма кооперации
последовательностей

Эта задача, решаемая с помощью экспертных информационных систем, содержит определение смысла данных, результаты которого должны быть согласованными и корректными:
интерпретация данных

В чем состоит различие между диаграммой последовательностей и диаграммой кооперации
диаграмма последовательностей делает основной акцент на упорядочении сообщений во времени, а диаграмма кооперации - на структурной организации объектов, посылающих сообщения

Вся совокупность полезной информации и процедур, которые можно к ней применить, чтобы произвести новую информацию о предметной области:
знания

Частным случаем какой диаграммы является диаграмма деятельностей
диаграммы состояний

Что такое суперкласс
более общий класс, конкретным воплощением которого является подкласс

Используются ли в UML трехмерные фигуры
да, на диаграмме развертывания

Выберите из списка истинные утверждения, касающиеся классов
классы – это строительные блоки любой объектно-ориентированной системы; класс – это категория вещей, которые имеют общие атрибуты и операции

Конкретной реализацией этого типа задач, решаемых с помощью экспертных систем, является обнаружение ошибок в аппаратуре и математическом обеспечении компьютера:
диагностика

В чем состоит различие между диаграммой последовательностей и диаграммой кооперации
диаграмма последовательностей делает основной акцент на упорядочении сообщений во времени, а диаграмма кооперации - на структурной организации объектов, посылающих сообщения

Выберите из списка истинные утверждения, касающиеся понятия эктора
экторами могут быть пользователи системы; эктор – это множество логически связанных ролей, исполняемых при взаимодействии с прецедентами

Какие виды линий используются в UML-диаграммах
сплошная

Что такое кодогенерация
генерация кода из существующей UML-модели

Выберите из списка истинные утверждения, касающиеся UML-моделей:
создавая UML-модель, мы тем самым документируем систему

Как соотносятся понятия Modeling и Simulation?
modeling означает создание описательной модели объекта, а simulation предполагает получение с помощью созданной модели дополнительной информации

Какие элементы модели могут быть уточнены с помощью диаграмм активностей?
любые элементы модели, имеющие динамическое поведение

Что такое инкапсуляция?
сокрытие от пользователя внутреннего устройства объектов

Конкретной реализацией этого типа задач, решаемых с помощью экспертных систем, является контроль аварийных датчиков на химическом заводе:
мониторинг

Чем активные объекты на диаграмме отличаются от пассивных?
активный объект владеет собственным потоком управления и может инициировать выполнение действий, а пассивный объект содержит данные, но не может инициировать выполнение

В проектировании ИС множество взаимосвязанных элементов...
система

Что такое интерфейс?
логическая группа открытых (public) операций объекта

Выберите из списка истинные утверждения, касающиеся диаграммы объектов:
диаграммы объектов показывают множество объектов и отношений между ними в некоторый момент времени

Что такое диаграмма взаимодействия?
диаграмма, на которой представлено взаимодействие, состоящее из множества объектов и отношений между ними, включая и сообщения, которыми они обмениваются

Конкретной реализацией этого типа задач, решаемых с помощью экспертных систем, является оценка будущего урожая:
прогнозирование

Для чего в первую очередь применяются диаграммы кооперации уровня спецификации?
чтобы изучить роли, выполняемые классами внутри системы

Эта задача, решаемая с помощью экспертных информационных систем, содержит нахождение планов действий...
планирование

Каким образом на диаграммах UML изображается наследование?
не закрашенной треугольной стрелкой, направленной в сторону суперкласса

служит для ведения диалога с пользователем
подсистема общения

Что такое профайл UML
пакет расширений для моделирования систем из специфической предметной области

Совокупность программных и языковых средств, предназначенных для управления данными...
СУБД

Эта задача, решаемая с помощью экспертных информационных систем, содержит вывод вероятных следствий...
прогнозирование

Что такое реверс-инжиниринг применительно к UML?
создание UML-модели из существующего кода

Что такое найденные сообщения (в диаграммах)?
сообщения, для которых известен адресат, но неизвестен отправитель

Разновидностью какой диаграммы UML являются диаграммы активностей?
диаграммы состояний

Символ синхронизации используется на диаграмме активностей в случаях, когда ...
нужно изобразить два или более одновременных потока

Почему некоторые сообщения на диаграммах последовательностей иногда обозначают пунктирной линией?
таким образом обозначаются ответные сообщения

Каким образом отображается на диаграмме последовательностей порядок отправки и приема сообщений?
место сообщения в последовательности определяется его положением на шкале времени, роль которой играют линии жизни

Начало какого этапа жизненного цикла ПО знаменует собой создание диаграммы классов?
проектирования

Как соотносятся диаграммы кооперации и диаграммы объектов?
диаграмма объектов показывает статику, а диаграмма взаимодействия описывает динамические аспекты информационной системы

Какой элемент диаграмм кооперации изображен на рисунке?
мультиобъект

Чем конечное состояние потока отличается от конечного состояния?
конечное состояние потока означает завершение одного потока управления, а конечное состояние говорит о завершении всех потоков управления внутри деятельности

Каким образом объекты внутри информационной системы взаимодействуют между собой?
путем отправки и приема сообщений

Формализованная система сведений о некоторой предметной области...
база знаний

При использовании какого подхода UML предоставляет максимум преимуществ?
объектно-ориентированное проектирование

Механизм рассуждений, оперирующий знаниями и данными с целью получения новых данных, это:
машинно-логический вывод

Что такое синхронное сообщение (в диаграммах)?
сообщение, которое приостанавливает поток выполнения до тех пор, пока не будет получен ответ

Какие преимущества диаграмма деятельностей имеет перед блок-схемой?
позволяет изобразить параллельные потоки деятельностей

Эта задача... содержит определение смысла данных, результаты которого должны быть согласованными и корректными:
интерпретация данных

Обязательно ли изображение фокуса управления на диаграммах последовательностей?
нет, это зависит от личного стиля проектировщика

В чем отличие диаграмм деятельности от диаграмм взаимодействия?
диаграммы деятельности описывают переход от одной деятельности к другой, а диаграммы взаимодействия – переход потока управления от объекта к объекту

Что такое композитный объект на диаграмме?
высокоуровневый объект, состоящий из нескольких частей-объектов

Для чего диаграммы деятельности чаще всего используются на практике?
для моделирования процессов

Какие еще виды диаграмм... можно использовать для моделирования динамических аспектов систем?
диаграммы последовательностей

Аналогом какой диаграммы является диаграмма кооперации?
диаграммы последовательностей

необходима, для того чтобы дать пользователю возможность контролировать ход рассуждений
подсистема объяснений

Что является основой для реализации механизма интерфейсов в языках программирования?
полиморфизм

Чем UML НЕ является?
языком программирования

Эта задача... содержит обнаружение неисправности в некоторой системе:
диагностика

Какой из модификаторов видимости изображается в UML с помощью символа #?
protected

Что такое суперкласс?
более общий класс, конкретным воплощением которого является подкласс

Конкретной реализацией этого типа задач... является синтез электрических цепей:
планирование

После сортировки по возрастанию по третьему полю записи будут располагаться в порядке:
4, 1, 3, 2

Как соотносятся понятия «модель» и «диаграмма»?
диаграммы – это средство визуализации модели

Что такое асинхронное сообщение (в диаграммах)?
сообщение, которое не ждет ответа, и сразу после их посылки происходит переход к следующему шагу последовательности

Какие конструкции чаще всего используют при проектировании операций с помощью диаграмм активностей?
принятие решения

Эта задача... содержит непрерывную интерпретацию данных в реальном масштабе времени и сигнализацию...
мониторинг

Как расшифровывается аббревиатура UML?
Unified Modeling Language

Как соотносятся между собой понятия агрегации и композиции?
агрегация предполагает, что части, отделенные от целого, могут продолжать свое существование независимо от него, под композицией понимается ситуация, когда независимо от целого части существовать не могут

Использование каких элементов UML, кроме объектов, допускается на диаграмме последовательностей?
экторы

Единая система данных, организованная по определенным правилам...
база данных

Каким образом на диаграммах кооперации отображается последовательность сообщений?
сообщения на диаграмме кооперации пронумерованы в порядке отправки

Вся совокупность полезной информации и процедур...
знания

Какие три принципа лежат в основе ООП?
инкапсуляция, полиморфизм, наследование

Что такое кооперация в проектировании ИС?
набор взаимодействующих ролей, используемых вместе, чтобы показать некую функциональность

Элементы нотации каких видов используются в UML?
фигуры, надписи, линии

Чем нотация диаграмм развертывания отличается от нотации других диаграмм UML?
использованием «трехмерных» фигур

Выберите из списка истинные утверждения, касающиеся диаграммы состояний:
диаграммы состояний служат для моделирования динамических аспектов системы; диаграмма состояний описывает процесс изменения состояний определенного объекта; диаграммы состояний применяются для того, чтобы объяснить, каким образом работают сложные объекты

Выберите из списка слова, которые могут быть помещены вместо многоточия. UML – это ... язык
формальный

В проектировании ИС множество взаимосвязанных элементов, каждый из которых связан прямо или косвенно с каждым другим элементом, а два любые подмножества этого множества не могут быть независимыми, не нарушая целостность, единство системы:
единство
система
совокупность
сеть

Эта задача, решаемая с помощью экспертных информационных систем, содержит непрерывную интерпретацию данных в реальном масштабе времени и сигнализацию о выходе тех или иных параметров за допустимые пределы:
мониторинг

Что такое рефлексивное сообщение (в диаграммах)
сообщение, отправленное объектом самому себе

Что означает символ «ромба» на диаграмме деятельностей
принятие решения

Для чего в первую очередь применяются диаграммы кооперации уровня экземпляров
чтобы показать набор взаимодействующих объектов в реальном окружении

Могут ли диаграммы деятельностей быть вложенными
да, при моделирования составных деятельностей

Какие разделы могут использоваться в символе класса на UML-диаграмме
раздел атрибутов

В каких из описанных ситуаций уместно использование диаграмм активностей
для моделирования выполнения операций

Какой тип ассоциации называется n-арной ассоциацией
это ассоциация, объединяющая три и более класса

Элементы нотации каких видов используются в UML
линии

Можно ли использовать диаграммы деятельностей для описания динамики не одного объекта, а их совокупности
да, это одно из применений диаграмм деятельностей

Выберите из списка ЛОЖНЫЕ утверждения относительно текстовых комментариев в UML-моделях
комментарии могут содержать только формальные ограничения

Формализованная система сведений о некоторой предметной области, содержащая данные о свойствах объектов, закономерностях процессов и правила использования в задаваемых ситуациях этих данных для принятия новых решений
база знаний

Эта задача, решаемая с помощью экспертных информационных систем, содержит нахождение планов действий, относящихся к объектам, способным выполнять некоторые функции
планирование

В проектировании ИС совокупность объектов реального или предполагаемого мира, рассматриваемых в пределах данного контекста, который понимается как отдельное рассуждение, фрагмент научной теории или теория в целом и ограничивается рамками информационных технологий избранной области
предметная область

UML предназначен для
проектирования

Эта задача, решаемая с помощью экспертных информационных систем, содержит вывод вероятных следствий из заданных ситуаций
прогнозирование

Какие еще виды диаграмм, кроме диаграмм активностей, можно использовать для моделирования динамических аспектов систем
диаграммы последовательностей
`;

const qnas = rawQnas
  .split("\n\n")
  .slice(1)
  .map((rawQna) => {
    const question = rawQna.split("\n")[0].trim().toLowerCase();
    const answer = rawQna.split("\n")[1].trim().toLowerCase();
    return { question, answer };
  });

console.log(qnas);

const questionElements = Array.from(
  document.querySelector('#region-main > [role="main"] > form > div')
    .childNodes,
).filter((testElement) => testElement.id.includes("question-"));
for (const questionElement of questionElements) {
  const questionText = questionElement
    .querySelector(".qtext")
    .innerText.trim()
    .toLowerCase();

  const answerText = qnas.find((qna) =>
    questionText.includes(qna.question),
  )?.answer;
  if (answerText === undefined) {
    console.log(`Неизвестный вопрос "${questionText}".`);
    continue;
  }

  const answerOptions = Array.from(
    questionElement.querySelectorAll(".answer > div"),
  );

  const exactMatchAnswerOption = answerOptions.find((answerOption) => {
    const answerLabel = answerOption
      .querySelector("label")
      .innerText.trim()
      .toLowerCase();
    return answerLabel === answerText;
  });
  if (exactMatchAnswerOption !== undefined) {
    exactMatchAnswerOption.querySelector("label").innerText += ".";
    continue;
  }

  const partialMatchAnswerOptions = answerOptions.filter((answerOption) => {
    const answerLabel = answerOption
      .querySelector("label")
      .innerText.trim()
      .toLowerCase();
    return answerLabel.includes(answerText);
  });

  if (partialMatchAnswerOptions.length === 1) {
    const singlePartialMatchAnswerOption = partialMatchAnswerOptions[0];
    singlePartialMatchAnswerOption.querySelector("label").innerText += ".";
    continue;
  }

  console.log(`Нет подходящего варианта ответа для вопроса "${questionText}".`);
  questionElement.querySelector(".qtext").style.marginBottom = 0;
  questionElement.querySelector(".ablock").style.marginTop = 0;
  const answerElement = document.createElement("div");
  answerElement.style.opacity = 0;
  answerElement.innerText = answerText;
  answerElement.addEventListener("click", function () {
    answerElement.style.opacity = 1 - answerElement.style.opacity;
  });
  questionElement
    .querySelector(".qtext")
    .insertAdjacentElement("afterend", answerElement);
}
