const rawQnas = `
Имеют ли право аудиторские организации привлекать на договорной основе в качестве экспертов лиц, не состоящих в штате аудиторской организации и обладающих специальными знаниями в области компьютерной обработки данных (КОД)?
имеют в соответствии с законодательством Республики Беларусь

Под уровнем существенности понимается…:
предельное значение ошибки

Способ контроля, выраженный в искусственном создании должностными лицами контролирующих (надзорных) органов ситуации по приобретению товарно-материальных ценностей…:
контрольная закупка

Обязаны ли аудиторы вести учёт заключённых договоров оказания аудиторских услуг?
обязаны

Аудитор должен соответствовать следующим критериям:
физическое лицо, имеющее квалификационный аттестат аудитора и включенное в реестр аудиторов

Обязательный аудит достоверности бухгалтерской (финансовой) отчётности проводится…?
акционерных обществ

Акт (справка) проверки составляется в количестве…:
двух и более экземпляров

По объему охватываемых проверкой хозяйственных операций проверки делятся на …:
сплошные, выборочные и комбинированные

Система контроля состоит из следующих подсистем…:
контролирующей и контролируемой

В ходе подписания договора аудитор …:
все ответы верны

Какие виды предпринимательской деятельности аудиторам осуществлять запрещается?
розничная торговля

В акте (справке) по результатам проверки осуществляется…:
выводы и предложения по контрольным действиям

Для проверки размера необоснованного списания сырья на производство при выпуске определённого вида готовой продукции используется…:
обратная калькуляция

Что является объектом аудита?
информация, содержащаяся в бухгалтерской (финансовой) отчетности

Материалы проверки могут быть переданы в следственные органы на этапе…:
реализации материалов проверки

Проверка соблюдения действующих форм документов, полноты и правильности заполнения их реквизитов – это…:
формальная проверка

В информационной базе данных контролирующих (надзорных) органов осуществляется…:
контроль выполнения решений, принятых по результатам проверки

Риск существенного искажения бухгалтерской (финансовой) отчетности в условиях компьютерной обработкой данных (КОД) повышается в том случае, если?
компьютеризованная среда децентрализована

Выборочные проверки проводятся…:
с учетом критериев оценки степени риска

Документальный контроль – это…:
проверка различных документов

Фактический контроль – это…:
проверка фактического наличия и использования средств

В зависимости от объема охватываемых вопросов деятельности проверки подразделяются на…:
полные и частичные

Продолжение осмотра, но с одновременным ознакомлением с документами как нормативными, так и оправдательными, с получением объяснения от ответственных лиц называется…:
обследование

В чек листе проверки определяется…:
выбор контрольных процедур

Что такое обязательный аудит?
аудит, обязательность проведения которого установлена законодательными актами

Аудиторские доказательства – это…:
информация, полученная аудитором при проведении аудита и используемая при формировании выводов

Если выявленные искажения бухгалтерской отчетности намного меньше рассчитанного уровня существенности, то аудитор должен…:
выразить немодифицированное аудиторское мнение о достоверности отчетности

Какой принцип аудита заключается в обязательности отсутствия у аудитора финансовой, имущественной или иной заинтересованности в деятельности аудируемого лица, а также какой-либо зависимости от третьих лиц, которая может повлиять на объективность аудиторского мнения?
принцип независимости

Меры дисциплинарной ответственности…:
замечание, выговор, увольнение

Является ли обязательным требованием к физическому лицу, претендующему на получение квалификационного аттестата аудитора, наличие безупречной деловой (профессиональной) репутации:
да

Какие виды услуг не относятся к иным аудиторским или профессиональным услугам аудиторов?
услуги по микрокредитованию и страхованию

Аудитор обязан подтверждать свою квалификацию…:
не реже одного раза в 2 года

Риск существенного искажения бухгалтерской (финансовой) отчетности в условиях компьютерной обработкой данных (КОД) снижается в том случае, если?
все структурные подразделения аудируемого лица работают в единой системе КОД, применяют единое программное обеспечение

На основании какого нормативного правового акта осуществляется государственный контроль в Республике Беларусь?:
Указ Президента РБ «О совершенствовании контрольной (надзорной) деятельности»

Основной принцип осуществления контрольной деятельности – это…:
презумпция добросовестности и невиновности проверяемого субъекта

За совершение административных правонарушений в отношении физических лиц применяются следующие виды административных взысканий…:
все ответы верны

О назначении выборочной проверки проверяемый субъект должен быть письменно уведомлен не позднее чем за…:
10 дней

Формами финансового контроля НЕ являются…:
инвентаризация

Контроль в сфере качества работ относится к…:
производственно-техническому контролю

Наделение полномочиями проверяющего решается на этапе…:
проведения проверки

Функция аудита, заключающаяся в предупреждении возможных отклонений и злоупотреблений, – это…:
превентивная функция

В рабочем плане проверок осуществляется…:
систематизация полученной в ходе контрольных действий информации

Аудиторская проверка может быть…:
обязательной и инициативной

В чём заключается аудиторская процедура «инспектирование материальных активов»?
в проверке физического наличия материальных активов

Сколько лет аудитор должен оказывать аудиторские услуги в качестве работника аудиторской организации, чтобы иметь право осуществлять аудиторскую деятельность в качестве аудитора-индивидуального предпринимателя?
не менее 2 лет

Организационные вопросы проверки решаются на этапе…:
подготовки

По результатам проверки государственных контролирующих органов составляется…:
акт (справка) проверки

Если аудиторская организация выявляет существенные, но не всеобъемлющие искажения, при этом отчетность существенно искажена, то аудитор должен…:
выразить аудиторское мнение с оговоркой

По результатам проверки, в ходе которой выявлены нарушения составляется…:
акт проверки

Какие виды услуг относятся к иным аудиторским или профессиональным услугам аудиторов?
все ответы верны

Обязательный аудит годовой бухгалтерской (финансовой) отчетности должен быть проведен не позднее…:
30 июня года, следующего за отчетным

Внутренний контроль является элементом…:
оперативного управления

В чём заключается аудиторская процедура «наблюдение»?
в изучении процессов или процедур, выполняемых другими лицами

Ежегодно НЕ проводится обязательный аудит годовой индивидуальной и консолидированной бухгалтерской отчетности…:
крестьянских (фермерских) хозяйств

Обязательный аудит достоверности бухгалтерской (финансовой) отчётности проводится…?
банков, банковских групп, банковских холдингов

Документ, содержащий сроки оказания аудиторских услуг, права, обязанности и стоимость – это…:
договор оказания аудиторских услуг

В зависимости от повторяемости контрольных функций различают проверки…:
первичные, повторные и дополнительные

К основным этапам проведения аудита не относится:
разработка мероприятий по устранению недостатков и контроль за исполнением решений

После отмены дисциплинарного взыскания в судебном порядке…:
наниматель имеет право назначить более мягкое дисциплинарное взыскание

В группировочных таблицах осуществляется…:
систематизация полученной в ходе контрольных действий информации

Проверка соблюдения налогового законодательства проводится за период…:
не более пяти лет

В акте (справке) по результатам проверки осуществляется…:
выводы и предложения по контрольным действиям

Какими факторами может быть обусловлено проведение инициативного аудита по решению собственника?
все ответы верны

Отдельное контрольное действие – это…:
прием

Государственный контроль (надзор) осуществляется в формах…:
все ответы верны

Документ, содержащий основные решения по объему и временным рамкам аудита – это…:
общая стратегия аудита

К каким аудиторским процедурам относится «Сопоставление показателей со среднеотраслевыми данными»?
аналитическим аудиторским процедурам

Проведение инвентаризации является обязательным…:
перед составлением годовой отчетности

Что такое инициативный аудит?
аудит, проводимый по инициативе собственника организации

Работник может быть привлечён к материальной ответственности при наличии…:
все ответы верны

Документ, содержащий описание характера, сроков и объема запланированных процедур – это…:
план аудита

Акт проверки составляется…:
если в ходе проверки выявлены нарушения

Если аудит выявляет множество факторов неопределенности, существенно влияющих на отчетность:
отказаться от выражения аудиторского мнения

Имеют ли право аудиторы получать сведения о деятельности аудируемого лица по запросу в госорганы?
имеют только в объёме, необходимом для выполнения договора оказания аудиторских услуг

Проверка экономической целесообразности совершённых операций – это…:
экономическая проверка

По содержанию и объему программы контроля проверки подразделяются на…:
комплексные, сквозные, некомплексные и тематические

Обязательным требованием к лицу, претендующему на аттестат аудитора, не является:
членство аудитора в Аудиторской палате

Обязана ли аудиторская организация подготовить письменный отчет и передать его заказчику?
обязана

Контроль является:
завершающим этапом управленческой деятельности

Обязанность доказать факт причинения вреда лежит на…:
нанимателе

Какой принцип аудита заключается в критической оценке доказательств?
принцип профессионального скептицизма

За совершение административных правонарушений в отношении юрлиц НЕ применяются…:
общественные работы

Имеет ли право аудиторская организация отказаться от выполнения договора?
имеет во всех вышеуказанных случаях

Дисциплинарное взыскание применяется не позднее…:
одного месяца со дня обнаружения дисциплинарного проступка

Какой теории в истории развития аудита не существует?
теория «собаки-спасателя»

Общие вопросы организации аудиторской деятельности регулирует…:
Закон Республики Беларусь «Об аудиторской деятельности»

Для получения квалификационного аттестата аудитору необходимо образование…:
высшее экономическое и (или) юридическое

Меры дисциплинарной ответственности…:
все ответы верны

Непосредственное изучение определенных объектов учета в хозяйственной системе – это…:
осмотр

Если искажения существенны, но их влияние не является распространенным:
выразить аудиторское мнение с оговоркой

Указом Президента № 376 отменен…:
ведомственный контроль

Определенный порядок и последовательность действий проверяющего – это…:
процедура

В чём заключается аудиторская процедура «запрос»?
в оценке финансовой и нефинансовой информации у осведомлённых лиц

Какая из функций НЕ является функцией контроля?:
надзорная

Имеют ли право аудиторские организации самостоятельно определять формы и методы услуг?
имеют

Обязаны ли аудиторы обеспечивать сохранность документов?
обязаны, в течение не менее 5 лет с даты завершения оказания аудиторских услуг

В зависимости от места проведения проверки различают…:
камеральные, выездные и рейдовые

Право выбора меры дисциплинарного взыскания принадлежит…:
нанимателю

В зависимости от того, какой орган осуществляет проверку, они бывают…:
внутренние и внешние

Система контроля состоит из следующих подсистем…:
контролирующей и контролируемой

Какой формы аудиторского мнения НЕ существует?
плохое аудиторское мнение

Какая из функций НЕ является функцией контроля?:
надзорная

В уведомлении о проведении проверки определяется…:
субъект контроля

Срок проведения выборочной проверки юридического лица составляет…:
не более 30 рабочих дней

За совершение административных правонарушений в отношении физических лиц применяются следующие виды административных взысканий…:
все ответы верны

После отмены дисциплинарного взыскания в судебном порядке…:
наниматель имеет право назначить более мягкое дисциплинарное взыскание

Сопоставление хозяйственных операций с различными взаимосвязанными показателями и событиями – это…:
логическая проверка

То, в отношении чего проводятся контрольные действия и какие задачи стоят перед проверяющими…:
объект проверки

К контрольным действиям относятся…:
приемы, способы и процедуры

Проверка проверяемого субъекта проводится за период…:
не более трех лет

На основании какого нормативного правового акта осуществляется государственный контроль в Республике Беларусь?:
Указ Президента РБ «О совершенствовании контрольной (надзорной) деятельности»

По объему охватываемых проверкой хозяйственных операций проверки делятся на …:
сплошные, выборочные и комбинированные

Национальные правила аудиторской деятельности…:
являются обязательными для исполнения аудиторскими организациями и аудиторами-индивидуальными предпринимателями

Система контроля НЕ включает следующие взаимосвязанные элементы …:
мониторинг

Функция аудита для прогнозирования и предоставления рекомендаций субъекту хозяйствования – это…:
прогнозная функция

Контроль в сфере качества работ относится к…:
производственно-техническому контролю

Какие органы в Республике Беларусь вправе осуществлять общественный контроль?:
профессиональные союзы и их органы

Отдельное контрольное действие – это…:
прием

В зависимости от времени проведения различают контроль:
текущий, предварительный, последующий

Для получения квалификационного аттестата аудитору необходим…:
стаж работы по экономической или юридической специальности не менее 3 лет

Обязана ли аудиторская организация подготовить письменный отчет и передать его заказчику?
обязана

Обязаны ли аудиторы вести учёт заключённых договоров оказания аудиторских услуг?
обязаны

В связи с чем при использовании КОД возможно повышение уровня риска искажения информации?
все ответы верны

Если искажения бухгалтерской отчетности существенны и их влияние является распространенным:
выразить отрицательное мнение о достоверности отчетности

В зависимости от назначения проверки могут быть…:
плановые и внеплановые

Основной принцип осуществления контрольной деятельности – это…:
презумпция добросовестности и невиновности проверяемого субъекта

Аудиторская деятельность – это…:
предпринимательская деятельность по независимой проверке бухгалтерской отчетности в целях выражения мнения о ее достоверности

В акте (справке) по результатам проверки осуществляется…:
выводы и предложения по контрольным действиям

Какова основная цель аудиторской проверки?
установить достоверность бухгалтерской отчетности

Способ контроля — искусственное создание ситуации по приобретению товарно-материальных ценностей:
контрольная закупка

В чек-листе проверки определяется…:
выбор контрольных процедур

Проверка соблюдения действующих форм документов и правильности заполнения их реквизитов – это…:
формальная проверка

Обязательный аудит годовой отчетности, составляемой в соответствии с МСФО, проводится…:
только аудиторскими организациями

Как называется аудит, который проводят работники организации в интересах собственника?
внутренний аудит

Условия, виды и порядок материальной ответственности регулирует…:
трудовой кодекс

Обязательным требованием к физическому лицу, претендующему на аттестат аудитора, не является:
членство аудитора в Аудиторской палате

В зависимости от источника проверки контроль делится на…:
документальный и фактический

Основная цель контроля – это…:
выявление нарушений и наказание виновных

К приемам фактического контроля относятся…:
инвентаризация

Проверка проводится на основании…:
предписания руководителя контролирующего органа

Система контроля состоит из следующих подсистем…:
контролирующей и контролируемой

Является ли обязательным требованием наличие безупречной деловой (профессиональной) репутации:
да

Аудитор обязан подтверждать свою квалификацию…:
не реже одного раза в 2 года

При невозможности обеспечить присутствие материально ответственного лица при проверке:
вправе провести такие действия без участия указанного лица участием не менее двух понятых

Чек-лист составляется на этапе…:
выбора контрольных процедур

Выборочные проверки проводятся…:
с учетом критериев оценки степени риска

Официальный документ, содержащий выраженное аудиторское мнение – это…:
аудиторское заключение

Какое количество аудиторов должно быть в штате аудиторской организации (основное место работы)?
не менее 3 аудиторов

Систематизированный перечень аудиторов и аудиторских организаций — это…:
реестр аудиторов

Если искажения существенны, но их влияние на отчетность не является распространенным:
выразить аудиторское мнение с оговоркой

К основным этапам проведения аудита не относится:
разработка мероприятий по устранению недостатков и контроль за исполнением решений

Чек-лист составляется на этапе…:
выбора контрольных процедур

Для проверки размера необоснованного списания сырья на производство при выпуске определённого вида готовой продукции используется…:
обратная калькуляция

Работник может быть привлечён к материальной ответственности при наличии…:
все ответы верны

Непосредственное изучение определенных объектов учета, выполняющих в хозяйственной системе те или иные конкретные функции называется…:
осмотр

Какие органы в Республике Беларусь вправе осуществлять общественный контроль?:
профессиональные союзы и их органы

Проверка проводится на основании…:
предписания руководителя контролирующего органа

Какова основная цель аудиторской проверки?
установить достость бухгалтерской отчетности

В чём заключается аудиторская процедура «инспектирование материальных активов»?
в проверке физического наличия материальных активов

В рабочем плане проверок осуществляется…:
систематизация полученной в ходе контрольных действий информации

Формами финансового контроля НЕ являются…:
инвентаризация

Имеют ли право аудиторские организации самостоятельно определять формы и методы оказания аудиторских услуг?
имеют

В акте (справке) по результатам проверки осуществляется…:
выводы и предложения по контрольным действиям

Что такое инициативный аудит?
аудит, проводимый по инициативе собственника организации

Основной принцип осуществления контрольной деятельности – это…:
презумпция добросовестности и невиновности проверяемого субъекта

По содержанию и объему программы контроля проверки подразделяются на…:
комплексные, сквозные, некомплексные и тематические

Основная цель контроля – это…:
выявление нарушений и наказание виновных

Риск существенного искажения бухгалтерской (финансовой) отчетности в условиях компьютерной обработкой данных (КОД) повышается в том случае, если?
компьютеризованная среда децентрализована

К каким аудиторским процедурам относится «Сопоставление показателей бухгалтерской (финансовой) отчетности со среднеотраслевыми данными»?
аналитическим аудиторским процедурам

Если выявленные искажения бухгалтерской отчетности намного меньше рассчитанного уровня существенности, то аудитор должен…:
выразить немодифицированное аудиторское мнение о достости отчетности

Проведение инвентаризации является обязательным…:
перед составлением годовой отчетности

Общие вопросы организации аудиторской деятельности регулирует…:
Закон Республики Беларусь «Об аудиторской деятельности»

В зависимости от источника проверки контроль делится на…:
документальный и фактический

Какой принцип аудита заключается в обязательности отсутствия у аудитора финансовой, имущественной или иной заинтересованности в деятельности аудируемого лица, а также какой-либо зависимости от третьих лиц, которая может повлиять на объективность аудиторского мнения?
принцип независимости

Национальные правила аудиторской деятельности…:
являются обязательными для исполнения аудиторскими организациями и аудиторами-индивидуальными предпринимателями

В зависимости от времени проведения различают контроль:
текущий, предварительный, последующий

Аудитор обязан подтверждать свою квалификацию…:
не реже одного раза в 2 года

В ходе подписания договора аудитор …:
все ответы верны

Право выбора меры дисциплинарного взыскания принадлежит…:
нанимателю

Аудиторская деятельность – это…:
предпринимательская деятельность по независимой проверке бухгалтерской отчетности в целях выражения мнения о ее достости

В зависимости от назначения проверки могут быть…:
плановые и внеплановые

Проверка проверяемого субъекта проводится за период…:
не более трех лет

К контрольным действиям относятся…:
приемы, способы и процедуры

Срок проведения выборочной проверки юридического лица составляет…:
не более 30 рабочих дней

Фактический контроль – это…:
проверка фактического наличия и использования средств

Сопоставление хозяйственных операций, отражённых в документе, с различными взаимосвязанными показателями и событиями – это…:
логическая проверка

За совершение административных правонарушений в отношении юридических лиц НЕ применяются следующие виды административных взысканий…:
общественные работы

Функция аудита, заключающаяся в использовании аудитором выполненных аудиторских процедур и полученных аудиторских доказательств для прогнозирования и предоставления рекомендаций субъекту хозяйствования, – это…:
прогнозная функция

Какие виды услуг не относятся к иным аудиторским или профессиональным услугам аудиторов?
услуги по микрокредитованию и страхованию

Документ, содержащий сроки оказания аудиторских услуг, права и обязанности сторон, стоимость аудиторских услуг, сроки и порядок их оплаты, ответственность сторон, порядок разрешения споров, порядок соблюдения конфиденциальности – это…:
договор оказания аудиторских услуг

При невозможности обеспечить присутствие материально ответственного лица при проверке вверенных ему ценностей проверяющий…:
вправе провести такие действия без участия указанного лица участием не менее двух понятых

Контроль является:
завершающим этапом управленческой деятельности

Является ли обязательным требованием к физическому лицу, претендующему на получение квалификационного аттестата аудитора, наличие безупречной деловой (профессиональной) репутации:
да

Ежегодно НЕ проводится обязательный аудит годовой индивидуальной и консолидированной (в случае ее составления) бухгалтерской отчетности, составленной в соответствии с законодательством Республики Беларусь…:
крестьянских (фермерских) хозяйств

Акт проверки составляется…:
если в ходе проверки выявлены нарушения

Проверка экономической целесообразности совершённых операций, влияния полученных результатов от этих операций на финансовые результаты – это…:
экономическая проверка

Обязанность доказать факт причинения вреда лежит на…:
нанимателе

В группировочных таблицах осуществляется…:
систематизация полученной в ходе контрольных действий информации

Контроль в сфере качества работ относится к…:
производственно-техническому контролю

Обязательным требованием к физическому лицу, претендующему на получение квалификационного аттестата аудитора, не является:
членство аудитора в Аудиторской палате

После отмены дисциплинарного взыскания в судебном порядке…:
наниматель имеет право назначить более мягкое дисциплинарное взыскание

Что такое обязательный аудит?
аудит, обязательность проведения которого установлена законодательными актами

В чек листе проверки определяется…:
выбор контрольных процедур

Меры дисциплинарной ответственности…:
все ответы верны

О назначении выборочной проверки проверяемый субъект должен быть письменно уведомлен не позднее чем за…:
10 дней

Документ, составляемый аудиторской организацией и содержащий описание характера, сроков и объема запланированных аудиторских процедур, необходимых для получения достаточных и надлежащих аудиторских доказательств достоверности проверяемой информации, а также для снижения аудиторского риска до приемлемого уровня – это…:
план аудита

Сколько лет аудитор должен оказывать аудиторские услуги в качестве работника аудиторской организации, чтобы иметь право осуществлять аудиторскую деятельность в качестве аудитора-индивидуального предпринимателя?
не менее 2 лет

Проверка соблюдения действующих форм документов, полноты и правильности заполнения их реквизитов – это…:
формальная проверка

Риск существенного искажения бухгалтерской (финансовой) отчетности в условиях компьютерной обработкой данных (КОД) снижается в том случае, если?
все структурные подразделения аудируемого лица работают в единой системе КОД, применяют единое программное обеспечение

Выборочные проверки проводятся…:
с учетом критериев оценки степени риска

Обязательный аудит достоверности бухгалтерской (финансовой) отчётности проводится…?
акционерных обществ

Документальный контроль – это…:
проверка различных документов

Обязаны ли аудиторы вести учёт заключённых договоров оказания аудиторских услуг?
обязаны

Обязана ли аудиторская организация по результатам аудита подготовить письменный отчет о результатах проведенной проверки, приложить его к аудиторскому заключению и передать заказчику аудита?
обязана

Определенный порядок и последовательность действий проверяющего для получения доказательств на конкретном участке контроля называется…:
процедура

В связи с чем при использовании аудируемым лицом системы компьютерной обработки данных (КОД) возможно повышение уровня риска искажения информации, имеющей отношение к бухгалтерскому учету?
все ответы верны

В зависимости от места проведения проверки различают…:
камеральные, выездные и рейдовые

Указом Президента № 376 «О мерах по совершенствованию контрольной (надзорной) деятельности» отменен…:
ведомственный контроль

Какой формы аудиторского мнения НЕ существует?
плохое аудиторское мнение

Систематизированный перечень аудиторов, аудиторов-индивидуальных предпринимателей, аудиторских организаций и сведений о них  это …:
реестр аудиторов

В информационной базе данных контролирующих (надзорных) органов осуществляется…:
контроль выполнения решений, принятых по результатам проверки

Способ контроля, выраженный в искусственном создании должностными лицами контролирующих (надзорных) органов ситуации по приобретению товарно-материальных ценностей…:
контрольная закупка

Если аудиторская организация выявляет существенные, но не всеобъемлющие искажения, при этом отчетность существенно искажена, то аудитор должен…:
выразить аудиторское мнение с оговоркой

В чём заключается аудиторская процедура «запрос»?
в оценке финансовой и нефинансовой информации у осведомлённых лиц в пределах или за пределами аудируемого лица

Имеют ли право аудиторские организации привлекать на договорной основе в качестве экспертов лиц, не состоящих в штате аудиторской организации и обладающих специальными знаниями в области компьютерной обработки данных (КОД)?
имеют в соответствии с законодательством Республики Беларусь

Аудиторские доказательства – это…:
информация, полученная аудитором при проведении аудита и используемая при формировании выводов

В акте (справке) по результатам проверки осуществляется…:
выводы и предложения по контрольным действиям

Условия, виды и порядок материальной ответственности регулирует…:
трудовой кодекс

Организационные вопросы проверки решаются на этапе…:
подготовки

Система контроля состоит из следующих подсистем…:
контролирующей и контролируемой

За совершение административных правонарушений в отношении физических лиц применяются следующие виды административных взысканий…:
все ответы верны

Какая из функций НЕ является функцией контроля?:
надзорная

На основании какого нормативного правового акта осуществляется государственный контроль в Республике Беларусь?:
Указ Президента РБ «О совершенствовании контрольной (надзорной) деятельности»

Если получив достаточные и надлежащие аудиторские доказательства аудитор приходит к выводу, что искажения являются существенными, но их влияние на отчетность не является распространенным, то аудитор должен…:
выразить аудиторское мнение с оговоркой

Проверка соблюдения налогового законодательства проводится за период…:
не более пяти лет

Документ, содержащий основные решения аудиторской организации по предполагаемому объему аудита, временным рамкам его проведения и основным направлениям работы – это…:
общая стратегия аудита

Аудиторская проверка может быть…:
обязательной и инициативной

Система контроля НЕ включает следующие взаимосвязанные элементы …:
мониторинг

Под уровнем существенности понимается…:
предельное значение ошибки

То, в отношении чего проводятся контрольные действия и какие задачи стоят перед проверяющими…:
объект проверки

К приемам фактического контроля относятся…:
инвентаризация

Продолжение осмотра, но с одновременным ознакомлением с документами как нормативными, так и оправдательными, с получением объяснения от ответственных лиц называется…:
обследование

Дисциплинарное взыскание применяется не позднее…:
одного месяца со дня обнаружения дисциплинарного проступка

Акт (справка) проверки составляется в количестве…:
двух и более экземпляров

Внутренний контроль является элементом…:
оперативного управления

Если аудиторская организация выявляет наличие множества факторов неопределенности, которые потенциально воздействуют друг на друга и их возможное совокупное влияние на отчетность существенно, то аудитор должен…:
отказаться от выражения аудиторского мнения

Для получения квалификационного аттестата аудитору необходимо наличие образования…:
высшего экономического и (или) юридического

Официальный документ, предназначенный для пользователей бухгалтерской (финансовой) отчетности, составленный по результатам аудита и содержащий выраженное в установленной форме аудиторское мнение – это…:
аудиторское заключение

Наделение полномочиями проверяющего решается на этапе…:
проведения проверки

По результатам проверки государственных контролирующих органов составляется…:
акт (справка) проверки

Если выявленные искажения бухгалтерской отчетности существенны и их влияние на отчетность является распространенным, то аудитор должен…:
выразить отрицательное мнение о достоверности отчетности

Что является объектом аудита?
информация, содержащаяся в бухгалтерской (финансовой) отчетности

В зависимости от объема охватываемых вопросов деятельности проверки подразделяются на…:
полные и частичные

Какое количество аудиторов должно быть в штате аудиторской организации, обязанных участвовать в осуществлении аудиторской деятельности и для которых эта организация является основным местом работы?
не менее 3 аудиторов

Если выявленные искажения бухгалтерской отчетности намного меньше рассчитанного уровня существенности, то аудитор должен…:
выразить немодифицированное аудиторское мнение о достоверности отчетности

Проверка проводится на основании…:
предписания руководителя контролирующего органа

Аудитор должен соответствовать следующим критериям:
физическое лицо, имеющее квалификационный аттестат аудитора и включенное в реестр аудиторов

При невозможности обеспечить присутствие материально ответственного лица при проверке вверенных ему ценностей проверяющий…:
вправе провести такие действия без участия указанного лица участием не менее двух понятых

Как называется аудит, который проводят работники организации в соответствии с требованиями ее внутрифирменных документов в интересах собственника?
внутренний аудит

Какой теории в истории развития аудита не существует?
теория «собаки-спасателя»

Какие виды услуг относятся к иным аудиторским или профессиональным услугам аудиторов?
все ответы верны

Документ, содержащий сроки оказания аудиторских услуг, права и обязанности сторон, стоимость аудиторских услуг, сроки и порядок их оплаты, ответственность сторон, порядок разрешения споров, порядок соблюдения конфиденциальности – это…:
договор оказания аудиторских услуг

Какой принцип аудита заключается в критической оценке аудиторских доказательств?
принцип профессионального скептицизма

Обязательный аудит годовой бухгалтерской (финансовой) отчетности должен быть проведен не позднее…:
30 июня года, следующего за отчетным

Внутренний контроль является элементом…:
оперативного управления

Какова основная цель аудиторской проверки?
установить достоверность бухгалтерской отчетности

Материалы проверки могут быть переданы в следственные органы на этапе…:
реализации материалов проверки

В чём заключается аудиторская процедура «наблюдение»?
в изучении процессов или процедур, выполняемых другими лицами

Меры дисциплинарной ответственности…:
замечание, выговор, увольнение

Система контроля состоит из следующих подсистем…:
контролирующей и контролируемой

Контроль в сфере качества работ относится к…:
производственно-техническому контролю

В зависимости от назначения проверки могут быть…:
плановые и внеплановые

Обязательный аудит достоверности бухгалтерской (финансовой) отчётности проводится…?
банков, банковских групп, банковских холдингов

Для получения квалификационного аттестата аудитору необходимо наличие образования…:
высшего экономического и (или) юридического

Какими факторами может быть обусловлено проведение инициативного аудита по решению собственника?
все ответы верны

Акт (справка) проверки составляется в количестве…:
двух и более экземпляров

Обязательный аудит достоверности бухгалтерской (финансовой) отчётности проводится…?
акционерных обществ

На основании какого нормативного правового акта осуществляется государственный контроль в Республике Беларусь?:
Указ Президента РБ «О совершенствовании контрольной (надзорной) деятельности»

В чём заключается аудиторская процедура «запрос»?
в оценке финансовой и нефинансовой информации у осведомлённых лиц в пределах или за пределами аудируемого лица

Условия, виды и порядок материальной ответственности регулирует…:
трудовой кодекс

В зависимости от повторяемости контрольных функций различают проверки…:
первичные, повторные и дополнительные

Если аудиторская организация выявляет наличие множества факторов неопределенности, которые потенциально воздействуют друг на друга и их возможное совокупное влияние на отчетность существенно, то аудитор должен…:
отказаться от выражения аудиторского мнения

Проверка соблюдения действующих форм документов, полноты и правильности заполнения их реквизитов – это…:
формальная проверка

Документ, содержащий основные решения аудиторской организации по предполагаемому объему аудита, временным рамкам его проведения и основным направлениям работы – это…:
общая стратегия аудита

Отдельное контрольное действие – это…:
прием

Обязательный аудит годовой отчетности, составляемой в соответствии с МСФО, проводится…:
только аудиторскими организациями

По результатам проверки, в ходе которой выявлены нарушения составляется…:
акт проверки

Функция аудита, заключающаяся в предупреждении возможных отклонений и злоупотреблений, – это…:
превентивная функция

Проверка экономической целесообразности совершённых операций, влияния полученных результатов от этих операций на финансовые результаты – это…:
экономическая проверка

Какие виды предпринимательской деятельности аудиторам осуществлять запрещается?
розничная торговля

По объему охватываемых проверкой хозяйственных операций проверки делятся на …:
сплошные, выборочные и комбинированные

Для получения квалификационного аттестата аудитору необходим…:
стаж работы по экономической или юридической специальности не менее 3 лет

В уведомлении о проведении проверки определяется…:
субъект контроля

Обязаны ли аудиторы обеспечивать сохранность документов, составленных в ходе оказания аудиторских услуг,?
обязаны, в течение не менее 5 лет с даты завершения оказания аудиторских услуг

В зависимости от того, какой орган осуществляет проверку, они бывают…:
внутренние и внешние

Государственный контроль (надзор) осуществляется в формах…:
все ответы верны

За совершение административных правонарушений в отношении юридических лиц НЕ применяются следующие виды административных взысканий…:
общественные работы

Имеет ли право аудиторская организация отказаться от выполнения договора оказания аудиторских услуг?
имеет во всех вышеуказанных случаях

Фактический контроль – это…:
проверка фактического наличия и использования средств

Имеют ли право аудиторы получать в соответствии с законодательством по письменному запросу в республиканские органы государственного управления и в других организациях сведения о деятельности аудируемого лица?
имеют только в объёме, необходимом для выполнения договора оказания аудиторских услуг
`;

const qnas = rawQnas
    .split('\n\n')
    .slice(1)
    .map(rawQna => {
        const question = rawQna.split('\n')[0].trim().toLowerCase();
        const answer = rawQna.split('\n')[1].trim().toLowerCase();
        return { question, answer }; 
    });

console.log(qnas);

const questionElements = Array.from(document.querySelector('#region-main > [role="main"] > form > div').childNodes).filter(testElement => testElement.id.includes('question-'));
for (const questionElement of questionElements)
{
    const questionText = questionElement.querySelector('.qtext').innerText.trim().toLowerCase();

    const answerText = qnas.find(qna => questionText.includes(qna.question))?.answer;
    if (answerText === undefined)
    {
        console.log(`Неизвестный вопрос "${questionText}".`);
        continue;
    }

    const answerOptions = Array.from(questionElement.querySelectorAll('.answer > div'));

    const exactMatchAnswerOption = answerOptions.find(answerOption => {
        const answerLabel = answerOption.querySelector('label').innerText.trim().toLowerCase();
        return answerLabel === answerText;
    });
    if (exactMatchAnswerOption !== undefined) {
        exactMatchAnswerOption.querySelector('label').innerText += '.';
        continue;
    }

    const partialMatchAnswerOptions = answerOptions.filter(answerOption => {
        const answerLabel = answerOption.querySelector('label').innerText.trim().toLowerCase();
        return answerLabel.includes(answerText);
    });

    if (partialMatchAnswerOptions.length === 1) {
        const singlePartialMatchAnswerOption = partialMatchAnswerOptions[0];
        singlePartialMatchAnswerOption.querySelector('label').innerText += '.';
        continue;
    }

    console.log(`Нет подходящего варианта ответа для вопроса "${questionText}".`);
    questionElement.querySelector('.qtext').style.marginBottom = 0;
    questionElement.querySelector('.ablock').style.marginTop = 0;
    const answerElement = document.createElement('div');
    answerElement.style.opacity = 0;
    answerElement.innerText = answerText;
    answerElement.addEventListener('click', function() {
        answerElement.style.opacity = 1 - answerElement.style.opacity;
    });
    questionElement.querySelector('.qtext').insertAdjacentElement('afterend', answerElement);
}
