const rawQnas = `

Коммерческая организация, созданная одним гражданином (членами одной семьи), внесшим (внесшими) имущественные вклады, для осуществления предпринимательской деятельности по производству сельскохозяйственной продукции, а также по ее переработке, хранению, транспортировке и реализации, основанной на его (их) личном трудовом участии и использовании земельного участка, предоставленного для этих целей в соответствии с законодательством об охране и использовании земель – это
крестьянское (фермерское) хозяйство

Что из перечисленного НЕ является движимым имуществом
организация в целом как имущественный комплекс 

Что из перечисленного НЕ является на данный момент в Республике Беларусь фактором, препятствующим максимально активному привлечению субъектами малого бизнеса банковских кредитов
законодательный запрет на предоставление кредитов субъектам малого бизнеса 

Какой показатель прибыли рассчитывается по формуле «Выручка минус Полная себестоимость реализованной продукции»
валовая прибыль

ИП в Беларуси может нанимать для реализации предпринимательской деятельности одновременно
не более 3 человек

Реализуя свой бизнес-план, предприниматель обязан руководствоваться тем, что его предпринимательская деятельность должна соответствовать требованиям нормативных правовых актов. Как называется этот принцип предпринимательской деятельности
принцип законности

Оборотные средства – это объекты, которые используются в деятельности организации
менее 12 месяцев

Что из перечисленного НЕ относится к оборотным производственным фондам организации
дебиторская задолженность

Кредитный скоринг – это специальная система (метод), который используется банком для
оценки кредитоспособности потенциального заемщика

Расходы по текущей деятельности организации НЕ включают
расходы, связанные с участием в уставных фондах других организаций

Основные средства – это объекты, которые используются в деятельности организации
более 12 месяцев

Среди следующих утверждений выберите ложное
государственная регистрация не является обязательным требованием для ведения легальной предпринимательской деятельности индивидуального предпринимателя

Субсидия безработным, предоставляемая из средств ФСЗН в Республике Беларусь, на цели начала деятельности в качестве индивидуального предпринимателя выдается
до момента открытия (регистрации) ИП

Годовую отчетность должны составлять
все организации

Что из перечисленного является движимым имуществом
акции и облигации

Что из перечисленного относится к оборотным производственным фондам организации
сырье для производства

Собственность, находящаяся во владении и распоряжении органов государственной власти и самоуправления – это
государственная собственность

Что из перечисленного НЕ относится к заемным источникам финансирования деятельности субъекта малого или среднего бизнеса
амортизационные отчисления

Оборотные средства необходимы для (выбрать самый точный ответ)
обеспечения непрерывности производственного цикла

Какой из следующих методов государственного регулирования предпринимательской деятельности относится к экономическим методам
установление льгот по налогам и сборам

Банковский кредит – это
денежные средства, предоставленные банком кредитополучателю в размере и на условиях, предусмотренных договором

Финансовый результат деятельности организации может быть представлен
прибылью или убытком

Что из перечисленного НЕ относится к фондам обращения
продукция, не прошедшая все стадии производственного цикла

Соглашение сторон, при котором собственник передает за деньги право пользования недвижимостью (имуществом) на определенный срок – это
аренда

Доходы по текущей деятельности организации формируются за счет
выручки от реализации продукции и прочих доходов по текущей деятельности

Среди следующих утверждений выберите ложное
лизинг оборудования в Республике Беларусь занимает одну из наименьших долей в структуре лизингового портфеля лизинговых компаний

На данный момент ИП в Республике Беларусь могут работать по одной из следующих систем налогообложения
общей системе и системе с уплатой единого налога

Индивидуальный предприниматель несет имущественную ответственность по своим обязательствам
всем принадлежащим ему имуществом, за исключением имущества, на которое в соответствии с законодательством не может быть обращено взыскание

Кто из перечисленных субъектов имеет право применять упрощенную систему налогообложения
организации с численностью работников до 50 человек, занимающиеся производством товаров, при соблюдении критерия размера полученной выручки

Как называется вид лизинга, при котором собственник оборудования продает его лизинговой компании, а затем вновь арендует это оборудование, превращаясь из собственника в лизингополучателя
возвратный

Как называется частное лицо, компания или группа связанных лиц, которые контролируют весь рынок конкретного товара или услуги
монополист

К децентрализованным фондам денежных средств НЕ относится
Фонд социальной защиты населения

Что из перечисленного относится к фондам обращения
выручка от реализации продукции

Какой принцип организации финансов субъектов малого и среднего бизнеса реализуется посредством финансирования видов деятельности за счет собственных источников финансирования организации
самофинансирования

Для осуществления какого вида деятельности необходимо зарегистрироваться в качестве ИП
медицинская, в частности, стоматологическая практика

Какие из перечисленных отношений НЕ являются финансовыми
отношения субъектов по поводу составления проекта Закона о республиканском бюджете

Основные средства организации необходимы для
формирования производственно-технической базы

Лицо, которое гарантирует кредитору возврат полученных заемщиком средств и выполнение других кредитных обязательств
поручитель

Убыток
отрицательная разница между доходами и расходами организации

Годовую отчетность должны составлять
все организации

Оборотные средства необходимы для
обеспечения непрерывности производственного цикла

Основным критерием, учитываемым Белорусским инновационным фондом при отборе проектов субъектов малого бизнеса для финансирования
инновационная направленность проекта

Что является налоговой базой налога при упрощенной системе налогообложения
денежное выражение валовой выручки

К основным принципам банковского кредитования относятся
платность, срочность, возвратность

Часть хозяйственного механизма, представляющая собой совокупность форм и методов управления финансами организации в целях достижения максимальной прибыли
финансовый механизм

Льготы финансового характера, предоставляемые государством организациям-экспортерам для расширения вывоза товаров за границу
экспортные субсидии

Соглашение (договор), посредством которого собственник имущества передает нанимателю имущество во владение и пользование или во временное пользование в течение оговоренного срока и за согласованную между сторонами плату
аренда

Какой из следующих методов государственного регулирования предпринимательской деятельности относится к экономическим методам
установление льгот по налогам и сборам

В чем из перечисленного НЕ выражается роль малого и среднего бизнеса
в развитии монополий

Что из перечисленного НЕ относится к заемным источникам финансирования деятельности субъекта малого или среднего бизнеса
амортизационные отчисления

Одна из форм собственности, которая предполагает абсолютное право физического или юридического лица, а также группы лиц на имущество
частная собственность

Письменное обязательство физического лица взять на себя ответственность за исполнение обязательств по кредитному договору, который заключается между банком и кредитополучателем, если это не сможет сделать последний
поручительство

Организационно-правовая форма коммерческой организации, при которой эта организация создается только одним учредителем
унитарное предприятие

Среди следующих утверждений выберите верное
ИП не обособляет имущество, используемое для целей предпринимательской деятельности, от иного имущества, принадлежащего ему на праве собственности

Документ, подтверждающий постановку на учет в налоговых органах, органах государственной статистики, органах Фонда социальной защиты населения Министерства труда и социальной защиты, регистрацию в Белорусском республиканском унитарном страховом предприятии «Белгосстрах» выдается индивидуальному предпринимателю
в течение 5 рабочих дней со дня регистрации

Гражданин Республики Беларусь вправе заниматься предпринимательской деятельностью без образования юридического лица с момента
государственной регистрации в качестве индивидуального предпринимателя

Что из перечисленного НЕ относится к особенностям предпринимательской деятельности
наличие возможности у индивидуальных предпринимателей заниматься предпринимательской деятельностью без государственной регистрации

Комплекс последовательных и предсказуемых трансформаций субъекта малого и среднего предпринимательства за время его функционирования
жизненный цикл

Собственность, находящаяся во владении и распоряжении органов государственной власти и самоуправления
государственная собственность

Как называется частное лицо, компания или группа связанных лиц, которые контролируют весь рынок конкретного товара или услуги
монополист

Суть традиционного подхода к оценке кредитоспособности субъектов малого и среднего бизнеса состоит в
анализе основных форм отчетности и финансовых показателей деятельности потенциального заемщика

За счет какого источника формируется основная часть денежных фондов страховых компаний
взносы страхователей

Основным документом, регламентирующим в комплексе все налоговые отношения в Республике Беларусь, является
Налоговый Кодекс Республики Беларусь

Сделка, регламентированная комплексом правовых и экономических соглашений, сутью которой является извлечение прибыли всеми ее участниками за счет использования свободных или привлеченных финансовых средств на приобретение объекта имущества одним юридическим лицом в собственность и передачей его другому субъекту хозяйствования во владение и пользование на определенный срок за определенную плату
лизинг

Какая из следующих форм отчетности относится к формам бухгалтерской отчетности
форма № 1 – Бухгалтерский баланс

Какой принцип организации финансов субъектов малого и среднего бизнеса реализуется посредством формирования фондов денежных средств на случай возникновения непредвиденных расходов
образования резервов

Кредитный скоринг – это специальная система (метод), который используется банком для
оценки кредитоспособности потенциального заемщика

Среди следующих утверждений выберите ложное
при регистрации ИП необходимо согласовать его наименование и подготовить устав

Годовую отчетность должны составлять
все организации

Какой из следующих видов деятельности НЕ требует получения лицензии
адвокатская деятельность

ОАО «Банк развития Республики Беларусь» предоставляет средства субъектам малого бизнеса
через ФСЗН

Как называется вид бизнеса, при котором предприниматель способствует установлению взаимосвязи между производителем и потребителем продукции
посреднический бизнес

Среди следующих утверждений выберите верное
имущество ИП не делится на личное и коммерческое

Для осуществления какого вида деятельности необходимо зарегистрироваться в качестве ИП
медицинская, в частности, стоматологическая практика

Как называется частное лицо, компания или группа связанных лиц, которые контролируют весь рынок конкретного товара или услуги
монополист

Какой из указанных источников финансирования субъектов малого и среднего бизнеса является собственным
амортизация

Что из перечисленного НЕ является движимым имуществом
организация в целом как имущественный комплекс

Могут ли областные и городские исполнительные комитеты в Республике Беларусь участвовать в процедуре получения субъектами малого предпринимательства льготных кредитов
да, они делают это совместно с банками, на счетах в которых размещены их финансовые ресурсы

Как называется вид лизинга, при котором расходы лизингодателя, связанные с приобретением и содержанием сдаваемых в аренду объектов, не покрываются арендными платежами в течение одного лизингового контракта
оперативный

Что из перечисленного НЕ относится к основным средствам организации
запасы сырья и материалов

Обязательный платеж в республиканский и (или) местные бюджеты, взимаемый с организаций и физических лиц, как правило, в виде одного из условий совершения в отношении их государственными органами юридически значимых действий, включая предоставление определенных прав или выдачу специальных разрешений (лицензий), либо в связи с перемещением товаров через таможенную границу – это
сбор (пошлина)

Что из перечисленного НЕ относится к оборотным средствам организации
вычислительная техника

Какой принцип организации финансов субъектов малого и среднего бизнеса реализуется посредством финансирования видов деятельности за счет собственных источников финансирования организации
самофинансирования

Какое из следующих утверждений является ложным
организация может перейти на упрощенную систему налогообложения не ранее, чем спустя 9 месяцев после регистрации

Какое из следующих направлений деятельности НЕ включает финансовая работа в организации
управление персоналом

Одна из форм собственности, которая предполагает абсолютное право физического или юридического лица, а также группы лиц на имущество – это
частная собственность

Что из перечисленного как правило НЕ должно являться возможной причиной нежелания банков предоставлять кредиты субъектам малого бизнеса
инновационность малого предпринимательства

Среди следующих утверждений выберите ложное
понятия «распределение прибыли» и «использование прибыли» являются тождественными

Как называется вид предпринимательской деятельности, который предполагает создание некого продукта, имеющего физическую форму
производственный бизнес

Расходы по финансовой деятельности НЕ включают
расходы, связанные с финансовыми вложениями в облигации другой организации

При найме одним ИП другого ИП для оказания услуг оформляется
договор на оказание услуг

Расходы по текущей деятельности организации НЕ включают
расходы по договорам о совместной деятельности

Что из перечисленного является движимым имуществом
акции и облигации

Предпринимательская деятельность, осуществляемая субъектом за счет собственных или заемных средств на свой риск и под свою ответственность, ставящая главными целями получение прибыли и развитие собственного дела – это
бизнес

В каком из следующих случаев ИП ДОПУСКАЕТСЯ НЕ ИМЕТЬ специальное помещение для ведения его деятельности
при использовании несложного оборудования для распечатки фотографий

Расходы по текущей деятельности организации НЕ включают
расходы, связанные с участием в уставных фондах других организаций

Собственность, находящаяся во владении и распоряжении органов государственной власти и самоуправления – это
государственная собственность

Что из перечисленного НЕ является на данный момент в Республике Беларусь фактором, препятствующим максимально активному привлечению субъектами малого бизнеса банковских кредитов
законодательный запрет на предоставление кредитов субъектам малого бизнеса
`;

const qnas = rawQnas
    .split('\n\n')
    .slice(1)
    .map(rawQna => {
        const question = rawQna.split('\n')[0].trim().toLowerCase();
        const answer = rawQna.split('\n')[1].trim().toLowerCase();
        return { question, answer }; 
    });

console.log(qnas);

const questionElements = Array.from(document.querySelector('#region-main > [role="main"] > form > div').childNodes).filter(testElement => testElement.id.includes('question-'));
for (const questionElement of questionElements)
{
    const questionText = questionElement.querySelector('.qtext').innerText.trim().toLowerCase();

    const answerText = qnas.find(qna => questionText.includes(qna.question))?.answer;
    if (answerText === undefined)
    {
        console.log(`Неизвестный вопрос "${questionText}".`);
        continue;
    }

    const answerOptions = Array.from(questionElement.querySelectorAll('.answer > div'));

    const exactMatchAnswerOption = answerOptions.find(answerOption => {
        const answerLabel = answerOption.querySelector('label').innerText.trim().toLowerCase();
        return answerLabel === answerText;
    });
    if (exactMatchAnswerOption !== undefined) {
        exactMatchAnswerOption.querySelector('label').innerText += '.';
        continue;
    }

    const partialMatchAnswerOptions = answerOptions.filter(answerOption => {
        const answerLabel = answerOption.querySelector('label').innerText.trim().toLowerCase();
        return answerLabel.includes(answerText);
    });

    if (partialMatchAnswerOptions.length === 1) {
        const singlePartialMatchAnswerOption = partialMatchAnswerOptions[0];
        singlePartialMatchAnswerOption.querySelector('label').innerText += '.';
        continue;
    }

    console.log(`Нет подходящего варианта ответа для вопроса "${questionText}".`);
    questionElement.querySelector('.qtext').style.marginBottom = 0;
    questionElement.querySelector('.ablock').style.marginTop = 0;
    const answerElement = document.createElement('div');
    answerElement.style.opacity = 0;
    answerElement.innerText = answerText;
    answerElement.addEventListener('click', function() {
        answerElement.style.opacity = 1 - answerElement.style.opacity;
    });
    questionElement.querySelector('.qtext').insertAdjacentElement('afterend', answerElement);
}
