const rawQnas = `
При цепном способе сравнения
каждый уровень ряда сравнивается с предыдущим

К показателям вариации относится
Дисперсия

Верно ли, что для того, чтобы изменение веса во времени не исказило изменение индексируемого признака, веса в числителе и знаменателе агрегатного индекса берутся на уровне одного и того же периода
Да

Как называются интервалы, в которых разность между максимальным и минимальным значениями в каждом из интервалов одинакова
Равные

Группировка, при которой группы, выделенные по одному признаку, подразделяются на подгруппы по другому признаку – это
сложная (комбинационная)

По полноте охвата единиц совокупности статистические наблюдения делят на
сплошное и несплошное наблюдение

Как называется метод выравнивания динамического ряда, при котором от исходного ряда динамики переходят к новому ряду с более крупными интервалами
метод укрупнения интервалов динамического ряда

При аналитическом выравнивании динамический ряд выражается в виде
функции от времени у = f(t)

Какая относительная величина рассчитывается путем соотношения одного и того же показателя за различные периоды времени
Динамикой

Распределение единиц статистической совокупности на однородные группы – это
Группировка

Теоретическая линия регрессии – это
линия, вокруг которой группируются точки корреляционного поля

Признак экономически связанный с индексируемым признаком таким образом, чтобы произведение индексируемого признака на него давало реально существующую экономическую величину, - это
вес (соизмеритель)

Темп прироста – это
отношение абсолютного прироста (цепного или базисного) к предыдущему или базисному уровню

Выберите обозначение численности генеральной совокупности, принятое в теории выборки
N

Какие виды связей существуют между признаками
функциональная и корреляционная

К какому классу средних величин относятся средняя арифметическая и средняя квадратическая
степенные

Закономерные внутригодичные изменения, то есть устойчиво повторяющиеся из года в год колебания уровней динамического ряда называются
сезонными колебаниями

Для качественных признаков веса в числителе и знаменателе агрегатного индекса берутся на уровне
отчетного периода

Частота вариационного ряда распределения
численность отдельной варианты (повторяемость значения признака)

Какой относительный показатель можно рассчитать, если известен валовой внутренний продукт и среднегодовая численность населения страны за отчетный год
Интенсивности

Заключительная стадия производственного процесса и начальная стадия его воспроизводства это
Потребление

В разделе «Ресурсы» счета использования валового располагаемого дохода отражается
валовой располагаемый доход

Что является балансирующей статьей счета образования доходов
Валовая прибыль и валовые смешанные доходы

К какому из перечисленных секторов экономики относятся государственные организации здравоохранения, образования, культуры, искусства, физической культуры и спорта
сектор государственного управления

Сумма амортизационных отчислений и недоамортизированной стоимости ликвидированных основных фондов
потребление основного капитала

Трансферты бывают следующих видов
текущие и капитальные

Отношение числа умерших к числу родившихся за период ‒ это
коэффициент депопуляции

Какой классификатор разработан в Республике Беларусь для изучения отраслевой структуры хозяйствующих субъектов
общегосударственный классификатор «Виды экономической деятельности» (ОКЭД)

К какому из перечисленных секторов относятся государственные, кооперативные, частные, акционерные, совместные и другие организации, производящие товары в целях реализации на рынке по ценам, возмещающим издержки производства
сектор нефинансовых корпораций

Что относится к текущим трансфертам
налоги на доходы и прибыль, взносы на государственное социальное страхование, пенсии, пособия

Индекс потребления материальных благ на душу населения рассчитывается путем деления индекса потребления материальных благ всем населением на
индекс среднегодовой численности населения

Что в СНС представляет собой сумма денег, которую покупатели готовы заплатить за приобретение товаров или услуг у конкретного продавца, согласного осуществить продажу за эту сумму
рыночная цена

Какая единица стоит в основе отраслевой классификаций хозяйствующих субъектов
Заведение

Какой показатель рассчитывается путем суммирования расходов на конечное потребление, валового накопления основного капитала, изменения запасов материальных оборотных средств и чистого экспорт товаров и услуг
Валовой внутренний продукт

С помощью какого показателя можно определить потенциал развития страны
национальное богатство

какому из перечисленных секторов экономики относится ГГУ имени Ф. Скорины
сектор государственного управления

Алгоритм расчета валового внутреннего продукта (ВВП) методом конечного использования
ВВП = Расходы на конечное потребление + Валовое накопление основных и оборотных средств + Чистый экспорт товаров и услуг

Что представляет собой миграционное (механическое) движение населения
выбытие и прибытие

Как называются налоги, которые взимаются пропорционально количеству или стоимости товаров и услуг, производимых, продаваемых или импортируемых предприятиями-резидентами
налоги на продукты и импорт

Лицо, проживающее на территории данной страны в течение года и более, – это
резидент физическое лицо

Что является балансирующей статьей в счете перераспределения доходов в натуральной форме
валовой скорректированный располагаемый доход

Как рассчитывается факторная стоимость
промежуточное потребление + оплата труда наемных работников + валовая прибыль

Объекты в СНС – это
товары, услуги, ценные бумаги, денежные средства, рабочая сила или другой любой носитель стоимости

Согласно счету СНС «Производство» алгоритм расчета ВВП производственным способом
ВВП = Валовой выпуск товаров и услуг в основных ценах – Промежуточное потребление + Чистые налоги на продукты и импорт

В ресурсной части какого счета СНС отражаются основные виды первичных доходов, получаемых резидентами, как от резидентов, так и от сектора остального мира
счет распределения первичных доходов

Медиана ряда распределения – это
варианта, стоящая в середине ряда распределения

Какая форма статистического наблюдения представляет собой систематическое наблюдение в установленные сроки учетно-статистической документации в виде отчетов, всесторонне характеризующих итоги работы предприятий и учреждений в течение отчетных периодов
Отчетностью

Оценить генеральный статистический показатель по результатам выборочного наблюдения ‒ это
указать пределы, в которых он находится в генеральной совокупности с заданным уровнем вероятности

При переписи населения единицей наблюдения является
человек и домашнее хозяйство

Укажите центры ряда распределения
средняя арифметическая, мода и медиана

Какая относительная величина рассчитывается путем отношения фактического уровня к плановому заданию одного и того же периода
выполнения плана

Если темп роста равен 125%, то темп прироста равен
25%

Какая относительная величина рассчитывается путем отношения планового задания к базисному уровню показателя
планового задания

Чем ближе эмпирическое корреляционное отношение к -1 или 1, тем
теснее связь между результативным и факторным признаками

Что является основной причиной несопоставимости уровней динамического ряда, построенного по стоимостным показателям
совокупности в целом

Какой характер статистического наблюдения означает наиболее полный охват всех единиц изучаемой совокупности
Массовый

Распределение работников предприятия по стажу работы характеризуется следующими данными:5 лет-4 чел.; 6 лет-16 чел.; 7 лет-15 чел.; 8 лет-6 чел. Определите моду стажа работы работников предприятия
6 лет

Какая относительная величина характеризует отношение частей совокупности к общему ее объему
величиной структуры

Соотношение фактического объема выпуска продукции, относящегося к разным предприятиям – это относительная величина
Сравнения

В линейном уравнении регрессии параметр a_1, показывает
на сколько единиц своего измерения увеличится результативный признак при увеличении факторного признака на 1 единицу своего измерения

Относительная величина сравнения характеризует отношение
одноименных абсолютных показателей, относящихся к различным совокупностям

Интервал, в котором указана только одна граница называется
Открытым

Единовременным называется наблюдение, при котором
факты регистрируются однократно, по мере надобности, без соблюдения периодичности.

Какие средние величины рассчитываются по несгруппированным данным
Простые

Важнейший вид несплошного статистического наблюдения, при котором изучается часть совокупности, отобранная в случайном порядке с целью последующей характеристики всей совокупности – это
выборочное наблюдение

Средний темп роста рассчитывают по формуле средней
Геометрической

Чему равна валовая прибыль экономики
чистая прибыль плюс потребление основного капитала.

К трудовым ресурсам относятся
лица младше и старше трудоспособного возраста, занятые в экономике

Какой показатель численности населения равняется численности постоянного населения плюс временно проживающие и минус временно отсутствующие
наличное население

Какие институциональные единицы предоставляют услуги, как правило, бесплатные или распределяют товары
некоммерческие организации

По производственно-технологическим признакам субъекты хозяйствования изучаются с помощью
Международной стандартной отраслевой классификации видов деятельности (МСОК)

В соответствии с методологией СНС к непроизведенным нефинансовым активам относятся
природные ресурсы, лицензии и приобретенный гудвилл (деловая репутация)

Разница между валовым внутренним продуктом и потреблением основного капитала, - это
чистый внутренний продукт

Разница между потенциальными и действующими трудовыми ресурсами ‒ это
абсолютная величина неиспользованных трудовых ресурсов (например, студенты дневного отделения)

Отношение числа родившихся к числу умерших ‒ это
коэффициент жизненности

К специальным методам социально-экономической статистики относится
система национальных счетов

Какой из перечисленных показателей является прямым показателем эффективности использования основных средств
Фондоотдача

Один из алгоритмов расчета ВВП производственным методом
ВВП = Валовая добавленная стоимость + Чистые налоги на продукты и импорт

Какая наука является теоретической основой социально-экономической статистики
экономическая теория

Экономический эффект всегда выражается
абсолютной величиной

Экономический эффект представляет собой
конечный результат хозяйственной или финансовой деятельности

Выберите из приведенных характеристик ту, что соответствует понятию «Институционная единица»
хозяйственная единица, которая обладает правом осуществления хозяйственной деятельности, самостоятельно распоряжается своими ресурсами, несет ответственность по своим обязательствам и ведет полный набор бухгалтерских счетов.

Объект, находящийся в индивидуальной или коллективной собственности институциональной единицы, в результате владения которым или использования которого собственник может извлекать экономическую выгоду, - это
экономический актив

Какой сектор используется при определении внутренней экономики по СНС
сектор домашних хозяйств

Что является компонентом валового накопления основного капитала
стоимость приобретения производителем основных средств (за вычетом их выбытия) в течение отчетного периода

Перемещение населения через границы страны и ее территориальных подразделений, связанное с переменой места жительства навсегда или на определенное время ‒ это
миграционное (механическое) движение.

Деятельность организаций, которая вносит наибольший вклад в валовую добавленную стоимость, ‒ это
Основная

Что является балансирующей статьей в счете вторичного распределения доходов
Валовой располагаемый доход

Валовая добавленная стоимость и ВВП оцениваются
как в текущих, так и в постоянных ценах

Обобщающим показателем, характеризующим уровень официальной зарегистрированной безработицы в Республике Беларусь, который рассчитывается как отношение численности безработных к численности экономически активного населения, является
коэффициент (уровень) безработицы

Укажите вариационный ряд распределения
распределение рабочих по заработной плате

Относительная величина, которая получается в результате сравнения непосредственно не поддающихся суммированию уровней социально-экономических явлений – это
общий индекс

Графически интервальный ряд распределения может быть представлен
гистограммой распределения

Признак экономически связанный с индексируемым признаком таким образом, чтобы произведение индексируемого признака на него давало реально существующую экономическую величину, - это
вес (соизмеритель)

По способу выражения признаки делятся на
количественные, атрибутивные, альтернативные

При переписи населения единицей наблюдения является
человек и домашнее хозяйство

По времени регистрации фактов различают наблюдение
периодическое, текущее, единовременное

С помощью межгрупповой дисперсии измеряют
колеблемость результативного признака под влиянием изучаемого факторного признака

Ошибками регистрации называются
ошибки, возникающие в результате неправильного установления фактов или неправильной их записи

Основной проблемой при построении ряда динамики является
сопоставимость уровней динамического ряда

Наиболее распространенная форма общего индекса – это
агрегатный индекс

Несплошное наблюдение предусматривает обследование
части единиц изучаемой совокупности

Трендом ряда динамики называется
основная тенденция

Коэффициент надежности (t-критерий) зависит
от уровня задаваемой вероятности, с которой необходимо гарантировать предельную ошибку выборки

К какому виду ряда динамики относится ряд «Численность населения на начало года за 2015-2021гг.»
Моментный

Частость вариационного ряда распределения – это
доля каждой группы в совокупности

Для определения абсолютного изменения стоимости за счет изменения цены необходимо
найти разность между числителем и знаменателем агрегатного индекса цены

Соотношение фактического объема выпуска продукции, относящегося к разным предприятиям – это относительная величина
сравнения

Для качественных признаков веса в числителе и знаменателе агрегатного индекса берутся на уровне
отчетного периода

По временному признаку ряды динамики бывают
интервальные и моментные

Как называется метод выравнивания динамического ряда, при котором от исходного ряда динамики переходят к новому ряду, состоящему из средних величин, рассчитанных по уровням исходного ряда
метод «скользящей» средней

Для расчета среднего уровня моментного ряда с равноудаленными датами используется
средняя хронологическая

Важнейший вид несплошного статистического наблюдения, при котором изучается часть совокупности, отобранная в случайном порядке с целью последующей характеристики всей совокупности – это
выборочное наблюдение

Как рассчитывается факторная стоимость
промежуточное потребление + оплата труда наемных работников + валовая прибыль

К какой категории населения относятся лица, находящиеся на момент переписи на данной территории, включая временно проживающих
наличное население

Использование доходов на уровне экономики в целом, ее секторов осуществляется на
валовое сбережение и расходы на конечное потребление

Какие лица относятся к категории нетрудоспособного населения в трудоспособном возрасте
лица в трудоспособном возрасте, имеющие I и II группу инвалидности

Показатель, характеризующий максимальную сумму средств, которыми располагает экономика, и которые могут быть использованы на конечное потребление товаров и услуг и сбережение в текущем периоде без изменения национального богатства страны, - это
Валовой располагаемый доход

Продукты или продукция в СНС – это
товары и услуги

Для чего предназначена система национальных счетов? СНС предназначена для
комплексного отображения и анализа состояния экономики страны

К какому из перечисленных секторов экономики относится ГГУ имени Ф. Скорины
сектор государственного управления

Лицо, проживающее на территории данной страны в течение года и более, – это
резидент физическое лицо

Отношение численности трудоспособного населения в трудоспособном возрасте к численности всего населения - это
коэффициент трудоспособности всего населения

Наиболее важный информационный источник данных о населении ‒ это
переписи населения

По форме функционирования экономические активы подразделяются на
финансовые и нефинансовые

Совокупность накопленных материальных благ и нематериальных активов, созданных трудом человека за время его существования, принадлежащих стране или её резидентам на экономической территории страны и за её пределами, а также разведанных и вовлечённых в экономический оборот природных и других ресурсов – это
национальное богатство

К задачам социально-экономической статистики относится
разработка научно-обоснованной статистической методологии расчета социально-экономических показателей

К какому из перечисленных секторов относятся государственные, кооперативные, частные, акционерные, совместные и другие организации, производящие товары в целях реализации на рынке по ценам, возмещающим издержки производства
сектор нефинансовых корпораций

Какой сектор экономики участвует в конечном потреблении товаров и услуг
сектор государственного управления

При какой инфляции происходит рост уровня цен в условиях свободных цен, не регулируемых государством
при открытой инфляции

Отношение числа родившихся к среднегодовой численности женщин репродуктивного (фертильного) возраста ‒ это
специальный коэффициент рождаемости

Какая цель присуща секторной классификации хозяйствующих субъектов
изучение движения потоков доходов и расходов

К какому из перечисленных секторов экономики относятся религиозные общества
сектор некоммерческих организаций, обслуживающих домашние хозяйства

Какие институциональные единицы предоставляют услуги, как правило, бесплатные или распределяют товары
некоммерческие организации

Как рассчитывается чистая прибыль экономики
Валовая прибыль экономики ‒ Потребление основного капитала

По какой формуле рассчитывается индекс потребительских цен в Республике Беларусь
по модифицированной формуле Ласпейреса

При какой инфляции цены постоянны, существует дефицит товаров и отложенный спрос
при скрытой инфляции

Одним из основных источников информации о доходах, расходах и сбережениях населения является
баланс денежных доходов и расходов населения

Для расчета среднего уровня интервального ряда с равными периодами времени используется
средняя арифметическая простая

Чему равна сумма линейных отклонений вариант от средней величины
0

Сущность статистического наблюдения заключается
в планомерном научно-организованном сборе данных о явлениях и процессах общественной жизни

В результате чего возникают систематические ошибки репрезентативности
когда нарушаются принципы отбора в выборочную совокупность

Статистический показатель, который характеризует относительное изменение признака либо у одной единицы совокупности, либо по совокупности в целом – это
индекс

Какая из средних величин относится к степенным средним
средняя гармоническая

Точечный график, который строится на основе индивидуальных значений факторных и результативных признаков, - это
поле корреляции

К количественному признаку относится
возраст сотрудника

Значение статистического показателя в рядах динамики называется
уровень ряда динамики

Верно ли, что для того, чтобы изменение веса во времени не исказило изменение индексируемого признака, веса в числителе и знаменателе агрегатного индекса берутся на уровне одного и того же периода
Да

Корреляционная связь верна для
совокупности в целом

Какой коэффициент показывает, на сколько процентов изменится результативный показатель, если факторный возрастет на 1%: коэффициент эластичности Темп прироста – это
отношение абсолютного прироста (цепного или базисного) к предыдущему или базисному уровню

Какие виды связей существуют между признаками
функциональная и корреляционная

Ряд динамики – это
ряд статистических показателей, расположенных в хронологической последовательности

Определение недостающих уровней динамического ряда внутри ряда – это
интерполяция

Предметом статистики является
количественная сторона массовых социально-экономических явлений

Темп роста – это
отношение уровней динамического ряда

Относительная величина сравнения характеризует отношение
одноименных абсолютных показателей, относящихся к различным совокупностям

Текущее наблюдение – это наблюдение
при котором регистрация фактов осуществляется постоянно по мере их возникновения

Абсолютное содержание 1% прироста – это
отношение абсолютного цепного прироста к цепному темпу прироста, выраженному в %

Руководящим органом в области статистики в Республике Беларусь является
Национальный статистический комитет

Какой из нижеприведенных видов доходов является вторичным (производным) доходом секторов экономики
пенсии, стипендии, пособия

Часть постоянного населения данного населенного пункта, которая на критический момент переписи находится в других населенных пунктах, но время ее отсутствия не должно превышать одного года
временно отсутствующее население

Валовое сбережение – это балансирующая статья счета
использования валового располагаемого дохода

Рыночное производство – это
производство товаров и услуг с целью получения прибыли

Экономический эффект всегда выражается
абсолютной величиной

Что относится к текущим трансфертам
налоги на доходы и прибыль, взносы на государственное социальное страхование, пенсии, пособия

Что является балансирующей статьей в счете перераспределения доходов в натуральной форме
Валовой скорректированный располагаемый доход

Алгоритм расчета ВВП распределительным методом
ВВП = Оплата труда наемных работников + Чистые налоги на производство и импорт + Валовая прибыль и валовые смешанные доходы

Что является балансирующей статьей счета распределения первичных доходов на уровне экономики
Валовой национальный доход

Институционная единица, имеющая центр экономических интересов на экономической территории страны, – это
резидент страны

К налогам на продукты и импорт относятся
налог на добавленную стоимость, акцизы, таможенные пошлины

По каким признакам производят изучение состава населения
все варианты ответа верны

Что необходимо вычесть из валового национального дохода, чтобы получить чистый национальный доход
потребление основного капитала

Как называются налоги, которые взимаются пропорционально количеству или стоимости товаров и услуг, производимых, продаваемых или импортируемых предприятиями-резидентами
налоги на продукты и импорт

Одним из обобщающих показателей уровня жизни населения является
индекс развития человеческого потенциала

Производственным методом ВВП рассчитывается
как сумма валовой добавленной стоимости

Часть национальной экономики, представляющая собой совокупность скрытой, неформальной и незаконной экономической деятельности, – это
ненаблюдаемая экономика

Один из алгоритмов расчета ВВП производственным способом
ВВП = Валовой выпуск товаров и услуг в ценах производителей – Промежуточное потребление

Объекты в СНС – это
товары, услуги, ценные бумаги, денежные средства, рабочая сила или другой любой носитель стоимости

Движение объектов экономической деятельности от одного субъекта к другому – это
экономическая операция

К какому из перечисленных секторов экономики относятся коммерческие банки
сектор финансовых корпораций

Чему равна валовая прибыль экономики
чистая прибыль плюс потребление основного капитала

К видам институциональных единиц относятся
корпорации, домашние хозяйства, органы государственного управления и некоммерческие организации

Способ основного массива, выборочное, анкетное и монографическое наблюдение относятся к видам
несплошного наблюдения

Вариационным рядом распределения называется ряд, построенный по
количественному признаку

К какому виду выборки относится исследование каждого десятого рабочего при изучении использования рабочего времени
механическая выборка

Частота вариационного ряда распределения – это
численность отдельной варианты (повторяемость значения признака)

Обобщающий показатель, характеризующий типический уровень варьирующего признака ‒ это
средняя величина

Объект статистического наблюдения представляет собой
совокупность явлений и процессов, подвергающихся наблюдению

В линейном уравнении регрессии параметр  , показывает
на сколько единиц своего измерения увеличится результативный признак при увеличении факторного признака на 1 единицу своего измерения

Какой из перечисленных показателей является относительной величиной структуры
удельный вес городского населения

Какие средние величины рассчитываются по несгруппированным данным
Простые

В качестве меры достоверности уравнения регрессии может рассчитываться
среднеквадратическая ошибка

Относительное изменение средней цены за счет изменения структуры продаж товаров показывает
индекс структурных сдвигов

Выберите из списка сплошное статистическое наблюдение
перепись населения

Для объемных признаков веса в числителе и знаменателе агрегатного индекса берутся на уровне
базисного периода

Если средний темп прироста равен 5%, то средний темп роста равен
105%

Теоретическая линия регрессии – это
линия, вокруг которой группируются точки корреляционного поля

Отбор, который организуется способом жеребьевки, определяют как
случайный отбор

Какими бывают способы отбора единиц совокупности в выборку
повторный и бесповторный

Единовременным называется наблюдение, при котором
факты регистрируются однократно, по мере надобности, без соблюдения периодичности

Одним из методов выявления корреляционной связи является
метод аналитических группировок

Число групп определяется по формуле n = 1+3,322 lgN, если группировка проводится по
непрерывному признаку

Варианта вариационного ряда распределения – это
числовое значение количественного признака

Какая относительная величина рассчитывается путем соотношения одного и того же показателя за различные периоды времени
Динамики

Группировка, в результате которой изучаются взаимосвязи между признаками
аналитическая

Часть наличного населения данного населенного пункта, которая постоянно проживает в другом населенном пункте, а на данной территории находится не более одного года
временно проживающее население

Система национальных счетов – это
учёт, завершаемый на уровне экономики системой взаимосвязанных статистических показателей

Экономический эффект представляет собой
конечный результат хозяйственной или финансовой деятельности

Укажите, какие из перечисленных видов трансфертов относятся к капитальным трансфертам
налоги на капитал, инвестиционные субсидии

В соответствии со стадиями общественного воспроизводства ВВП может быть рассчитан
3 методами

Обобщающим показателем, характеризующим уровень официальной зарегистрированной безработицы в Республике Беларусь, который рассчитывается как отношение численности безработных к численности экономически активного населения, является
коэффициент (уровень) безработицы

Балансирующей статьей счета операций с капиталом на уровне экономики является
чистое кредитование или чистое заимствование

Что в СНС представляет собой сумма денег, которую покупатели готовы заплатить за приобретение товаров или услуг у конкретного продавца, согласного осуществить продажу за эту сумму
рыночная цена

Как называются текущие, безвозмездные, невозвратные платежи, которые государство осуществляет предприятиям для проведения определенной экономической и социальной политики
субсидии на производство и импорт

К финансовым активам относятся
монетарное золото, ценные бумаги, акции

Какое количество секторов выделяют при определении внутренней экономики
5

Доходы какого сектора экономики формируются из взносов членов организаций, пожертвований, дарения
сектор некоммерческих организаций, обслуживающих домашние хозяйства

Обесценение денежных средств (доходов) – это
инфляция 

В международной практике принято считать допустимый уровень статистического расхождения, который составляет
до 5% ВВП

С какой целью выделяют сектор «Остальной мир»
для характеристики внешнеэкономических связей резидентов с зарубежными странами

Производительность живого труда определяется как отношение
экономического эффекта к ресурсам труда (численности трудовых ресурсов)

Фондоотдача определяется как отношение
экономического эффекта к среднегодовой стоимости основных средств

Разница между потенциальными и действующими трудовыми ресурсами ‒ это
абсолютная величина неиспользованных трудовых ресурсов (например, студенты дневного отделения)

К какой группе счетов в СНС относится «Счет использования располагаемого дохода»
текущие счета

Где отражается расчёт национального богатства (чистых активов экономики)
в балансе активов и пассивов

Что является балансирующей статьей счета образования доходов
Валовая прибыль и валовые смешанные доходы

Обратный обобщающий показатель эффективности примененных ресурсов (ресурсоёмкость) равен
отношению примененных ресурсов к экономическому эффекту

По источникам происхождения все экономические активы подразделяются на
произведенные и непроизведенные

Валовое сбережение определяется как
разность между валовым располагаемым доходом и расходами на конечное потребление

К какой группе счетов в СНС относится «Счет производства»
текущие счета

Укажите центры ряда распределения
средняя арифметическая, мода и медиана

Как называется разница между величиной статистического показателя, рассчитанного по выборке, и определенного при проведении сплошного наблюдения
ошибка выборки (репрезентативности)

Как называется наблюдение, учитывающие все без исключения единицы изучаемой совокупности
Сплошное

Мода ряда распределения – это
наиболее часто встречающаяся варианта

Цена единицы продукции увеличилась на 5%. Объем производства остался неизменным. Как изменилась стоимость продукции
выросла на 5%

По числу группировочных признаков различают группировки
простые и сложные (комбинационные)

Распределение признака в вариационном ряду по накопленным частотам (частостям) изображается с помощью
кумуляты распределения

К какому классу средних величин относятся средняя арифметическая и средняя квадратическая
Степенные

Относительная величина динамики равна произведению
относительной величины планового задания и относительной величины выполнения плана

К атрибутивному признаку относится
образование сотрудника

Цена отчетного периода равна 200 руб., цена базисного периода – 100 руб. Определите индивидуальный индекс цены
2,0

Распределение работников предприятия по стажу работы характеризуется следующими данными:5 лет-4 чел.; 6 лет-16 чел.; 7 лет-15 чел.; 8 лет-6 чел. Определите моду стажа работы работников предприятия
6 лет

К атрибутивным признакам относится
национальность

Выберите обозначение выборочной доли, принятое в теории выборки
w

Если степень колеблемости изучаемого признака в генеральной совокупности очень высокая, то случайная ошибка выборки
большая

Ошибки репрезентативности возникают по причине
неполноты охвата единиц исследуемой совокупности

При аналитическом выравнивании динамический ряд выражается в виде
функции от времени у=f(t)

Для исчисления валового внутреннего продукта (ВВП) методом конечного использования доходов используется информация счета
товаров и услуг

Алгоритм расчета валового внутреннего продукта (ВВП) методом конечного использования
ВВП = Расходы на конечное потребление + Валовое накопление основных и оборотных средств + Чистый экспорт товаров и услуг

Социально-экономические показатели уровня жизни населения рассчитываются
как по всему населению, так и в расчете на душу населения

Совокупность институционных единиц, однородных с точки зрения выполняемых функций, целей и источников финансирования, - это
сектор

Как принято называть показатели результатов функционирования экономики на национальном уровне
макроэкономические показатели

Какой классификатор разработан в Республике Беларусь для изучения структуры экономики по секторам
общегосударственный классификатор «Институциональные единицы по секторам экономики» (КИЕС)

В ресурсной части какого счета СНС отражаются основные виды первичных доходов, получаемых резидентами, как от резидентов, так и от сектора остального мира
счет распределения первичных доходов

Социально-экономическая категория, которая измеряется отношением полученного эффекта (результата) к авансированным (примененным) ресурсам или потребленным текущим затратам ‒ это
эффективность

Заключительная стадия производственного процесса и начальная стадия его воспроизводства это
потребление

Использование товаров и услуг без дальнейшей трансформации (значительной переработки) для непосредственного удовлетворения текущих индивидуальных нужд и потребностей людей или коллективных потребностей общества, ‒ это
конечное потребление товаров и услуг

Один из алгоритмов расчета ВВП производственным методом
ВВП = Валовая добавленная стоимость + Чистые налоги на продукты и импорт

Какой сектор оказывает нерыночные услуги и перераспределяет национальный доход и национальное богатство путем взимания налогов и предоставления взамен услуг
сектор государственного управления

Трансферты бывают следующих видов
текущие и капитальные

К другим налогам на производство относятся
налоги за пользование природными ресурсами, налоги на землю, на недвижимость

В Республике Беларусь уровень рождаемости составил 12‰. Данный показатель является относительной величиной
интенсивности

Относительная величина динамики рассчитывается как отношение значений показателя
фактическое / базисное

Доля – это относительная величина, рассчитываемая как отношение
части к целому

Какие средние величины рассчитываются по сгруппированным данным
взвешенные

Если средний темп роста равен 97%, то средний темп прироста равен
– 3%

Как называются интервалы, в которых разность между максимальным и минимальным значениями в каждом из интервалов одинакова
равные

К средним аналитическим показателям динамического ряда относятся
средний абсолютный прирост, средний темп роста и средний темп прироста

Какая относительная величина рассчитывается путем соотношения одного и того же показателя за различные периоды времени
динамики

Что является основной причиной несопоставимости уровней динамического ряда, построенного по стоимостным показателям
цены

Ошибка выборки ‒ это
разница между генеральным и выборочным статистическим показателем

Какая относительная величина характеризует соотношение отдельных частей совокупности друг к другу
координации

Перечень признаков единицы наблюдения, подлежащих регистрации в процессе проведения статистического наблюдения – это
программа наблюдения

Что НЕ является центром ряда распределения
дисперсия

Как часто проводятся переписи населения в Республике Беларусь
один раз в 10 лет

Как называется показатель, отражающий на уровне экономики ресурсы, которые другие страны мира предоставляют данной стране
чистое заимствование

Как называется показатель, отражающий на уровне экономики ресурсы, которые страна предоставляет в распоряжение сектора «остальной мир»
чистое кредитование

Как называется продукция и услуги одних видов деятельности, потреблённые в производственном процессе других видов деятельности в составе одного и того же предприятия или других предприятий
промежуточное потребление

Часть населения страны, занятая экономической деятельностью плюс способное трудиться, но не работающее по тем или иным причинам, – это
трудовые ресурсы

На каком счете отражается перераспределение доходов по экономике
счет вторичного распределения доходов

Какой показатель относится к группе образования и распределения первичных доходов
валовая прибыль

Какие институциональные единицы организуют и финансируют оказание обществу услуг коллективного и индивидуального пользования
органы государственного управления

Перераспределение уже полученных доходов между секторами – это
вторичное распределение доходов

Какие институциональные единицы относятся к сектору некоммерческих организаций, обслуживающих домашние хозяйства
благотворительные общества

Количество лиц, проживающих на определенной территории, ‒ это
численность населения

Производство в СНС делится на
рыночное и нерыночное

Какая форма статистического наблюдения представляет специально организованное наблюдение, направленное только на учет численности и состава определенных объектов (явлений), а также установление качественных характеристик их совокупностей на некоторый момент времени
перепись

Дисперсия – это
квадрат среднего квадратического отклонения

Что показывает уровень интервального ряда динамики
итог развития какого-либо явления за определенный период

Верно ли, что при функциональной связи каждому значению факторного признака соответствует строго определенное значение результативного признака
да

Совокупность считается однородной, если коэффициент вариации
<30%

Степень выполнения плана рассчитывается как отношение значений показателя
фактическое / плановое

Что показывает уровень моментного ряда динамики
состояние какого-либо явления на определенную дату

В основе расчёта национального богатства в соответствии с СНС лежит понятие
экономических активов

Какой из перечисленных факторов учитывается при расчете индекса развития человеческого потенциала
уровень образования

Результаты труда, имеющие натурально-вещественную форму, – это
товары

Установленный государством механизм повышения денежных доходов населения, позволяющий частично возместить ему удорожание потребительских товаров и услуг в результате инфляции, - это
индексация

Какие институциональные единицы относятся к сектору нефинансовых корпораций
организации, осуществляющие рыночное производство товаров и услуг

Валовой выпуск товаров и услуг включает
стоимость произведенных товаров и услуг резидентами страны

Что необходимо вычесть из валового сбережения для определения чистого сбережения
потребление основного капитала

Какие коэффициенты показывают, насколько изменяется уровень потребления отдельных товаров при изменении среднедушевого дохода (или цены) на 1%
коэффициенты эластичности

Какой показатель функционирования экономики можно рассчитать соотношением экономического эффекта и текущих затрат
эффективность функционирования экономики

Распределительным методом ВВП рассчитывается
как сумма первичных доходов

Территория, административно управляемая правительством страны, в пределах которой граждане, товары и капиталы могут перемещаться свободно
экономическая территория страны

В финансовые активы национального богатства включаются следующие активы
монетарное золото, валюта, депозиты

Для количественного отражения зависимости между динамикой доходов или цен и уровнем потребления отдельных товаров рассчитываются
коэффициенты эластичности

Доходы и расходы в СНС подразделяются на
текущие и капитальные

Услуги в классификации СНС могут быть
индивидуальные и коллективные

Что включают в себя налоги на продукты и импорт
налог на добавленную стоимость

При цепном способе сравнения
каждый уровень ряда сравнивается с предыдущим

К показателям вариации относится
Дисперсия

Верно ли, что для того, чтобы изменение веса во времени не исказило изменение индексируемого признака, веса в числителе и знаменателе агрегатного индекса берутся на уровне одного и того же периода
Да

Как называются интервалы, в которых разность между максимальным и минимальным значениями в каждом из интервалов одинакова
Равные

Группировка, при которой группы, выделенные по одному признаку, подразделяются на подгруппы по другому признаку – это
сложная (комбинационная)

По полноте охвата единиц совокупности статистические наблюдения делят на
сплошное и несплошное наблюдение

Как называется метод выравнивания динамического ряда, при котором от исходного ряда динамики переходят к новому ряду с более крупными интервалами
метод укрупнения интервалов динамического ряда

Какая относительная величина рассчитывается путем соотношения одного и того же показателя за различные периоды времени
Динамикой

Распределение единиц статистической совокупности на однородные группы – это
Группировка

Теоретическая линия регрессии – это
линия, вокруг которой группируются точки корреляционного поля

Признак экономически связанный с индексируемым признаком таким образом, чтобы произведение индексируемого признака на него давало реально существующую экономическую величину, - это
вес (соизмеритель)

Темп прироста – это
отношение абсолютного прироста (цепного или базисного) к предыдущему или базисному уровню

Выберите обозначение численности генеральной совокупности, принятое в теории выборки
N

Какие виды связей существуют между признаками
функциональная и корреляционная

К какому классу средних величин относятся средняя арифметическая и средняя квадратическая
степенные

Закономерные внутригодичные изменения, то есть устойчиво повторяющиеся из года в год колебания уровней динамического ряда называются
сезонными колебаниями

Для качественных признаков веса в числителе и знаменателе агрегатного индекса берутся на уровне
отчетного периода

Частота вариационного ряда распределения
численность отдельной варианты (повторяемость значения признака)

Какой относительный показатель можно рассчитать, если известен валовой внутренний продукт и среднегодовая численность населения страны за отчетный год
Интенсивности

Заключительная стадия производственного процесса и начальная стадия его воспроизводства это
Потребление

В разделе «Ресурсы» счета использования валового располагаемого дохода отражается
валовой располагаемый доход

Что является балансирующей статьей счета образования доходов
Валовая прибыль и валовые смешанные доходы

К какому из перечисленных секторов экономики относятся государственные организации здравоохранения, образования, культуры, искусства, физической культуры и спорта
сектор государственного управления

Сумма амортизационных отчислений и недоамортизированной стоимости ликвидированных основных фондов
потребление основного капитала

Трансферты бывают следующих видов
текущие и капитальные

Отношение числа умерших к числу родившихся за период ‒ это
коэффициент депопуляции

Какой классификатор разработан в Республике Беларусь для изучения отраслевой структуры хозяйствующих субъектов
общегосударственный классификатор «Виды экономической деятельности» (ОКЭД)

К какому из перечисленных секторов относятся государственные, кооперативные, частные, акционерные, совместные и другие организации, производящие товары в целях реализации на рынке по ценам, возмещающим издержки производства
сектор нефинансовых корпораций

Что относится к текущим трансфертам
налоги на доходы и прибыль, взносы на государственное социальное страхование, пенсии, пособия

Индекс потребления материальных благ на душу населения рассчитывается путем деления индекса потребления материальных благ всем населением на
индекс среднегодовой численности населения

Что в СНС представляет собой сумма денег, которую покупатели готовы заплатить за приобретение товаров или услуг у конкретного продавца, согласного осуществить продажу за эту сумму
рыночная цена

К какому виду ряда динамики относится ряд «Численность населения на начало года за 2015-2021гг.»
Моментный

Какая единица стоит в основе отраслевой классификаций хозяйствующих субъектов
Заведение

Какой показатель рассчитывается путем суммирования расходов на конечное потребление, валового накопления основного капитала, изменения запасов материальных оборотных средств и чистого экспорт товаров и услуг
Валовой внутренний продукт

С помощью какого показателя можно определить потенциал развития страны
национальное богатство

какому из перечисленных секторов экономики относится ГГУ имени Ф. Скорины
сектор государственного управления

Алгоритм расчета валового внутреннего продукта (ВВП) методом конечного использования
ВВП = Расходы на конечное потребление + Валовое накопление основных и оборотных средств + Чистый экспорт товаров и услуг

Что представляет собой миграционное (механическое) движение населения
выбытие и прибытие

Как называются налоги, которые взимаются пропорционально количеству или стоимости товаров и услуг, производимых, продаваемых или импортируемых предприятиями-резидентами
налоги на продукты и импорт

Лицо, проживающее на территории данной страны в течение года и более, – это
резидент физическое лицо

Что является балансирующей статьей в счете перераспределения доходов в натуральной форме
валовой скорректированный располагаемый доход

Как рассчитывается факторная стоимость
промежуточное потребление + оплата труда наемных работников + валовая прибыль

Объекты в СНС – это
товары, услуги, ценные бумаги, денежные средства, рабочая сила или другой любой носитель стоимости

Согласно счету СНС «Производство» алгоритм расчета ВВП производственным способом
ВВП = Валовой выпуск товаров и услуг в основных ценах – Промежуточное потребление + Чистые налоги на продукты и импорт

В ресурсной части какого счета СНС отражаются основные виды первичных доходов, получаемых резидентами, как от резидентов, так и от сектора остального мира
счет распределения первичных доходов

Медиана ряда распределения – это
варианта, стоящая в середине ряда распределения

Какая форма статистического наблюдения представляет собой систематическое наблюдение в установленные сроки учетно-статистической документации в виде отчетов, всесторонне характеризующих итоги работы предприятий и учреждений в течение отчетных периодов
Отчетностью

Оценить генеральный статистический показатель по результатам выборочного наблюдения ‒ это
указать пределы, в которых он находится в генеральной совокупности с заданным уровнем вероятности

При переписи населения единицей наблюдения является
человек и домашнее хозяйство

Укажите центры ряда распределения
средняя арифметическая, мода и медиана

Какая относительная величина рассчитывается путем отношения фактического уровня к плановому заданию одного и того же периода
выполнения плана

Если темп роста равен 125%, то темп прироста является
25%

Какая относительная величина рассчитывается путем отношения планового задания к базисному уровню показателя
планового задания

Чем ближе эмпирическое корреляционное отношение к -1 или 1, тем
теснее связь между результативным и факторным признаками

Что является основной причиной несопоставимости уровней динамического ряда, построенного по стоимостным показателям
совокупности в целом

Какой характер статистического наблюдения означает наиболее полный охват всех единиц изучаемой совокупности
Массовый

Какой показатель рассчитывается по формуле  
коэффициент вариации

Распределение работников предприятия по стажу работы характеризуется следующими данными5 лет-4 чел.; 6 лет-16 чел.; 7 лет-15 чел.; 8 лет-6 чел. Определите моду стажа работы работников предприятия
6 лет

Какая относительная величина характеризует отношение частей совокупности к общему ее объему
величиной структуры

Соотношение фактического объема выпуска продукции, относящегося к разным предприятиям – это относительная величина
Сравнения

В линейном уравнении регрессии параметр a_1, показывает
на сколько единиц своего измерения увеличится результативный признак при увеличении факторного признака на 1 единицу своего измерения

Относительная величина сравнения характеризует отношение
одноименных абсолютных показателей, относящихся к различным совокупностям

Интервал, в котором указана только одна граница называется
Открытым

Единовременным называется наблюдение, при котором
факты регистрируются однократно, по мере надобности, без соблюдения периодичности

Какие средние величины рассчитываются по несгруппированным данным
Простые

Важнейший вид несплошного статистического наблюдения, при котором изучается часть совокупности, отобранная в случайном порядке с целью последующей характеристики всей совокупности – это
выборочное наблюдение

Средний темп роста рассчитывают по формуле средней
Геометрической

Чему равна валовая прибыль экономики
чистая прибыль плюс потребление основного капитала

К трудовым ресурсам относятся 
лица младше и старше трудоспособного возраста, занятые в экономике

Какой показатель численности населения равняется численности постоянного населения плюс временно проживающие и минус временно отсутствующие
наличное население

Какие институциональные единицы предоставляют услуги, как правило, бесплатные или распределяют товары
некоммерческие организации

По производственно-технологическим признакам субъекты хозяйствования изучаются с помощью
Международной стандартной отраслевой классификации видов деятельности (МСОК)

В соответствии с методологией СНС к непроизведенным нефинансовым активам относятся
природные ресурсы, лицензии и приобретенный гудвилл (деловая репутация)

Разница между валовым внутренним продуктом и потреблением основного капитала, - это
чистый внутренний продукт

Разница между потенциальными и действующими трудовыми ресурсами ‒ это
абсолютная величина неиспользованных трудовых ресурсов (например, студенты дневного отделения)

Отношение числа родившихся к числу умерших ‒ это
коэффициент жизненности

К специальным методам социально-экономической статистики относится
система национальных счетов

Какой из перечисленных показателей является прямым показателем эффективности использования основных средств
Фондоотдача

Один из алгоритмов расчета ВВП производственным методом
ВВП = Валовая добавленная стоимость + Чистые налоги на продукты и импорт

Какая наука является теоретической основой социально-экономической статистики
экономическая теория

Экономический эффект всегда выражается
абсолютной величиной

Экономический эффект представляет собой
конечный результат хозяйственной или финансовой деятельности

Выберите из приведенных характеристик ту, что соответствует понятию «Институционная единица»
хозяйственная единица, которая обладает правом осуществления хозяйственной деятельности, самостоятельно распоряжается своими ресурсами, несет ответственность по своим обязательствам и ведет полный набор бухгалтерских счетов

Объект, находящийся в индивидуальной или коллективной собственности институциональной единицы, в результате владения которым или использования которого собственник может извлекать экономическую выгоду, - это
экономический актив

Какой сектор используется при определении внутренней экономики по СНС
сектор домашних хозяйств

Что является компонентом валового накопления основного капитала
стоимость приобретения производителем основных средств (за вычетом их выбытия) в течение отчетного периода

Перемещение населения через границы страны и ее территориальных подразделений, связанное с переменой места жительства навсегда или на определенное время ‒ это
миграционное (механическое) движение

Деятельность организаций, которая вносит наибольший вклад в валовую добавленную стоимость, ‒ это
Основная

Что является балансирующей статьей в счете вторичного распределения доходов
Валовой располагаемый доход

Валовая добавленная стоимость и ВВП оцениваются
как в текущих, так и в постоянных ценах

Обобщающим показателем, характеризующим уровень официальной зарегистрированной безработицы в Республике Беларусь, который рассчитывается как отношение численности безработных к численности экономически активного населения, является
коэффициент (уровень) безработицы

Укажите вариационный ряд распределения распределение рабочих по 
заработной плате

Относительная величина, которая получается в результате сравнения непосредственно не поддающихся суммированию уровней социально-экономических явлений – это
общий индекс

Графически интервальный ряд распределения может быть представлен
гистограммой распределения

Относительная величина, которая получается в результате сравнения непосредственно не поддающихся суммированию уровней социально-экономических явлений
это общий индекс

Графически интервальный ряд распределения может быть представлен
гистограммой распределения

Признак экономически связанный с индексируемым признаком таким образом, чтобы произведение индексируемого признака на него давало реально существующую экономическую величину
это вес (соизмеритель)

По способу выражения признаки делятся на
количественные, атрибутивные, альтернативные

При переписи населения единицей наблюдения является
человек и домашнее хозяйство

По времени регистрации фактов различают наблюдение
периодическое, текущее, единовременное

С помощью межгрупповой дисперсии измеряют
колеблемость результативного признака под влиянием изучаемого факторного признака

Ошибками регистрации называются
ошибки, возникающие в результате неправильного установления фактов или неправильной их записи

Основной проблемой при построении ряда динамики является
сопоставимость уровней динамического ряда

Если средний темп роста равен 97%, то средний темп прироста равен
– 3%

Наиболее распространенная форма общего индекса
это агрегатный индекс

Несплошное наблюдение предусматривает обследование
части единиц изучаемой совокупности

Трендом ряда динамики называется
основная тенденция

Коэффициент надежности (t-критерий) зависит
от уровня задаваемой вероятности, с которой необходимо гарантировать предельную ошибку выборки

Частость вариационного ряда распределения
это доля каждой группы в совокупности

Для определения абсолютного изменения стоимости за счет изменения цены необходимо
найти разность между числителем и знаменателем агрегатного индекса цены

Соотношение фактического объема выпуска продукции, относящегося к разным предприятиям
это относительная величина сравнения

Для качественных признаков веса в числителе и знаменателе агрегатного индекса берутся на уровне
отчетного периода

По временному признаку ряды динамики бывают
интервальные и моментные

Как называется метод выравнивания динамического ряда, при котором от исходного ряда динамики переходят к новому ряду, состоящему из средних величин, рассчитанных по уровням исходного ряда
метод «скользящей» средней

Для расчета среднего уровня моментного ряда с равноудаленными датами используется
средняя хронологическая

Важнейший вид несплошного статистического наблюдения, при котором изучается часть совокупности, отобранная в случайном порядке с целью последующей характеристики всей совокупности
это выборочное наблюдение

Как рассчитывается факторная стоимость
промежуточное потребление + оплата труда наемных работников + валовая прибыль

К какой категории населения относятся лица, находящиеся на момент переписи на данной территории, включая временно проживающих
наличное население

Использование доходов на уровне экономики в целом, ее секторов осуществляется на
валовое сбережение и расходы на конечное потребление

Какие лица относятся к категории нетрудоспособного населения в трудоспособном возрасте
лица в трудоспособном возрасте, имеющие I и II группу инвалидности

Показатель, характеризующий максимальную сумму средств, которыми располагает экономика, и которые могут быть использованы на конечное потребление товаров и услуг и сбережение в текущем периоде без изменения национального богатства страны
это Валовой располагаемый доход

Продукты или продукция в СНС
это товары и услуги

Для чего предназначена система национальных счетов
СНС предназначена для комплексного отображения и анализа состояния экономики страны

К какому из перечисленных секторов экономики относится ГГУ имени Ф. Скорины
сектор государственного управления

Лицо, проживающее на территории данной страны в течение года и более
это резидент физическое лицо

Отношение численности трудоспособного населения в трудоспособном возрасте к численности всего населения
это коэффициент трудоспособности всего населения

Наиболее важный информационный источник данных о населении
это переписи населения

По форме функционирования экономические активы подразделяются на
финансовые и нефинансовые

Совокупность накопленных материальных благ и нематериальных активов, созданных трудом человека за время его существования, принадлежащих стране или её резидентам на экономической территории страны и за её пределами, а также разведанных и вовлечённых в экономический оборот природных и других ресурсов
это национальное богатство

К задачам социально-экономической статистики относится
разработка научно-обоснованной статистической методологии расчета социально-экономических показателей

К какому из перечисленных секторов экономики относятся религиозные общества
сектор некоммерческих организаций, обслуживающих домашние хозяйства

Какие институциональные единицы предоставляют услуги, как правило, бесплатные или распределяют товары
некоммерческие организации

Как рассчитывается чистая прибыль экономики
Валовая прибыль экономики ‒ Потребление основного капитала

По какой формуле рассчитывается индекс потребительских цен в Республике Беларусь
по модифицированной формуле Ласпейреса

При какой инфляции происходит рост уровня цен в условиях свободных цен, не регулируемых государством
при открытой инфляции

Отношение числа родившихся к среднегодовой численности женщин репродуктивного (фертильного) возраста
это специальный коэффициент рождаемости

Какая цель присуща секторной классификации хозяйствующих субъектов
изучение движения потоков доходов и расходов

К какому из перечисленных секторов экономики относятся государственные, кооперативные, частные, акционерные, совместные и другие организации, производящие товары в целях реализации на рынке по ценам, возмещающим издержки производства
сектор нефинансовых корпораций

Какой сектор экономики участвует в конечном потреблении товаров и услуг
сектор государственного управления

При какой инфляции цены постоянны, существует дефицит товаров и отложенный спрос
при скрытой инфляции

Одним из основных источников информации о доходах, расходах и сбережениях населения является
баланс денежных доходов и расходов населения

Для расчета среднего уровня интервального ряда с равными периодами времени используется
средняя арифметическая простая

Чему равна сумма линейных отклонений вариант от средней величины
0

Сущность статистического наблюдения заключается
в планомерном научно-организованном сборе данных о явлениях и процессах общественной жизни

В результате чего возникают систематические ошибки репрезентативности
когда нарушаются принципы отбора в выборочную совокупность

Статистический показатель, который характеризует относительное изменение признака либо у одной единицы совокупности, либо по совокупности в целом
это индекс

Какой из средних величин относится к степенным средним
средняя гармоническая

Точечный график, который строится на основе индивидуальных значений факторных и результативных признаков
это поле корреляции

К количественному признаку относится
возраст сотрудника

Значение статистического показателя в рядах динамики называется
уровень ряда динамики

Верно ли, что для того, чтобы изменение веса во времени не исказило изменение индексируемого признака, веса в числителе и знаменателе агрегатного индекса берутся на уровне одного и того же периода
Да

Корреляционная связь верна для
совокупности в целом

Какой коэффициент показывает, на сколько процентов изменится результативный показатель, если факторный возрастет на 1%
коэффициент эластичности

Темп прироста
это отношение абсолютного прироста (цепного или базисного) к предыдущему или базисному уровню

Какие виды связей существуют между признаками
функциональная и корреляционная

Ряд динамики
это ряд статистических показателей, расположенных в хронологической последовательности

Определение недостающих уровней динамического ряда внутри ряда
это интерполяция

Предметом статистики является
количественная сторона массовых социально-экономических явлений

Темп роста
это отношение уровней динамического ряда

Относительная величина сравнения характеризует отношение
одноименных абсолютных показателей, относящихся к различным совокупностям

Текущее наблюдение
это наблюдение при котором регистрация фактов осуществляется постоянно по мере их возникновения

Абсолютное содержание 1% прироста
это отношение абсолютного цепного прироста к цепному темпу прироста, выраженному в %

Руководящим органом в области статистики в Республике Беларусь является
Национальный статистический комитет

Какой из нижеприведенных видов доходов является вторичным (производным) доходом секторов экономики
пенсии, стипендии, пособия

Часть постоянного населения данного населенного пункта, которая на критический момент переписи находится в других населенных пунктах, но время ее отсутствия не должно превышать одного года
временно отсутствующее население

Валовое сбережение
это балансирующая статья счета использования валового располагаемого дохода

Рыночное производство
это производство товаров и услуг с целью получения прибыли

Экономический эффект всегда выражается
абсолютной величиной

Что относится к текущим трансфертам
налоги на доходы и прибыль, взносы на государственное социальное страхование, пенсии, пособия

Алгоритм расчета ВВП распределительным методом
ВВП = Оплата труда наемных работников + Чистые налоги на производство и импорт + Валовая прибыль и валовые смешанные доходы

Что является балансирующей статьей счета распределения первичных доходов на уровне экономики
Валовой национальный доход

Институционная единица, имеющая центр экономических интересов на экономической территории страны, – это
резидент страны

К налогам на продукты и импорт относятся
налог на добавленную стоимость, акцизы, таможенные пошлины

По каким признакам производят изучение состава населения
все варианты ответа верны

Что необходимо вычесть из валового национального дохода, чтобы получить чистый национальный доход
потребление основного капитала

Отношение численности естественного пополнения трудовых ресурсов к численности их естественной убыли ‒ это
коэффициент естественного воспроизводства трудовых ресурсов

Как называются налоги, которые взимаются пропорционально количеству или стоимости товаров и услуг, производимых, продаваемых или импортируемых предприятиями-резидентами
налоги на продукты и импорт

Одним из обобщающих показателей уровня жизни населения является
индекс развития человеческого потенциала

Производственным методом ВВП рассчитывается
как сумма валовой добавленной стоимости

Часть национальной экономики, представляющая собой совокупность скрытой, неформальной и незаконной экономической деятельности, – это
ненаблюдаемая экономика

Один из алгоритмов расчета ВВП производственным способом
ВВП = Валовой выпуск товаров и услуг в ценах производителей – Промежуточное потребление

Объекты в СНС – это
товары, услуги, ценные бумаги, денежные средства, рабочая сила или другой любой носитель стоимости

Движение объектов экономической деятельности от одного субъекта к другому – это
экономическая операция

К какому из перечисленных секторов экономики относятся коммерческие банки
сектор финансовых корпораций

Чему равна валовая прибыль экономики
чистая прибыль плюс потребление основного капитала

К видам институциональных единиц относятся
корпорации, домашние хозяйства, органы государственного управления и некоммерческие организации

Способ основного массива, выборочное, анкетное и монографическое наблюдение относятся к видам
несплошного наблюдения

Вариационным рядом распределения называется ряд, построенный по
количественному признаку

Частота вариационного ряда распределения – это
численность отдельной варианты (повторяемость значения признака)

Обобщающий показатель, характеризующий типический уровень варьирующего признака ‒ это
средняя величина

Объект статистического наблюдения представляет собой
совокупность явлений и процессов, подвергающихся наблюдению

В линейном уравнении регрессии параметр показывает
на сколько единиц своего измерения увеличится результативный признак при увеличении факторного признака на 1 единицу своего измерения

Какой из перечисленных показателей является относительной величиной структуры
удельный вес городского населения

Какие средние величины рассчитываются по несгруппированным данным
Простые

В качестве меры достоверности уравнения регрессии может рассчитываться
среднеквадратическая ошибка

Относительное изменение средней цены за счет изменения структуры продаж товаров показывает
индекс структурных сдвигов

Выберите из списка сплошное статистическое наблюдение
перепись населения

Для объемных признаков веса в числителе и знаменателе агрегатного индекса берутся на уровне
базисного периода

Если средний темп прироста равен 5%, то средний темп роста равен
105%

Теоретическая линия регрессии – это
линия, вокруг которой группируются точки корреляционного поля

Отбор, который организуется способом жеребьевки, определяют как
случайный отбор

Какими бывают способы отбора единиц совокупности в выборку
повторный и бесповторный

Единовременным называется наблюдение, при котором
факты регистрируются однократно, по мере надобности, без соблюдения периодичности

Одним из методов выявления корреляционной связи является
метод аналитических группировок

Число групп определяется по формуле n = 1+3,322 lgN, если группировка проводится по
непрерывному признаку

Варианта вариационного ряда распределения – это
числовое значение количественного признака

Какая относительная величина рассчитывается путем соотношения одного и того же показателя за различные периоды времени
Динамики

Группировка, в результате которой изучаются взаимосвязи между признаками
аналитическая

Часть наличного населения данного населенного пункта, которая постоянно проживает в другом населенном пункте, а на данной территории находится не более одного года
временно проживающее население

Система национальных счетов – это
учёт, завершаемый на уровне экономики системой взаимосвязанных статистических показателей

Экономический эффект представляет собой
конечный результат хозяйственной или финансовой деятельности

Укажите, какие из перечисленных видов трансфертов относятся к капитальным трансфертам
налоги на капитал, инвестиционные субсидии

В соответствии со стадиями общественного воспроизводства ВВП может быть рассчитан
3 методами

Обобщающим показателем, характеризующим уровень официальной зарегистрированной безработицы в Республике Беларусь, который рассчитывается как отношение численности безработных к численности экономически активного населения, является
коэффициент (уровень) безработицы

Балансирующей статьей счета операций с капиталом на уровне экономики является
чистое кредитование или чистое заимствование

Что в СНС представляет собой сумма денег, которую покупатели готовы заплатить за приобретение товаров или услуг у конкретного продавца, согласного осуществить продажу за эту сумму
рыночная цена

Как называются текущие, безвозмездные, невозвратные платежи, которые государство осуществляет предприятиям для проведения определенной экономической и социальной политики
субсидии на производство и импорт

К финансовым активам относятся
монетарное золото, ценные бумаги, акции

Какое количество секторов выделяют при определении внутренней экономики
5

Доходы какого сектора экономики формируются из взносов членов организаций, пожертвований, дарения
сектор некоммерческих организаций, обслуживающих домашние хозяйства

Обесценение денежных средств (доходов) – это
инфляция

В международной практике принято считать допустимый уровень статистического расхождения, который составляет
до 5% ВВП

С какой целью выделяют сектор «Остальной мир»
для характеристики внешнеэкономических связей резидентов с зарубежными странами

Производительность живого труда определяется как отношение
экономического эффекта к ресурсам труда (численности трудовых ресурсов)

Фондоотдача определяется как отношение
экономического эффекта к среднегодовой стоимости основных средств

Разница между потенциальными и действующими трудовыми ресурсами ‒ это
абсолютная величина неиспользованных трудовых ресурсов (например, студенты дневного отделения)

К какой группе счетов в СНС относится «Счет использования располагаемого дохода»
текущие счета

Где отражается расчёт национального богатства (чистых активов экономики)
в балансе активов и пассивов

Что является балансирующей статьей счета образования доходов
Валовая прибыль и валовые смешанные доходы

Обратный обобщающий показатель эффективности примененных ресурсов (ресурсоёмкость) равен
отношению примененных ресурсов к экономическому эффекту

По источникам происхождения все экономические активы подразделяются на
произведенные и непроизведенные

Валовое сбережение определяется как
разность между валовым располагаемым доходом и расходами на конечное потребление

К какой группе счетов в СНС относится «Счет производства»
текущие счета

Укажите центры ряда распределения
средняя арифметическая, мода и медиана

Как называется разница между величиной статистического показателя, рассчитанного по выборке, и определенного при проведении сплошного наблюдения
ошибка выборки (репрезентативности)

Как называется наблюдение, учитывающее все без исключения единицы изучаемой совокупности
Сплошное

Мода ряда распределения – это
наиболее часто встречающаяся варианта

Цена единицы продукции увеличилась на 5%. Объем производства остался неизменным. Как изменилась стоимость продукции
выросла на 5%

По числу группировочных признаков различают группировки
простые и сложные (комбинационные)

Распределение признака в вариационном ряду по накопленным частотам (частостям) изображается с помощью
кумуляты распределения

К какому классу средних величин относятся средняя арифметическая и средняя квадратическая
Степенные

Относительная величина динамики равна произведению
относительной величины планового задания и относительной величины выполнения плана

К атрибутивному признаку относится
образование сотрудника

Цена отчетного периода равна 200 руб., цена базисного периода – 100 руб. Определите индивидуальный индекс цены
2,0

Распределение работников предприятия по стажу работы характеризуется следующими данными
5 лет - 4 чел.; 6 лет - 16 чел.; 7 лет - 15 чел.; 8 лет - 6 чел.

Определите моду стажа работы работников предприятия
6 лет

К атрибутивным признакам относится
национальность

Выберите обозначение выборочной доли, принятое в теории выборки
w

Если степень колеблемости изучаемого признака в генеральной совокупности очень высокая, то случайная ошибка выборки
большая

Ошибки репрезентативности возникают по причине
неполноты охвата единиц исследуемой совокупности

При аналитическом выравнивании динамический ряд выражается в виде
функции от времени у = f(t)

Для исчисления валового внутреннего продукта (ВВП) методом конечного использования доходов используется информация счета
товаров и услуг

Алгоритм расчета валового внутреннего продукта (ВВП) методом конечного использования
ВВП = Расходы на конечное потребление + Валовое накопление основных и оборотных средств + Чистый экспорт товаров и услуг

Социально-экономические показатели уровня жизни населения рассчитываются
как по всему населению, так и в расчете на душу населения

Совокупность институционных единиц, однородных с точки зрения выполняемых функций, целей и источников финансирования, - это
сектор

Как принято называть показатели результатов функционирования экономики на национальном уровне
макроэкономические показатели

Какой классификатор разработан в Республике Беларусь для изучения структуры экономики по секторам
общегосударственный классификатор «Институциональные единицы по секторам экономики» (КИЕС)

В ресурсной части какого счета СНС отражаются основные виды первичных доходов, получаемых резидентами, как от резидентов, так и от сектора остального мира
счет распределения первичных доходов

Социально-экономическая категория, которая измеряется отношением полученного эффекта (результата) к авансированным (примененным) ресурсам или потребленным текущим затратам ‒ это
эффективность

Заключительная стадия производственного процесса и начальная стадия его воспроизводства это
потребление

Использование товаров и услуг без дальнейшей трансформации (значительной переработки) для непосредственного удовлетворения текущих индивидуальных нужд и потребностей людей или коллективных потребностей общества, ‒ это
конечное потребление товаров и услуг

Один из алгоритмов расчета ВВП производственным методом
ВВП = Валовая добавленная стоимость + Чистые налоги на продукты и импорт

Какой сектор оказывает нерыночные услуги и перераспределяет национальный доход и национальное богатство путем взимания налогов и предоставления взамен услуг
сектор государственного управления

Трансферты бывают следующих видов
текущие и капитальные

К другим налогам на производство относятся
налоги за пользование природными ресурсами, налоги на землю, на недвижимость

К какому виду ряда динамики относится ряд «Чистая прибыль экономики за 2015-2021гг.»
интервальный

Что является последней стадией статистического исследования
статистический анализ

Руководящим органом в области статистики в Республике Беларусь является
Национальный статистический комитет

Что показывает уровень моментного ряда динамики
состояние какого-либо явления на определенную дату

Единовременным называется наблюдение, при котором
факты регистрируются однократно, по мере надобности, без соблюдения периодичности

По времени регистрации фактов различают наблюдение
периодическое, текущее, единовременное

Какая форма статистического наблюдения представляет собой систематическое наблюдение в установленные сроки учетно-статистической документации в виде отчетов, всесторонне характеризующих итоги работы предприятий и учреждений в течение отчетных периодов
отчетность

Если с увеличением факторного признака средние значения результативного признака уменьшаются, то между факторным и результативным признаком
существует обратная связь

Что является элементом вариационного ряда распределения
частоты

К количественному признаку относится
возраст сотрудника

Выберите обозначение выборочной доли, принятое в теории выборки
w

Что изучается при выборочном наблюдении
часть совокупности

Распределение единиц статистической совокупности на однородные группы – это
группировка

В качестве меры достоверности уравнения регрессии может рассчитываться
среднеквадратическая ошибка

Относительная величина динамики равна произведению
относительной величины планового задания и относительной величины выполнения плана

Значение статистического показателя в рядах динамики называется
уровень ряда динамики

Объект статистического наблюдения представляет собой
совокупность явлений и процессов, подвергающихся наблюдению

Трендом ряда динамики называется
основная тенденция

Чем ближе эмпирическое корреляционное отношение к -1 или 1, тем
теснее связь между результативным и факторным признаками

При каком способе опроса проверяется правильность заполнения формуляров
способе саморегистрации

Какие средние величины рассчитываются по сгруппированным данным
взвешенные

К какому виду выборки относится исследование каждого десятого рабочего при изучении использования рабочего времени
механическая выборка

По числу группировочных признаков различают группировки
простые и сложные (комбинационные)

Интервал, в котором указана только одна граница называется
открытый

По какой формуле рассчитывается индекс потребительских цен в Республике Беларусь
по модифицированной формуле Ласпейреса

Как часто проводятся переписи населения в Республике Беларусь
один раз в 10 лет

Совокупность накопленных материальных благ и нематериальных активов, созданных трудом человека за время его существования, принадлежащих стране или её резидентам на экономической территории страны и за её пределами, а также разведанных и вовлечённых в экономический оборот природных и других ресурсов – это
национальное богатство

Укажите «лишний» объект изучения социально-экономической статистики
финансовое состояние предприятия

Фондовооруженность труда определяется как отношение
среднегодовой стоимости основных средств к ресурсам труда (численности трудовых ресурсов)

Экономический эффект представляет собой
конечный результат хозяйственной или финансовой деятельности

По форме функционирования экономические активы подразделяются на
финансовые и нефинансовые

В соответствии с методологией СНС к непроизведенным нефинансовым активам относятся
природные ресурсы, лицензии и приобретенный гудвилл (деловая репутация)

К числу основных социально-экономических показателей уровня жизни населения в белорусской статистике относятся
показатели доходов населения, показатели расходов и потребления населением материальных благ и услуг, сбережений, обеспеченности жильем

Доходы какого сектора экономики формируются из полученных процентов, страховых премий, комиссионных
сектор финансовых корпораций

В «потребительскую корзину» включаются
все варианты ответа верны

Какой показатель определяется как произведение индекса потребительских цен и индекса скрытой инфляции
индекс инфляции

Лица, работающие по найму за вознаграждение, а также не по найму для получения прибыли или дохода, а также лица, временно отсутствующие на работе, ‒ это
занятое население

Показатель, характеризующий максимальную сумму средств, которыми располагает экономика, и которые могут быть использованы на конечное потребление товаров и услуг и сбережение в текущем периоде без изменения национального богатства страны, - это
Валовой располагаемый доход

К трудовым ресурсам относятся
лица младше и старше трудоспособного возраста, занятые в экономике

Экономический объект, от владения которым или от использования которого собственник извлекает экономическую выгоду, – это
экономический актив

Распределительным методом ВВП рассчитывается
как сумма первичных доходов

К задачам социально-экономической статистики относится
разработка научно-обоснованной статистической методологии расчета социально-экономических показателей

Доходы и расходы в СНС подразделяются на
текущие и капитальные

Установленный государством механизм повышения денежных доходов населения, позволяющий частично возместить ему удорожание потребительских товаров и услуг в результате инфляции, - это
индексация

Валовой внутренний продукт характеризует
стоимость конечных товаров и услуг в рыночных ценах, произведенных резидентами страны за определенный период времени

К какой группе счетов в СНС относится «Счет операций с капиталом»
счета накопления

Доходы населения могут быть
номинальные и реальные

Разность между общей суммой экономических активов и всех финансовых обязательств резидентов страны ‒ это
национальное богатство

Сущность статистического наблюдения заключается
в планомерном научно-организованном сборе данных о явлениях и процессах общественной жизни

Соотношение фактического объема выпуска продукции, относящегося к разным предприятиям – это относительная величина
сравнения

По полноте охвата единиц совокупности статистические наблюдения делят на
сплошное и несплошное наблюдение

Верно ли, что для того, чтобы изменение веса во времени не исказило изменение индексируемого признака, веса в числителе и знаменателе агрегатного индекса берутся на уровне одного и того же периода
да

Отбор, который организуется путем разбивки совокупности на группы с последующим отбором целых серий, внутри которых обследованию подвергаются все единицы совокупности, определяют как
серийный отбор

Для расчета среднего уровня моментного ряда с неравностоящими датами используется
средняя арифметическая взвешенная

Доля колеблемости результативного признака под влиянием изучаемого факторного признака – это
коэффициент детерминации

Какая из средних величин относится к степенным средним
средняя гармоническая

Какая относительная величина рассчитывается путем соотношения одного и того же показателя за различные периоды времени
динамики

Статистический показатель, который характеризует относительное изменение признака либо у одной единицы совокупности, либо по совокупности в целом – это
индекс

К показателям вариации относится
дисперсия

К атрибутивному признаку относится
образование сотрудника

Как называется метод выравнивания динамического ряда, при котором от исходного ряда динамики переходят к новому ряду с более крупными интервалами
метод укрупнения интервалов динамического ряда

Отбор, который организуется способом жеребьевки, определяют как
случайный отбор

Группировка, при которой группы, выделенные по одному признаку, подразделяются на подгруппы по другому признаку – это
сложная (комбинационная)

Признак экономически связанный с индексируемым признаком таким образом, чтобы произведение индексируемого признака на него давало реально существующую экономическую величину, - это
вес (соизмеритель)

В каких единицах измерения рассчитывается относительная величина, при умножении соотношения на 1000
промилле

Наиболее распространенная форма общего индекса – это
агрегатный индекс

Если с увеличением факторного признака средние значения результативного признака меняются беспорядочно, то между факторным и результативным признаком
связи нет

Графически интервальный ряд распределения может быть представлен
гистограммой распределения

Если средний темп прироста равен 5%, то средний темп роста равен
105%

Какими бывают способы отбора единиц совокупности в выборку
повторный и бесповторный

С помощью межгрупповой дисперсии измеряют
колеблемость результативного признака под влиянием изучаемого факторного признака

Сумма первичных доходов, полученных резидентами страны с учетом сальдо первичных доходов от «остального мира», – это
Валовой национальный доход

Производственная деятельность включает в себя
производство товаров и услуг

При анализе занятости населения выделяют
экономически активное и экономически неактивное население

К специальным методам социально-экономической статистики относится
система национальных счетов

Валовой выпуск товаров и услуг включает
стоимость произведенных товаров и услуг резидентами страны

Согласно счету СНС «Производство» алгоритм расчета ВВП производственным способом:
ВВП = Валовой выпуск товаров и услуг в основных ценах – Промежуточное потребление + Чистые налоги на продукты и импорт

Какой показатель рассчитывается путем суммирования расходов на конечное потребление, валового накопления основного капитала, изменения запасов материальных оборотных средств и чистого экспорт товаров и услуг
Валовой внутренний продукт

Какое количество секторов выделяют при определении внутренней экономики
5

В каком из следующих счетов СНС отражаются первичные доходы, выплачиваемые производителями-резидентами участникам производства (кроме доходов от собственности)
счет образования доходов

Социально-экономическая категория, которая измеряется отношением полученного эффекта (результата) к авансированным (примененным) ресурсам или потребленным текущим затратам ‒ это
эффективность

Индекс потребления материальных благ на душу населения рассчитывается путем деления индекса потребления материальных благ всем населением на
индекс среднегодовой численности населения

Как рассчитывается рыночная цена производителя
основная цена + чистые налоги на продукты и импорт

Какие институциональные единицы относятся к сектору финансовых корпораций
банки и страховые организации

Какой показатель функционирования экономики можно рассчитать соотношением экономического эффекта и текущих затрат
эффективность функционирования экономики

Какой показатель является центральным показателем СНС, характеризующим стоимость конечных товаров и услуг в рыночных ценах, произведенных резидентами страны за определенный период времени
Валовой внутренний продукт

Территория, административно управляемая правительством страны, в пределах которой граждане, товары и капиталы могут перемещаться свободно
экономическая территория страны

Что является балансирующей статьей счета образования доходов
Валовая прибыль и валовые смешанные доходы

Алгоритм расчета ВВП распределительным методом
ВВП = Оплата труда наемных работников + Чистые налоги на производство и импорт + Валовая прибыль и валовые смешанные доходы

К какому из перечисленных секторов экономики относятся религиозные общества
сектор некоммерческих организаций, обслуживающих домашние хозяйства

Какая единица стоит в основе секторной классификации хозяйствующих субъектов
институциональная единица

Выберите из приведенных характеристик ту, что соответствует понятию «Институционная единица»
хозяйственная единица, которая обладает правом осуществления хозяйственной деятельности, самостоятельно распоряжается своими ресурсами, несет ответственность по своим обязательствам и ведет полный набор бухгалтерских счетов

Сумма амортизационных отчислений и недоамортизированной стоимости ликвидированных основных фондов
потребление основного капитала

Произведенный продукт делится на
промежуточный и конечный

Рыночное производство
производство товаров и услуг с целью получения прибыли

Балансирующей статьей в счете использования валового располагаемого дохода является
Валовое сбережение

Относительное изменение средней цены за счет изменения цен в отдельных точках продаж показывает
индекс средней цены постоянного состава

Как называется наблюдение, учитывающее все без исключения единицы изучаемой совокупности
сплошное

Относительная величина планового задания рассчитывается как отношение значений показателя
плановое / базисное

По способу выражения признаки делятся на
количественные, атрибутивные, альтернативные

Параметры уравнения регрессии чаще всего находят методом
наименьших квадратов

Какая относительная величина рассчитывается путем отношения фактического уровня к плановому заданию одного и того же периода
выполнения плана

Обобщающий показатель, характеризующий типический уровень варьирующего признака
средняя величина

Верно ли, что при функциональной связи каждому значению факторного признака соответствует строго определенное значение результативного признака
да

Из каких величин может строиться интервальный ряд динамики
абсолютных, относительных и средних величин

С помощью средней из внутригрупповых дисперсий измеряют
колеблемость результативного признака под влиянием всех других факторных признаков

При каком методе выравнивания динамического ряда его уровень рассматривается, как функция от времени у=f(t)
аналитическое выравнивание

Вариационным рядом распределения называется ряд, построенный по
количественному признаку

Какие средние величины рассчитываются по несгруппированным данным
простые

Для определения абсолютного изменения стоимости за счет изменения цены необходимо
найти разность между числителем и знаменателем агрегатного индекса цены

Группировка, в результате которой изучаются взаимосвязи между признаками
аналитическая

При переписи населения единицей наблюдения является
человек и домашнее хозяйство

Какие бывают ошибки выборки (репрезентативности)
случайные и систематические

Для расчета среднего уровня интервального ряда с неравными периодами времени используется
средняя арифметическая взвешенная

Чему равна сумма линейных отклонений вариант от средней величины
0

Какая относительная величина характеризует соотношение отдельных частей совокупности друг к другу
координации

Мода ряда распределения
наиболее часто встречающаяся варианта

Относительная величина интенсивности характеризует отношение  
абсолютного уровня одного показателя к другому, характеризующих одну совокупность  

Перечень признаков единицы наблюдения, подлежащих регистрации в процессе проведения статистического наблюдения  
программа наблюдения  

На каком счете отражается перераспределение доходов по экономике  
счет вторичного распределения доходов  

Производственным методом ВВП рассчитывается  
как сумма валовой добавленной стоимости  

Часть наличного населения данного населенного пункта, которая постоянно проживает в другом населенном пункте, а на данной территории находится не более одного года  
временно проживающее население  

Какие коэффициенты показывают, насколько изменяется уровень потребления отдельных товаров при изменении среднедушевого дохода или цены на 1%  
коэффициенты эластичности  

Доходы какого сектора экономики формируются из взносов членов организаций, пожертвований, дарения  
сектор некоммерческих организаций, обслуживающих домашние хозяйства  

Услуги в классификации СНС могут быть  
индивидуальные и коллективные  

К какой категории населения относятся лица, постоянно проживающие на данной территории, включая временно отсутствующих на момент переписи  
постоянное население  

Какой показатель характеризует изменение стоимости фиксированного набора товаров и услуг, условно приобретаемого населением  
индекс потребительских цен  

Субъекты в СНС  
юридические и физические лица  

Что представляет собой естественное движение населения  
рождаемость и смертность  

С какой целью выделяют сектор Остальной мир  
для характеристики внешнеэкономических связей резидентов с зарубежными странами  

Отношение численности трудоспособного населения в трудоспособном возрасте к численности всего населения  
коэффициент трудоспособности всего населения  

Один из алгоритмов расчета ВВП производственным методом  
ВВП = Валовая добавленная стоимость + Чистые налоги на продукты и импорт  

Обесценение денежных средств доходов  
инфляция  

В количественном отношении Валовой национальный доход ВНД отличается от Валового внутреннего продукта ВВП на величину следующего показателя  
сальдо первичных доходов, полученных от Остального мира и переданных Остальному миру  

Какой сектор используется при определении внутренней экономики по СНС  
сектор домашних хозяйств  

Индекс реальных доходов населения рассчитывается как отношение  
индекса номинальных доходов к индексу потребительских цен  

Где отражается расчёт национального богатства чистых активов экономики  
в балансе активов и пассивов  

Что является балансирующей статьей счета распределения первичных доходов на уровне экономики  
Валовой национальный доход  

Деятельность организаций, которая вносит наибольший вклад в валовую добавленную стоимость  
основная  

Алгоритм расчета валового внутреннего продукта ВВП методом конечного использования  
ВВП = Расходы на конечное потребление + Валовое накопление основных и оборотных средств + Чистый экспорт товаров и услуг  

Что в СНС представляет собой сумма денег, которую покупатели готовы заплатить за приобретение товаров или услуг у конкретного продавца  
рыночная цена  

Обобщающим показателем, характеризующим уровень официальной зарегистрированной безработицы в Республике Беларусь, который рассчитывается как отношение численности безработных к численности экономически активного населения  
коэффициент уровня безработицы  

По производственно-технологическим признакам субъекты хозяйствования изучаются с помощью
Международной стандартной отраслевой классификации видов деятельности

Часть постоянного населения данного населенного пункта, которая на критический момент переписи находится в других населенных пунктах, но время ее отсутствия не должно превышать одного года  
временно отсутствующее население  

Распределение признака в вариационном ряду по накопленным частотам частостям изображается с помощью
кумуляты распределения  

Если признаки связаны между собой мультипликативной связью, то их индексы
связаны точно также  

Для объемных признаков веса в числителе и знаменателе агрегатного индекса берутся на уровне
базисного периода  

Что показывает уровень интервального ряда динамики
итог развития какого-либо явления за определенный период

Абсолютный прирост
разность уровней динамического ряда

Относительная величина координации характеризует отношение  
частей изучаемой совокупности к одной из них, принятой за базу сравнения  

Степень выполнения плана рассчитывается как отношение значений показателя  
фактическое / плановое  

Относительная величина динамики рассчитывается как отношение значений показателя  
фактическое / базисное  

Частость вариационного ряда распределения  
доля каждой группы в совокупности  

Медиана ряда распределения  
варианта, стоящая в середине ряда распределения  

Самой распространённой и легко интерпретируемой формой уравнения регрессии является  
линейная  

Какой показатель рассчитывается по формуле  
коэффициент вариации  

Какой из перечисленных показателей является относительной величиной структуры  
удельный вес городского населения  

Число групп определяется по формуле n = 1+3,322 lgN, если группировка проводится по  
непрерывному признаку  

Как называются интервалы, в которых разность между максимальным и минимальным значениями в каждом из интервалов одинакова  
равные  

Выберите из списка сплошное статистическое наблюдение  
перепись населения  

Какая относительная величина характеризует отношение частей совокупности к общему ее объему  
структуры  

Из каких величин может строиться моментный ряд динамики  
абсолютных и относительных величин  

Как называются ошибки, допущенные при заполнении бланков, оговорка в ответах, нечеткость в вопросе и соответственно в ответе  
случайные  

При цепном способе сравнения  
каждый уровень ряда сравнивается с предыдущим  

К атрибутивным признакам относится  
национальность  

Экономический эффект всегда выражается  
абсолютной величиной  

Валовой располагаемый доход по методу конечного использования определяется как  
сумма валового сбережения и расходов на конечное потребление  

Как называется продукция и услуги одних видов деятельности, потреблённые в производственном процессе других видов деятельности в составе одного и того же предприятия или других предприятий  
промежуточное потребление  

Какой из нижеприведенных видов доходов является доходом от собственности  
рента, дивиденды, проценты  

В ресурсной части какого счета СНС отражаются основные виды первичных доходов, получаемых резидентами, как от резидентов, так и от сектора остального мира  
счет распределения первичных доходов  

Какая наука является теоретической основой социально-экономической статистики  
экономическая теория  

Балансирующей статьей счета операций с капиталом на уровне экономики является  
чистое кредитование или чистое заимствование  

Перемещение населения через границы страны и ее территориальных подразделений, связанное с переменой места жительства навсегда или на определенное время  
миграционное механическое движение  

Что является балансирующей статьей в счете перераспределения доходов в натуральной форме  
Валовой скорректированный располагаемый доход  

Разница между валовым внутренним продуктом и потреблением основного капитала  
чистый внутренний продукт  

Что представляет собой миграционное механическое движение населения  
выбывание и прибытие  

Какой показатель определяется как отношение индекса денежных доходов населения к индексу товарооборота и услуг  
индекс скрытой инфляции  

Что необходимо вычесть из валового национального дохода, чтобы получить чистый национальный доход  
потребление основного капитала  

К видам институциональных единиц относятся  
корпорации, домашние хозяйства, органы государственного управления и некоммерческие организации  

В международной практике принято считать допустимый уровень статистического расхождения, который составляет  
до 5% ВВП  

В основе расчёта национального богатства в соответствии с СНС лежит понятие  
экономических активов  

По каким признакам производят изучение состава населения  
все варианты ответа верны  

Наиболее важный информационный источник данных о населении  
переписи населения  

Объекты в СНС  
товары, услуги, ценные бумаги, денежные средства, рабочая сила или другой любой носитель стоимости  

По источникам происхождения все экономические активы подразделяются на  
произведенные и непроизведенные  

Доходы какого сектора экономики формируются из налогов и отчислений, уплачиваемых институциональными единицами других секторов  
сектор государственного управления  

Материалоотдача определяется как отношение  
экономического эффекта к среднегодовой стоимости оборотных средств  

Что включают в себя налоги на продукты и импорт  
налог на добавленную стоимость  

Как рассчитывается чистая прибыль экономики  
Валовая прибыль экономики ‒ Потребление основного капитала  

К какому из перечисленных секторов экономики относятся государственные организации здравоохранения, образования, культуры, искусства, физической культуры и спорта  
сектор государственного управления

К какому классу средних величин относятся мода и медиана
структурные

Как называется статистическое наблюдение, проводимое через некоторые равные промежутки времени
периодическое

Что произойдет со средней величиной, если каждую варианту уменьшить на одно и то же число
уменьшится на то же число

Какой основной принцип используется при построении агрегатного индекса
принцип взвешивания

Отношение числа выехавших из страны к среднегодовой численности населения ‒ это
коэффициент выбытия

Какие институциональные единицы имеют основную цель своей деятельности «получение прибыли»
корпорации

Отношение численности занятых трудовых ресурсов к численности всех трудовых ресурсов ‒ это
коэффициент занятости трудовых ресурсов

Субъекты в СНС – это
юридические (предприятия, организации, учреждения) и физические (население) лица

Численность экономически активного населения рассчитывается как сумма численности занятого населения и
численности безработных

Как называется цена, которая характеризует фактические затраты пользователей на приобретение товара или услуги
цена покупателя

При базисном способе сравнения
каждый уровень ряда сравнивается с одним и тем же базисным уровнем

Что такое «f» в формулах средних взвешенных
частоты

Какая из средних величин относится к структурным средним
мода

Что произойдет со средней величиной, если каждую варианту уменьшить на одно и то же число
уменьшится на то же число

Пополнение потенциальных трудовых ресурсов вследствие перехода 15-летних в трудоспособный возраст и убыли трудовых ресурсов за счет выхода людей на пенсию, перехода на инвалидность, а также смерти ‒ это
естественное движение трудовых ресурсов

Пополнение потенциальных трудовых ресурсов вследствие перехода 15-летних в трудоспособный возраст и убыли трудовых ресурсов за счет выхода людей на пенсию, перехода на инвалидность, а также смерти ‒ это
метод двойного дефлятирования

Формула расчета основной цены
факторная стоимость + другие чистые налоги на производство

Какие институциональные единицы относятся к сектору финансовых корпораций
банки и страховые организации

Из каких величин может строиться интервальный ряд динамики
абсолютных, относительных и средних величин

Из каких величин может строиться моментный ряд динамики
абсолютных и относительных величин

Себестоимость единицы продукции увеличилась на 8%. Объем производства остался неизменным. Как изменились затраты на производство
выросли на 8%

Количественная сторона массовых социально-экономических явлений, происходящих на макроэкономическом уровне, в неразрывной связи с их качественной стороной, в конкретных условиях места и времени - это
предмет социально-экономической статистики

Какой показатель численности населения равняется численности наличного населения плюс временно отсутствующие и минус временно проживающие
постоянное население

Субъекты в СНС – это
юридические (предприятия, организации, учреждения) и физические (население) лица

Социально-экономические показатели уровня жизни населения рассчитываются
как по всему населению, так и в расчете на душу населения

Как называется показатель, отражающий на уровне экономики ресурсы, которые другие страны мира предоставляют данной стране
чистое заимствование

Мода ряда распределения – это
наиболее часто встречающаяся варианта

Какой относительный показатель можно рассчитать, если известен валовой внутренний продукт страны за 2020 год и его прогнозируемый объем в 2021 году
планового задания

Что является первой стадией статистического исследования
статистическое наблюдение

Операция, при которой одна институциональная единица предоставляет другой товар, услугу или актив без получения взамен товара, услуги, актива, – это
трансферт

К резидентам страны относятся
предприятия с иностранными инвестициями, занятые хозяйственной деятельностью на экономической территории данной страны

Небольшая группа людей, проживающих совместно, объединяющих свои доходы и имущество, и совместно потребляющих продукты и услуги, называется
домашнее хозяйство

Отношение числа родившихся к среднегодовой численности населения ‒ это
коэффициент рождаемости

Какой метод определения ВВП в постоянных ценах основан на пересчете элементов затрат в постоянные цены путем их дефлятирования
метод переоценки элементов затрат

Макроэкономические показатели могут быть оценены
в основных или в рыночных ценах

Как называется выборка, при которой генеральная совокупность разбивается на группы, и отбор производится из каждой группы в случайном порядке
типичная (районированная) выборка

Имеются следующие данные о размере месячной заработной платы четырех рабочих (руб.): 540, 980, 670, 820. Для определения средней заработной платы следует применить формулу средней
арифметической простой

Расхождение между выборочной характеристикой и характеристикой генеральной совокупности является
ошибкой репрезентативности

Графически дискретный ряд распределения может быть представлен
полигоном распределения

Если с увеличением факторного признака средние значения результативного признака возрастает, то между факторным и результативным признаком
существует прямая связь

Какая относительная величина рассчитывается путем отношения планового задания к базисному уровню показателя
планового задания

При аналитическом выравнивании динамический ряд выражается в виде
функции от времени у=f(t)

Статистическая совокупность представляет собой
множество элементов, объединенных единой качественной основой

Какая форма статистического наблюдения представляет собой систематическое наблюдение в установленные сроки учетно-статистической документации в виде отчетов, всесторонне характеризующих итоги работы предприятий и учреждений в течение отчетных периодов
отчетность

К формам статистического наблюдения относят
отчетность и специальное статистическое обследование

В количественном отношении Валовой национальный доход (ВНД) отличается от Валового внутреннего продукта (ВВП) на величину следующего показателя
сальдо первичных доходов, полученных от «остального мира» и переданных «остальному миру»

К трудовым ресурсам относятся
лица младше и старше трудоспособного возраста, занятые в экономике

Что необходимо вычесть из валового сбережения для определения чистого сбережения
потребление основного капитала

Как рассчитываются чистые налоги на продукты
разность между налогами на продукты и субсидиями на продукты

На величину какого показателя валовой скорректированный располагаемый доход отличается от валового располагаемого дохода
сальдо социальных трансфертов в натуральной форме

Фондовооруженность труда определяется как отношение
среднегодовой стоимости основных средств к ресурсам труда (численности трудовых ресурсов)

Валовой национальный доход плюс сальдо текущих трансфертов по сектору «остальной мир» – это
Валовой располагаемый доход

Перемещение населения через границы страны и ее территориальных подразделений, связанное с переменой места жительства навсегда или на определенное время ‒ это
миграционное (механическое) движение

Индекс потребления материальных благ на душу населения рассчитывается путем деления индекса потребления материальных благ всем населением на
индекс среднегодовой численности населения

К какому из перечисленных секторов экономики относятся личные подсобные хозяйства граждан, фермерские хозяйства, торговые точки индивидуальных предпринимателей
сектор домашних хозяйств

Методом конечного использования ВВП рассчитывается
как сумма компонентов конечного использования доходов

Какая относительная величина характеризует отношение частей совокупности к общему ее объему
структуры

Что является основной причиной несопоставимости уровней динамического ряда, построенного по стоимостным показателям
цены

Общее относительное изменение средней цены показывает
индекс средней цены переменного состава

Что из нижеперечисленного является основным принципом формирования выборки
принцип случайного отбора

Что строится на основании отклонений от индекса сезонности, при этом наглядно показывая сезонные колебания
сезонная волна

Укажите несуществующий вид выборочного наблюдения
процентная выборка

Нахождение уровней динамического ряда за его пределами ‒ это
экстраполяция

Как рассчитывается цена покупателя
цена производителя + торгово-транспортные издержки

Выберите из приведенных характеристик ту, что соответствует понятию «Институционная единица»
хозяйственная единица, которая обладает правом осуществления хозяйственной деятельности, самостоятельно распоряжается своими ресурсами, несет ответственность по своим обязательствам и ведет полный набор бухгалтерских счетов

Что является основной причиной несопоставимости уровней динамического ряда, построенного по стоимостным показателям
цены

Из каких величин может строиться интервальный ряд динамики
абсолютных, относительных и средних величин
`;

const qnas = rawQnas
    .split('\n\n')
    .slice(1)
    .map(rawQna => {
        const question = rawQna.split('\n')[0].trim().toLowerCase();
        const answer = rawQna.split('\n')[1].trim().toLowerCase();
        return { question, answer }; 
    });

console.log(qnas);

const questionElements = Array.from(document.querySelector('#region-main > [role="main"] > form > div').childNodes).filter(testElement => testElement.id.includes('question-'));
for (const questionElement of questionElements)
{
    const questionText = questionElement.querySelector('.qtext').innerText.trim().toLowerCase();

    const answerText = qnas.find(qna => questionText.includes(qna.question))?.answer;
    if (answerText === undefined)
    {
        console.log(`Неизвестный вопрос "${questionText}".`);
        continue;
    }

    const answerOptions = Array.from(questionElement.querySelectorAll('.answer > div'));

    const exactMatchAnswerOption = answerOptions.find(answerOption => {
        const answerLabel = answerOption.querySelector('label').innerText.trim().toLowerCase();
        return answerLabel === answerText;
    });
    if (exactMatchAnswerOption !== undefined) {
        exactMatchAnswerOption.querySelector('label').innerText += '.';
        continue;
    }

    const partialMatchAnswerOptions = answerOptions.filter(answerOption => {
        const answerLabel = answerOption.querySelector('label').innerText.trim().toLowerCase();
        return answerLabel.includes(answerText);
    });

    if (partialMatchAnswerOptions.length === 1) {
        const singlePartialMatchAnswerOption = partialMatchAnswerOptions[0];
        singlePartialMatchAnswerOption.querySelector('label').innerText += '.';
        continue;
    }

    console.log(`Нет подходящего варианта ответа для вопроса "${questionText}".`);
    questionElement.querySelector('.qtext').style.marginBottom = 0;
    questionElement.querySelector('.ablock').style.marginTop = 0;
    const answerElement = document.createElement('div');
    answerElement.style.opacity = 0;
    answerElement.innerText = answerText;
    answerElement.addEventListener('click', function() {
        answerElement.style.opacity = 1 - answerElement.style.opacity;
    });
    questionElement.querySelector('.qtext').insertAdjacentElement('afterend', answerElement);
}
