const rawQnas = `
Для открытия текущих (расчетных) банковских счетов для ИП нужно предоставить в банк:
копия свидетельства о государственной регистрации

К какому виду лицензионных договоров относится договор, по условиям которого право использования объекта на оговоренной территории имеет только лицензиат и даже лицензиар не вправе осуществлять какие-либо действия по использованию объекта?
исключительная лицензия

В течении какого периода времени коммерческая и некоммерческая организация обязана направить уведомление в регистрирующий орган при изменении своего местонахождения?
10 рабочих дней

Выигравшим торги по конкурсу признается лицо, которое:
предложило лучшие условия

Лицензия действует
со дня принятия лицензирующим органом решения о ее выдаче и сроком не ограничивается

Как называется маркетинг, применяющийся для восстановления спроса в случае его падения, изменения свойств товара, проникновения на новые рынки?
ремаркетинг

куда предоставляются сведения о том, что юридическое лицо (индивидуальный предприниматель) находится в процессе ликвидации, для включения их в Единый государственный регистр юридических лиц и индивидуальных предпринимателей?
Министерство юстиции

К каким субъектам относится организация, в которой средняя численность работников составляла 200 человек?
Субъекты среднего предпринимательства

При осуществлении государственной регистрации взымается
государственная пошлина

До подачи в регистрирующий орган для государственной регистрации документов, предусмотренных настоящим Положением, собственник имущества должен:
согласовать с регистрирующим органом наименование коммерческой или некоммерческой организации и определить предполагаемое местонахождение

Кто является регистрирующим органом для торгово-промышленных палат
Министерство юстиции

Государственная регистрация страховых организаций, страховых брокеров, объединений страховщиков осуществляется
Министерством финансов 

Государственная регистрация юридического лица производится
по месту его нахождения

Срок предварительного испытания не может
быть больше 3-х месяцев

Что является заключительным этапом создания субъекта хозяйствования
государственная регистрация субъекта хозяйствования

какой маркетинг применяют при наличии сезонных, ежедневных или часовых колебаниях спроса
синхромаркетинг

Государственная регистрация не осуществляется
Страховой компанией

Согласно ст. 30 Налогового кодекса Республики Беларусь работой признается
деятельность, результаты которой имеют материальное выражение и могут быть реализованы для удовлетворения потребностей организации и (или) физических лиц

Территориальный принцип охраны объектов права промышленной собственности
исключительное право на объект действует только в пределах государства, где это право было получено

Как называется ответ лица, которому адресуется предложение, об его принятии
акцепт

Как называется объявление несовершеннолетнего, достигшего возраста 16 лет, полностью дееспособным
эмансипация

Юридическое лицо может быть ликвидировано
все ответы правильные

К какому кластеру относятся такие области компетенции, как управление проектом, выработка архитектуры решения, контроль производственного процесса и административные службы
управление программой 

К первичным патентным документам относятся
описание полезной модели к патенту

Как называется право отказаться от ранее принятого решения об обнародовании
право на отзыв

К какому кластеру относятся такие области компетенции, как интернационализация, обеспечение технической поддержки, обучение пользователей, удобство эксплуатации, графический дизайн
удовлетворение потребителя 

Какой маркетинг применяется в условиях чрезмерного спроса на свой продукт в ситуации, когда спрос превышает предложение, и нет возможности увеличить объём производства
демаркетинг

На основании какого принципа осуществляется государственная регистрация субъектов хозяйствования
заявительный

Юридическое лицо считается ликвидированным, а деятельность индивидуального предпринимателя прекращенной с
даты принятия регистрирующим органом решения о внесении записи в Единый гос. регистр юр. лиц и ИП об исключении их из этого регистра

Как называется договор, условия которого определены одной из сторон в формулярах или иных стандартных формах и могут быть приняты другой стороной не иначе как путем добавления к предложенному договору в целом
договор присоединения

Куда предоставляются сведения о том, что юридическое лицо (индивидуальный предприниматель) находится в процессе ликвидации, для включения их в Единый государственный регистр юридических лиц и индивидуальных предпринимателей
Министерство юстиции

К какому виду лицензионных договоров относится договор, по условиям которого право использования объекта на оговоренной территории имеет только лицензиат и даже лицензиар не вправе осуществлять какие-либо действия по использованию объекта
исключительная лицензия 

Количество участников аукциона (конкурса) должно быть
не менее двух

Законодательством не предусмотрены следующие виды реорганизации
отделение

Контрагент владельца коммерческой тайны
не наделен правом самостоятельно изменять или отменять установленный владельцем режим коммерческой тайны 

Максимальный срок, на который возможно заключить срочный трудовой договор
5 лет

Государственная регистрация индивидуального предпринимателя производится
по месту жительства физического лица 

По решению какого органа государственная регистрация субъектов хозяйствования, осуществленная на основании заведомо ложных сведений, представленных в регистрирующие органы, может быть признана недействительной
суда 

В каком году вступил в силу Декрет Президента Республики Беларусь «О государственной регистрации и ликвидации
2009

Для приобретения статуса индивидуального предпринимателя физическое лицо должно обладать общими признаками субъекта гражданского права
гражданская правоспособность; гражданская дееспособность; иметь имя; иметь место жительства 

Влечет ли передача права собственности на материальный объект передачу каких-либо авторских прав на произведение, выраженное в этом объекте
не влечет

Какое из утверждений неверно
использование знака охраны авторского права носит обязательный характер

Что не является признаком предпринимательства
благотворительная деятельность

Случайные условия договора
вступают в действие после включения их в текст договора

К каким субъектам относится организация, в которой средняя численность работников составляла 200 человек
Субъекты среднего предпринимательства 

Территориальный принцип охраны объектов права промышленной собственности – это когда
исключительное право на объект действует только в пределах государства, где это право было получено

Что не является обязательным действием собственника имущества, учредителей создаваемой коммерческой организации до подачи документов в регистрирующий орган для государственной регистрации
стать на учет в налоговых органах 

Каждая из сторон вправе расторгнуть трудовой договор с предварительным испытанием до истечения срока предварительного испытания, предупредив об этом другую сторону письменно
нет правильного ответа

Согласно Стокгольмской конвенции интеллектуальная собственность - это все права, относящиеся к … деятельности в производственной, научной, литературной и художественной областях
интеллектуальной

В течении какого срока должен быть сформирован уставный фонд коммерческой организации
в течении 12 месяцев

Регистрирующий орган в течение сколько рабочих дней со дня внесения записи о государственной регистрации субъекта хозяйствования в ЕГР выдает документы, подтверждающие постановку на учет в налоговых органах
5 дней 

До подачи в регистрирующий орган для государственной регистрации документов, предусмотренных настоящим Положением, собственник имущества должен
согласовать с регистрирующим органом наименование коммерческой или некоммерческой организации и определить предполагаемое местонахождение

Контроль за регистрацией и ликвидацией субъектов хозяйствования возлагается на
Министерство юстиции 

Каждая из сторон вправе расторгнуть трудовой договор с предварительным испытанием до истечения срока предварительного испытания, предупредив об этом другую сторону письменно
нет правильного ответа 

Как называется процедура проверки подлинности, например проверка подлинности пользователя путем сравнения введенного им пароля с паролем, сохраненным в базе данных
аутентификации 

Государственная регистрация юридического лица производится по
месту нахождения 

Территориальный принцип охраны объектов права промышленной собственности – это когда
исключительное право на объект действует только в пределах государства, где это право было получено 

Государственная регистрация осуществляется следующими регистрирующими органами
все ответы верны 

Как называется предоставление определенному лицу или группе лиц прав на выполнение определенных действий
авторизация 

К каким субъектам относится организация, в которой средняя численность работников составляла 200 человек
Субъекты среднего предпринимательства 

Для приобретения статуса индивидуального предпринимателя физическое лицо должно обладать общими признаками субъекта гражданского права
гражданская правоспособность; гражданская дееспособность; иметь имя; иметь место жительства 

В какой валюте должен быть объявлен уставной фонд коммерческой организации
в белорусских рублях 

Влечет ли передача права собственности на материальный объект передачу каких-либо авторских прав на произведение, выраженное в этом объекте
не влечет 

Кто имеет право принимать на работу, заключать трудовые договоры (контракты) с работниками
все вышеперечисленные лица 

При осуществлении государственной регистрации взымается
государственная пошлина

К какому кластеру относятся такие области компетенции, как управление проектом, выработка архитектуры решения, контроль производственного процесса и административные службы
управление программой 

Что означает диспозитивная норма
правовая норма, которая предписывает вариант поведения, но при этом предоставляет субъектам права возможность, в пределах законных средств, урегулировать отношения по своему усмотрению 

Публичные договоры относятся к
обязательным 

В случае изменения местонахождения коммерческой или некоммерческой организации, такая организация обязана направить в регистрирующий орган уведомление в течение
десяти рабочих дней 

Кто является добросовестными приобретателями сведений, составляющих коммерческую тайну
лица, ознакомившиеся со сведениями, составляющими коммерческую тайну, в результате неправомерных действий третьих лиц, о чем лицо, ознакомившееся с такими сведениями, не знало и не должно было знать 

Максимальный срок, на который возможно заключить срочный трудовой договор
5 лет 

Кто осуществляет ведение Единого государственного реестра юридических лиц и ИП
Министерство юстиции 

В каком году вступил в силу Декрет Президента Республики Беларусь «О государственной регистрации и ликвидации (прекращении деятельности) субъектов хозяйствования
2009 

Как называется маркетинг, применяющийся для восстановления спроса в случае его падения, изменения свойств товара, проникновения на новые рынки
ремаркетинг 

Через какое время Совет Министров и Национальный банк должны обеспечить приведение актов законодательства в соответствие с Декретом № 1
через 3 месяца 

Выигравшим торги по конкурсу признается лицо, которое
предложило лучшие условия 

Что не является документом, подтверждающим полномочия руководителя юридического лица
документ, удостоверяющий личность 

Как называется объявление несовершеннолетнего, достигшего возраста 16 лет, полностью дееспособным
эмансипация 

Законодательством не предусмотрены следующие виды реорганизации
отделение

Согласно ст. 15 Закона Республики Беларусь от 10.11.2008 г. № 455-З «Об информации, информатизации и защите информации» в зависимости от категории доступа информация делится на
Все кроме информацию, распространение и (или) предоставление которой разрешено

Что относится к существенному условию лицензионного договора
Все кроме условие о его безвозмездном характере лицензионного договора

Что относится к существенному условию лицензионного договора
Все кроме условие о его безвозмездном характере лицензионного договора

К какому виду лицензионных договоров относится договор, по условиям которого право использования объекта на оговоренной территории имеет только лицензиат и даже лицензиар не вправе осуществлять какие-либо действия по использованию объекта
исключительная лицензия

Что является существенными условиями соглашения о конфиденциальности
Все кроме условие о сумме возмещения убытков в результате разглашения коммерческой тайны

Законодательно не установлен запрет для руководителей организаций любых организационно-правовых форм на выполнение оплачиваемой работы на условиях штатного совместительства
Все ответы верны

В течении какого периода времени коммерческая и некоммерческая организация обязана направить уведомление в регистрирующий орган при изменении своего местонахождения
10 рабочих дней

Гражданский кодекс Республики Беларусь закрепляет
Все ответы верны

Выигравшим торги по конкурсу признается лицо, которое
предложило лучшие условия

Лицензия действует
со дня принятия лицензирующим органом решения о ее выдаче и сроком не ограничивается

Как называется маркетинг, применяющийся для восстановления спроса в случае его падения, изменения свойств товара, проникновения на новые рынки
ремаркетинг 

Куда предоставляются сведения о том, что юридическое лицо (индивидуальный предприниматель) находится в процессе ликвидации, для включения их в Единый государственный регистр юридических лиц и индивидуальных предпринимателей
Министерство юстиции 

Для государственной регистрации индивидуального предпринимателя в регистрирующий орган предоставляются
Все ответы верны

К каким субъектам относится организация, в которой средняя численность работников составляла 200 человек
Субъекты среднего предпринимательства 

При осуществлении государственной регистрации взымается: При осуществлении государственной регистрации взымается
государственная пошлина

До подачи в регистрирующий орган для государственной регистрации документов, предусмотренных настоящим Положением, собственник имущества должен
согласовать с регистрирующим органом наименование коммерческой или некоммерческой организации и определить предполагаемое местонахождение

Кто является регистрирующим органом для торгово-промышленных палат
Министерство юстиции 

Государственная регистрация страховых организаций, страховых брокеров, объединений страховщиков осуществляется
Министерством финансов 

Государственная регистрация юридического лица производится
по месту его нахождения 

Срок предварительного испытания не может
быть больше 3-х месяцев 

Что является заключительным этапом создания субъекта хозяйствования
государственная регистрация субъекта хозяйствования 

Какой маркетинг применяют при наличии сезонных, ежедневных или часовых колебаниях спроса
синхромаркетинг 

Государственная регистрация не осуществляется
Страховой компанией 

Согласно ст. 30 Налогового кодекса Республики Беларусь работой признается
деятельность, результаты которой имеют материальное выражение и могут быть реализованы для удовлетворения потребностей организации и (или) физических лиц 

Территориальный принцип охраны объектов права промышленной собственности – это когда
исключительное право на объект действует только в пределах государства, где это право было получено 

Как называется ответ лица, которому адресуется предложение, об его принятии
акцепт 

Как называется объявление несовершеннолетнего, достигшего возраста 16 лет, полностью дееспособным
эмансипация 

Юридическое лицо может быть ликвидировано
все ответы правильные 

Кто имеет право принимать на работу, заключать трудовые договоры (контракты) с работниками
все вышеперечисленные лица 

Регистрирующие органы обязаны обеспечить ежедневный в течение всего рабочего времени регистрирующего органа прием документов для государственной регистрации за исключением
все ответы правильны

Кто является регистрирующим органом для объединений страховщиков
Министерство финансов 

При осуществлении государственной регистрации взымается
государственная пошлина

К микроорганизациям относятся зарегистрированные в Республике Беларусь коммерческие организации со средней численностью работников за календарный год
до 15 человек включительно 

Что является заключительным этапом создания субъекта хозяйствования
государственная регистрация субъекта хозяйствования 

По решению какого органа государственная регистрация субъектов хозяйствования, осуществленная на основании заведомо ложных сведений, представленных в регистрирующие органы, может быть признана недействительной
суда 

Что не является задачей маркетинга
нет правильного варианта 

Государственная регистрация юридического лица производится
по месту его нахождения 

Согласно ст. 30 Налогового кодекса Республики Беларусь работой признается
деятельность, результаты которой имеют материальное выражение и могут быть реализованы для удовлетворения потребностей организации и (или) физических лиц 

К первичным патентным документам относятся
описание полезной модели к патенту 

К какому кластеру относятся такие области компетенции, как управление проектом, выработка архитектуры решения, контроль производственного процесса и административные службы
управление программой 

Государственная регистрация осуществляется следующими регистрирующими органами
все ответы верны 

Как называются договор, если для его заключения достаточно соглашения сторон по всем существенным условиям
консенсуальный 

Каждая из сторон вправе расторгнуть трудовой договор с предварительным испытанием до истечения срока предварительного испытания, предупредив об этом другую сторону письменно
нет правильного ответа 

Как называется предоставление определенному лицу или группе лиц прав на выполнение определенных действий
авторизация 

Какой маркетинг применяется в условиях чрезмерного спроса на свой продукт в ситуации, когда спрос превышает предложение, и нет возможности увеличить объём производства
демаркетинг 

Что является основным конститутивным признаком договора
соглашение сторон 

Государственная регистрация информационных ресурсов осуществляется в целях
все перечисленные ответы верны 

В течении какого срока должен быть сформирован уставный фонд коммерческой организации
в течении 12 месяцев 

Государственная регистрация юридического лица производится по
месту нахождения 

Что не является признаком предпринимательства
благотворительная деятельность

Минимальный размер уставного фонда для закрытых акционерных обществ устанавливается в размере
100 базовых величин

Юридическое лицо может быть ликвидировано
все ответы правильные 

Минимальный размер уставного фонда устанавливается в сумме для открытых акционерских обществ
400 базовых величин

Работник пришел устраиваться на работу 3 марта. Трудовой договор заключили 4 марта. Приступил к работе 5 марта. Прошел инструктаж по охране труда 6 марта. Выполнил первое служебное поручение 7 марта. С какого числа начинается действие трудового договора
5 марта

К каким субъектам относится организация, в которой средняя численность работников составляла 200 человек
Субъекты среднего предпринимательства 

Лицензия действует
со дня принятия лицензирующим органом решения о ее выдаче и сроком не ограничивается 

Юридическое лицо считается ликвидированным, а деятельность индивидуального предпринимателя прекращенной с
даты принятия регистрирующим органом решения о внесении записи в Единый гос. регистр юр. лиц и ИП об исключении их из этого регистра

Какой маркетинг применяют при наличии сезонных, ежедневных или часовых колебаниях спроса
синхромаркетинг

Срок ликвидации, устанавливаемый собственником имущества (учредителями, участниками) либо органом юридического лица не может превышать
9-12 месяцев 

Для приобретения статуса индивидуального предпринимателя физическое лицо должно обладать общими признаками субъекта гражданского права
гражданская правоспособность; гражданская дееспособность; иметь имя; иметь место жительства

Согласно ст. 30 Налогового кодекса Республики Беларусь работой признается
деятельность, результаты которой имеют материальное выражение и могут быть реализованы для удовлетворения потребностей организации и (или) физических лиц 

Как называется знак охраны авторского права
знак копирайта

Как называется ответ лица, которому адресуется предложение, об его принятии
акцепт

Кем подписывается заявление о государственной регистрации индивидуального предпринимателя
гражданином, регистрирующимся в качестве индивидуального предпринимателя

Через какое время Совет Министров и Национальный банк должны обеспечить приведение актов законодательства в соответствие с Декретом № 1
через 3 месяца 

На основании какого принципа осуществляется государственная регистрация субъектов хозяйствования
заявительный

Куда предоставляются сведения о том, что юридическое лицо (индивидуальный предприниматель) находится в процессе ликвидации, для включения их в Единый государственный регистр юридических лиц и индивидуальных предпринимателей
Министерство юстиции

Государственная регистрация не осуществляется
Страховой компанией 

К микроорганизациям относятся зарегистрированные в Республике Беларусь коммерческие организации со средней численностью работников за календарный год
до 15 человек включительно 

Заявительный принцип государственной регистрации субъектов хозяйствования не распространяется на государственную регистрацию
банков, небанковских кредитно-финансовых организаций

Что является заключительным этапом создания субъекта хозяйствования
государственная регистрация субъекта хозяйствования 

В какой валюте должен быть объявлен уставной фонд коммерческой организации
в белорусских рублях

Государственная регистрация индивидуального предпринимателя производится
по месту жительства физического лица 

Субъектами личных неимущественных прав являются
авторы произведения 

К какому кластеру относятся такие области компетенции, как интернационализация, обеспечение технической поддержки, обучение пользователей, удобство эксплуатации, графический дизайн
удовлетворение потребителя

Что не является документом, подтверждающим полномочия руководителя юридического лица
документ, удостоверяющий личность 
`;

const qnas = rawQnas
    .split('\n\n')
    .slice(1)
    .map(rawQna => {
        const question = rawQna.split('\n')[0].trim().toLowerCase();
        const answer = rawQna.split('\n')[1].trim().toLowerCase();
        return { question, answer }; 
    });

console.log(qnas);

const questionElements = Array.from(document.querySelector('#region-main > [role="main"] > form > div').childNodes).filter(testElement => testElement.id.includes('question-'));
for (const questionElement of questionElements)
{
    const questionText = questionElement.querySelector('.qtext').innerText.trim().toLowerCase();

    const answerText = qnas.find(qna => questionText.includes(qna.question))?.answer;
    if (answerText === undefined)
    {
        console.log(`Неизвестный вопрос "${questionText}".`);
        continue;
    }

    const answerOptions = Array.from(questionElement.querySelectorAll('.answer > div'));

    const exactMatchAnswerOption = answerOptions.find(answerOption => {
        const answerLabel = answerOption.querySelector('label').innerText.trim().toLowerCase();
        return answerLabel === answerText;
    });
    if (exactMatchAnswerOption !== undefined) {
        exactMatchAnswerOption.querySelector('label').innerText += '.';
        continue;
    }

    const partialMatchAnswerOptions = answerOptions.filter(answerOption => {
        const answerLabel = answerOption.querySelector('label').innerText.trim().toLowerCase();
        return answerLabel.includes(answerText);
    });

    if (partialMatchAnswerOptions.length === 1) {
        const singlePartialMatchAnswerOption = partialMatchAnswerOptions[0];
        singlePartialMatchAnswerOption.querySelector('label').innerText += '.';
        continue;
    }

    console.log(`Нет подходящего варианта ответа для вопроса "${questionText}".`);
    questionElement.querySelector('.qtext').style.marginBottom = 0;
    questionElement.querySelector('.ablock').style.marginTop = 0;
    const answerElement = document.createElement('div');
    answerElement.style.opacity = 0;
    answerElement.innerText = answerText;
    answerElement.addEventListener('click', function() {
        answerElement.style.opacity = 1 - answerElement.style.opacity;
    });
    questionElement.querySelector('.qtext').insertAdjacentElement('afterend', answerElement);
}
